Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/configuration-editing(uk).xlf
Languages: uk

# exampleExtension
source: Example
uk: Приклад

# activeEditorShort
source: the file name (e.g. myFile.txt)
uk: Ім'я файлу (наприклад, myFile.txt)

# activeEditorMedium
source: the path of the file relative to the workspace folder (e.g. myFolder/myFile.txt)
uk: шлях до файлу відносно папки робочого простору (наприклад, myFolder/myFile.txt)

# activeEditorLong
source: the full path of the file (e.g. /Users/Development/myProject/myFolder/myFile.txt)
uk: повний шлях до файлу (наприклад, /Users/Development/myProject/myFolder/myFile.txt)

# rootName
source: name of the workspace (e.g. myFolder or myWorkspace)
uk: ім'я робочої області (наприклад, папка або myWorkspace)

# rootPath
source: file path of the workspace (e.g. /Users/Development/myWorkspace)
uk: шлях до файлу робочої області (наприклад, /Користувачі/розвитку/myWorkspace)

# folderName
source: name of the workspace folder the file is contained in (e.g. myFolder)
uk: ім'я папки робочої області, де міститься файл (наприклад, myFolder)

# folderPath
source: file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)
uk: шлях до папки робочої області, де файл міститься у (наприклад, /Users/Development/myFolder)

# appName
source: e.g. VS Code
uk: наприклад, VS Code

# dirty
source: a dirty indicator if the active editor is dirty
uk: змінення індикатора якщо активний редактор змінений

# separator
source: a conditional separator (' - ') that only shows when surrounded by variables with values
uk: умовний роздільник ( ' - ' ), який відображається лише тоді, коли його оточують змінні зі значеннями

# assocLabelFile
source: Files with Extension
uk: Файли з розширенням

# assocDescriptionFile
source: Map all files matching the glob pattern in their filename to the language with the given identifier.
uk: Відображати всі файли, що відповідають шаблону glob в їх назві до мови з даним ідентифікатором.

# assocLabelPath
source: Files with Path
uk: Файли з шляху

# assocDescriptionPath
source: Map all files matching the absolute path glob pattern in their path to the language with the given identifier.
uk: Відображати всі файли, що відповідають шаблону glob абсолютного шляху, на шляху до мови з даним ідентифікатором.

# fileLabel
source: Files by Extension
uk: Файли за розширенням

# fileDescription
source: Match all files of a specific file extension.
uk: Матч всіх файлів з певним розширенням файлу.

# filesLabel
source: Files with Multiple Extensions
uk: Файли з кількома розширеннями

# filesDescription
source: Match all files with any of the file extensions.
uk: Матч всі файли з будь-якими розширеннями файлів.

# derivedLabel
source: Files with Siblings by Name
uk: Файли з братами по імені

# derivedDescription
source: Match files that have siblings with the same name but a different extension.
uk: Матч файли, які мають братів з таким же ім'ям, але з іншим розширенням.

# topFolderLabel
source: Folder by Name (Top Level)
uk: Папки по імені (верхній рівень)

# topFolderDescription
source: Match a top level folder with a specific name.
uk: Матч папки верхнього рівня з певним ім'ям.

# topFoldersLabel
source: Folders with Multiple Names (Top Level)
uk: Папки з кількома іменами (верхній рівень)

# topFoldersDescription
source: Match multiple top level folders.
uk: Матч кілька папок на верхньому рівні.

# folderLabel
source: Folder by Name (Any Location)
uk: Папки по імені (будь-яке місце)

# folderDescription
source: Match a folder with a specific name in any location.
uk: Матч папки з певним ім'ям в будь-якому місці.

# falseDescription
source: Disable the pattern.
uk: Виключити шаблон.

# trueDescription
source: Enable the pattern.
uk: Включити шаблон.

# siblingsDescription
source: Match files that have siblings with the same name but a different extension.
uk: Матч файли, які мають братів з таким же ім'ям, але з іншим розширенням.

source: Language specific editor settings
uk: Конкретні мовні налаштування редактора

# languageSpecificEditorSettingsDescription
source: Override editor settings for language
uk: Перевизначити параметри редактора для мови
