Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/typescript(uk).xlf
Languages: uk

# typescript.reloadProjects.title
source: Reload Project
uk: Перезавантажити Проект

# javascript.reloadProjects.title
source: Reload Project
uk: Перезавантажити Проект

# typescript.useCodeSnippetsOnMethodSuggest.dec
source: Complete functions with their parameter signature.
uk: Повний набір функцій з їх підписом параметра.

# typescript.tsdk.desc
source: Specifies the folder path containing the tsserver and lib*.d.ts files to use.
uk: Вказує шлях до папки, яка містить tsserver і lib*.d.ts файли для використання.

# typescript.disableAutomaticTypeAcquisition
source: Disables automatic type acquisition. Requires TypeScript >= 2.0.6.
uk: Відключає автоматичний захоплення Типe. Вимагає TypeScript >= 2.0.6.

# typescript.tsserver.log
source: Enables logging of the TS server to a file. This log can be used to diagnose TS Server issues. The log may contain file paths, source code, and other potentially sensitive information from your project.
uk: Дає можливість ведення журналу сервера TS до файлу. Цей журнал можуть використовуватися для діагностики сервер TS питання. Журнал може містити шляхи до файлів, вихідний код і іншу потенційно конфіденційну інформацію з вашого проекту.

# typescript.tsserver.trace
source: Enables tracing of messages sent to the TS server. This trace can be used to diagnose TS Server issues. The trace may contain file paths, source code, and other potentially sensitive information from your project.
uk: Дає можливість відстеження повідомлень, надісланих на сервер TS. Це трасування можна використовувати для діагностики проблем із сервером TS. Трасування може містити шляхи до файлів, вихідний код і іншу потенційно конфіденційну інформацію з вашого проекту.

# typescript.validate.enable
source: Enable/disable TypeScript validation.
uk: On/off TypeScript перевірку.

# typescript.format.enable
source: Enable/disable default TypeScript formatter.
uk: On/off TypeScript форматування за замовчуванням.

# javascript.format.enable
source: Enable/disable default JavaScript formatter.
uk: On/off JavaScript форматування за замовчуванням.

# format.insertSpaceAfterCommaDelimiter
source: Defines space handling after a comma delimiter.
uk: Визначає вільний простір після коми.

# format.insertSpaceAfterConstructor
source: Defines space handling after the constructor keyword. Requires TypeScript >= 2.3.0.
uk: Визначає обробку пробіл після ключового слова конструктор. Вимагає TypeScript >= 2.3.0.

# format.insertSpaceAfterSemicolonInForStatements
source: Defines space handling after a semicolon in a for statement.
uk: Визначає обробку пробілів після крапка з комою в визначенні.

# format.insertSpaceBeforeAndAfterBinaryOperators
source: Defines space handling after a binary operator.
uk: Визначає обробку пробілів після бінарного оператора.

# format.insertSpaceAfterKeywordsInControlFlowStatements
source: Defines space handling after keywords in a control flow statement.
uk: Визначає обробку пробілів після запитів у інструкції управління потоком.

# format.insertSpaceAfterFunctionKeywordForAnonymousFunctions
source: Defines space handling after function keyword for anonymous functions.
uk: Визначає обробку пробілів після ключового слова function для анонімних функцій.

# format.insertSpaceBeforeFunctionParenthesis
source: Defines space handling before function argument parentheses. Requires TypeScript >= 2.1.5.
uk: Визначає обробку пробілів перед аргументом функції в дужках. Вимагає TypeScript >= 2.1.5.

# format.insertSpaceAfterOpeningAndBeforeClosingNonemptyParenthesis
source: Defines space handling after opening and before closing non empty parenthesis.
uk: Визначає вільний простір після відкриття і перед закриттям не порожніх дужок(parenthesis).

# format.insertSpaceAfterOpeningAndBeforeClosingNonemptyBrackets
source: Defines space handling after opening and before closing non empty brackets.
uk: Визначає вільний простір після відкриття і перед закриттям не порожніх дужок(brackets).

# format.insertSpaceAfterOpeningAndBeforeClosingNonemptyBraces
source: Defines space handling after opening and before closing non empty braces. Requires TypeScript >= 2.3.0.
uk: Визначає вільний простір після відкриття і перед закриттям не порожніх фігурних дужок. Вимагає TypeScript >= 2.3.0.

# format.insertSpaceAfterOpeningAndBeforeClosingTemplateStringBraces
source: Defines space handling after opening and before closing template string braces. Requires TypeScript >= 2.0.6.
uk: Визначає вільний простір після відкриття та перед закриттям дужок стрічки шаблону. Вимагає TypeScript >= 2.0.6.

# format.insertSpaceAfterOpeningAndBeforeClosingJsxExpressionBraces
source: Defines space handling after opening and before closing JSX expression braces. Requires TypeScript >= 2.0.6.
uk: Визначає вільний простір після відкриття і перед закриттям дужок шаблону JSX. Вимагає TypeScript >= 2.0.6.

# format.insertSpaceAfterTypeAssertion
source: Defines space handling after type assertions in TypeScript. Requires TypeScript >= 2.4.
uk: Визначає вільний простір після затвердження типу в TypeScript. Вимагає TypeScript >= 2.4.

# format.placeOpenBraceOnNewLineForFunctions
source: Defines whether an open brace is put onto a new line for functions or not.
uk: Визначає, чи відкрити дужку з нового рядку для функції чи ні.

# format.placeOpenBraceOnNewLineForControlBlocks
source: Defines whether an open brace is put onto a new line for control blocks or not.
uk: Визначає, чи відкрити дужку з нового рядку для блоків управління чи ні.

# javascript.validate.enable
source: Enable/disable JavaScript validation.
uk: On/off JavaScript перевірку.

# typescript.goToProjectConfig.title
source: Go to Project Configuration
uk: Перейдіть в Налаштування проекту

# javascript.goToProjectConfig.title
source: Go to Project Configuration
uk: Перейдіть в Налаштування проекту

# javascript.referencesCodeLens.enabled
source: Enable/disable references CodeLens in JavaScript files.
uk: Включити/відключити посилання codelens в JavaScript.

# typescript.referencesCodeLens.enabled
source: Enable/disable references CodeLens in TypeScript files. Requires TypeScript >= 2.0.6.
uk: Включити/відключити посилання codelens в TypeScript файли. Вимагає TypeScript >= 2.0.6.

# typescript.implementationsCodeLens.enabled
source: Enable/disable implementations CodeLens. Requires TypeScript >= 2.2.0.
uk: Включити/відключити реалізації за допомогою codelens. Вимагає TypeScript >= 2.2.0.

# typescript.openTsServerLog.title
source: Open TS Server log
uk: Відкритий сервер TS журналу

# typescript.restartTsServer
source: Restart TS server
uk: Перезапустіть сервер TS

# typescript.selectTypeScriptVersion.title
source: Select TypeScript Version
uk: Виберіть версію TypeScript

# typescript.reportStyleChecksAsWarnings
source: Report style checks as warnings
uk: Перевіряє стиль звіту в якості попередження

# jsDocCompletion.enabled
source: Enable/disable auto JSDoc comments
uk: Включити/відключити автоматичні JSDoc коментарі

# javascript.implicitProjectConfig.checkJs
source: Enable/disable semantic checking of JavaScript files. Existing jsconfig.json or tsconfig.json files override this setting. Requires TypeScript >=2.3.1.
uk: Включити/виключити перевірку коректності JavaScript файлів. Існуючі jsconfig.json або tsconfig.json-файли перевизначають цей параметр. Вимагає TypeScript >=2.3.1.

# typescript.npm
source: Specifies the path to the NPM executable used for Automatic Type Acquisition. Requires TypeScript >= 2.3.4.
uk: Визначає шлях до виконуваного файлу NPM, який використовується для автоматичного отримання типу. Вимагає TypeScript > = 2.3.4.

# typescript.check.npmIsInstalled
source: Check if NPM is installed for Automatic Type Acquisition.
uk: Перевірте, чи встановлено NPM для автоматичного отримання типу.

# javascript.nameSuggestions
source: Enable/disable including unique names from the file in JavaScript suggestion lists.
uk: Увімкнути або вимкнути, у тому числі унікальні назви з файлу в списки пропозицій JavaScript.

# typescript.tsc.autoDetect
source: Controls auto detection of tsc tasks. 'off' disables this feature. 'build' only creates single run compile tasks. 'watch' only creates compile and watch tasks. 'on' creates both build and watch tasks. Default is 'on'.
uk: Контролює автоматичне визначення tsc завдань. 'off' вимикає цю функцію. 'build' створює лише одноразові завдання компіляції. 'watch' лише компілює та спостерігає за завданнями. 'on' створює обидва завдання: побудови та спостереження. За замовчуванням 'on'.

# typescript.problemMatchers.tsc.label
source: TypeScript problems
uk: TypeScript проблеми

# typescript.problemMatchers.tscWatch.label
source: TypeScript problems (watch mode)
uk: TypeScript проблеми (режим спостереження)

# typescript.quickSuggestionsForPaths
source: Enable/disable quick suggestions when typing out an import path.
uk: Включення/виключення швидкої пропозиції при введенні в шлях імпорту.

# typescript.locale
source: Sets the locale used to report TypeScript errors. Requires TypeScript >= 2.6.0. Default of 'null' uses VS Code's locale for TypeScript errors.
uk: Задає мову, використовуваний для доповіді TypeScript помилки. Вимагає TypeScript >= 2.6.0. За замовчуванням значення NULL використовує VS Code мову для TypeScript помилок.

# javascript.implicitProjectConfig.experimentalDecorators
source: Enable/disable 'experimentalDecorators' for JavaScript files that are not part of a project. Existing jsconfig.json or tsconfig.json files override this setting. Requires TypeScript >=2.3.1.
uk: Включення/вимикання 'experimentalDecorators' для JavaScript-файлів, які не є частиною проекту. Існуючі jsconfig.json або tsconfig.json-файли перевизначають цей параметр. Вимагає TypeScript >=2.3.1.

# typescript.autoImportSuggestions.enabled
source: Enable/disable auto import suggestions. Requires TypeScript >=2.6.1
uk: Включити/виключити автоматичну пропозицію імпорту. Вимагає TypeScript >=2.6.1

# typescript.projectConfigNoWorkspace
source: Please open a folder in VS Code to use a TypeScript or JavaScript project
uk: Будь ласка, відкрийте папку в VS Code, щоб використовувати TypeScript або JavaScript проект

# typescript.projectConfigUnsupportedFile
source: Could not determine TypeScript or JavaScript project. Unsupported file type
uk: Не вдалося визначити TypeScript або JavaScript проект. Файл непідтримуваного типу

# typescript.projectConfigCouldNotGetInfo
source: Could not determine TypeScript or JavaScript project
uk: Не вдалося визначити TypeScript або JavaScript проект

# typescript.noTypeScriptProjectConfig
source: File is not part of a TypeScript project
uk: Файл не є частиною проекту TypeScript

# typescript.noJavaScriptProjectConfig
source: File is not part of a JavaScript project
uk: Файл не є частиною проекту на JavaScript

# typescript.configureTsconfigQuickPick
source: Configure tsconfig.json
uk: Настроювання tsconfig.json

# typescript.configureJsconfigQuickPick
source: Configure jsconfig.json
uk: Настроювання jsconfig.json

# typescript.projectConfigLearnMore
source: Learn More
uk: Дізнатися Більше

# noServerFound
source: The path {0} doesn't point to a valid tsserver install. Falling back to bundled TypeScript version.
uk: Шлях {0} не вказує на допустимий tsserver установки. Повернутися до пакетної TypeScript версії.

# serverCouldNotBeStarted
source: TypeScript language server couldn't be started. Error message is: {0}
uk: Сервер TypeScript мови не може бути запущений. Повідомлення про помилку: {0}

# typescript.openTsServerLog.notSupported
source: TS Server logging requires TS 2.2.2+
uk: TS журналювання потрібне TS 2.2.2+

# typescript.openTsServerLog.loggingNotEnabled
source: TS Server logging is off. Please set `typescript.tsserver.log` and restart the TS server to enable logging
uk: Сервер TS журналювання не включено. Будь ласка, встановіть `typescript.tsserver.log` і перезавантажте сервер TS, щоб увімкнути журналювання

# typescript.openTsServerLog.enableAndReloadOption
source: Enable logging and restart TS server
uk: Увімкнути журналювання і перезапустити сервер TS

# typescript.openTsServerLog.noLogFile
source: TS Server has not started logging.
uk: Сервер TS не розпочав ведення журналу.

# openTsServerLog.openFileFailedFailed
source: Could not open TS Server log file
uk: Не вдалося відкрити файл журналу сервера TS

# serverDiedAfterStart
source: The TypeScript language service died 5 times right after it got started. The service will not be restarted.
uk: Сервіс TypeScript мови помер 5 разів відразу після його старту. Сервіс не буде перезапущений.

# serverDiedReportIssue
source: Report Issue
uk: Звіт

# serverDied
source: The TypeScript language service died unexpectedly 5 times in the last 5 Minutes.
uk: Сервіс TypeScript мови несподівано помер 5 разів за останні 5 хвилин.

# selectCodeAction
source: Select code action to apply
uk: Виберіть дію коду, яку потрібно застосувати

# acquiringTypingsLabel
source: Acquiring typings...
uk: Придбання typings...

# acquiringTypingsDetail
source: Acquiring typings definitions for IntelliSense.
uk: Придбання typings визначень для IntelliSense.

# autoImportLabel
source: Auto import from {0}
uk: Автоматичний імпорт з {0}

# ts-check
source: Enables semantic checking in a JavaScript file. Must be at the top of a file.
uk: Включає семантичні перевірки в файлі JavaScript. Повинні бути у верхній частині файлу.

# ts-nocheck
source: Disables semantic checking in a JavaScript file. Must be at the top of a file.
uk: Виключає семантичнуперевірку в файлі JavaScript. Повинні бути у верхній частині файлу.

# ts-ignore
source: Suppresses @ts-check errors on the next line of a file.
uk: Пригнічує @ts-check помилки в наступному рядку файлу.

# oneImplementationLabel
source: 1 implementation
uk: 1 реалізація

# manyImplementationLabel
source: {0} implementations
uk: {0} реалізацій

# implementationsErrorLabel
source: Could not determine implementations
uk: Не вдалося визначити реалізацій

# typescript.jsDocCompletionItem.documentation
source: JSDoc comment
uk: JSDoc коментарі

# oneReferenceLabel
source: 1 reference
uk: 1 посилання

# manyReferenceLabel
source: {0} references
uk: {0} посилань

# referenceErrorLabel
source: Could not determine references
uk: Не можу визначити посилання

# buildTscLabel
source: build - {0}
uk: будувати - {0}

# buildAndWatchTscLabel
source: watch - {0}
uk: дивитися - {0}

source: invalid version
uk: Невірна версія

# hintExclude
source: To enable project-wide JavaScript/TypeScript language features, exclude folders with many files, like: {0}
uk: Для включення проекту в JavaScript/typescript мовні особливості, виключити папки з великою кількістю файлів, наприклад: {0}

# hintExclude.generic
source: To enable project-wide JavaScript/TypeScript language features, exclude large folders with source files that you do not work on.
uk: Для включення проекту в JavaScript/typescript мовні можливості, виключити великі папки з вихідними файлами, на яких ви не працюєте.

# large.label
source: Configure Excludes
uk: Настроювання виключень

# hintExclude.tooltip
source: To enable project-wide JavaScript/TypeScript language features, exclude large folders with source files that you do not work on.
uk: Для включення проекту в JavaScript/typescript мовні можливості, виключити великі папки з вихідними файлами, на яких ви не працюєте.

# installingPackages
source: Fetching data for better TypeScript IntelliSense
uk: Дані вибірки для кращого TypeScript технології intellisense

# typesInstallerInitializationFailed.title
source: Could not install typings files for JavaScript language features. Please ensure that NPM is installed or configure 'typescript.npm' in your user settings
uk: Не вдалося інсталювати typings файли для функцій JavaScript мови. Будь ласка переконайтеся, що NPM встановлений або налаштувати 'typescript.npm' у ваших налаштуваннях

# typesInstallerInitializationFailed.moreInformation
source: More Information
uk: Додаткові відомості

# typesInstallerInitializationFailed.doNotCheckAgain
source: Don't Check Again
uk: Не раз перевіряти знову

# typesInstallerInitializationFailed.close
source: Close
uk: Закрити

# useVSCodeVersionOption
source: Use VS Code's Version
uk: Використовувати VS Code версію

# useWorkspaceVersionOption
source: Use Workspace Version
uk: Використання робочого простору версію

source: Learn More
uk: Дізнатися Більше

# selectTsVersion
source: Select the TypeScript version used for JavaScript and TypeScript language features
uk: Виберіть Тypescript версія використовувати для JavaScript і Тypescript особливостей

# couldNotLoadTsVersion
source: Could not load the TypeScript version at this path
uk: Не вдалося завантажити Тypescript версію на цьому шляху

# noBundledServerFound
source: VS Code's tsserver was deleted by another application such as a misbehaving virus detection tool. Please reinstall VS Code.
uk: VS Code's Tsserver був видалений іншою програмою, такою як інструмент виявлення вірусів за поведінкою. Будь ласка, переустановіть VS Code.
