Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_base(uk).xlf
Languages: uk

# quickOpenAriaLabelEntry
source: {0}, picker
uk: {0}, вибір

# quickOpenAriaLabel
source: picker
uk: вибір

# sev.error
source: Error
uk: Халепа

# sev.warning
source: Warning
uk: Увага

# sev.info
source: Info
uk: Інформація

# repeated
source: {0} (occurred again)
uk: {0} (виникла знову)

# alertErrorMessage
source: Error: {0}
uk: Помилка: {0}

# alertWarningMessage
source: Warning: {0}
uk: Увага: {0}

# alertInfoMessage
source: Info: {0}
uk: Інформація: {0}

# defaultLabel
source: input
uk: введіть

# TaskRunner.UNC
source: Can't execute a shell command on an UNC drive.
uk: Не вдалося виконати shell команду на диску UNC.

# notFound
source: {0} not found inside zip.
uk: {0} не знайдено всередині zip.

source: Collapse
uk: Згорнути

# error.defaultMessage
source: An unknown error occurred. Please consult the log for more details.
uk: Незрозуміла халепа. Подивись log, щоб побачити більше деталей.

# nodeExceptionMessage
source: A system error occurred ({0})
uk: Виникла помилка системи ({0})

# error.moreErrors
source: {0} ({1} errors in total)
uk: {0} ({1} помилок усього)

# quickOpenAriaLabel
source: Quick picker. Type to narrow down results.
uk: Швидкий вибір. Введіть, щоб звузити варіанти.

# treeAriaLabel
source: Quick Picker
uk: Швидкий вибір

# caseDescription
source: Match Case
uk: Порівнювати регістр

# wordsDescription
source: Match Whole Word
uk: Порівнювати ціле слово

# regexDescription
source: Use Regular Expression
uk: Застосувати регулярний вираз

source: More
uk: Ще

# largeImageError
source: The image is too large to display in the editor.
uk: Зображення занадто велике для відображення у редакторі.

# resourceOpenExternalButton
source: Open image using external program?
uk: Відкрити зображення зовнішньою програмою?

# nativeBinaryError
source: The file will not be displayed in the editor because it is either binary, very large or uses an unsupported text encoding.
uk: Не можна відкрити файл в редакторі. Можливо, файл є бінарним, або занадто великим, або не підтримується таке кодування тексту.

# sizeB
source: {0}B
uk: {0}Байт

# sizeKB
source: {0}KB
uk: {0}КБайт

# sizeMB
source: {0}MB
uk: {0}МБайт

# sizeGB
source: {0}GB
uk: {0}ГБайт

# sizeTB
source: {0}TB
uk: {0}ТБайт

# error.invalidSymbol
source: Invalid symbol
uk: Невірний символ

# error.invalidNumberFormat
source: Invalid number format
uk: Невірний числовий формат

# error.propertyNameExpected
source: Property name expected
uk: Очікується ім'я властивості

# error.valueExpected
source: Value expected
uk: Очікується значення

# error.colonExpected
source: Colon expected
uk: Очікується двокрапка

# error.commaExpected
source: Comma expected
uk: Очікується кома

# error.closeBraceExpected
source: Closing brace expected
uk: Очікується закриваюча фігурна дужка

# error.closeBracketExpected
source: Closing bracket expected
uk: Очікується закриваюча дужка

# error.endOfFileExpected
source: End of file expected
uk: Очікується кінець файлу
