Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_editor_contrib(uk).xlf
Languages: uk

# smartSelect.jumpBracket
source: Go to Bracket
uk: Перейти до дужки

# caret.moveLeft
source: Move Caret Left
uk: Перевести курсор ліворуч

# caret.moveRight
source: Move Caret Right
uk: Перевести курсор праворуч

# transposeLetters.label
source: Transpose Letters
uk: Поміняти літери місцями

# actions.clipboard.cutLabel
source: Cut
uk: Вирізати

# actions.clipboard.copyLabel
source: Copy
uk: Скопіювати

# actions.clipboard.pasteLabel
source: Paste
uk: Вставити

# actions.clipboard.copyWithSyntaxHighlightingLabel
source: Copy With Syntax Highlighting
uk: Скопіювати з підсвічуваннями синтаксу

# comment.line
source: Toggle Line Comment
uk: Переключити коментування рядка

# comment.line.add
source: Add Line Comment
uk: Закоментувати рядок

# comment.line.remove
source: Remove Line Comment
uk: Вилучити коментування рядка

# comment.block
source: Toggle Block Comment
uk: Переключити коментування блоку тексту

# action.showContextMenu.label
source: Show Editor Context Menu
uk: Показати контекстне меню редактора

# startFindAction
source: Find
uk: Знайти

# findNextMatchAction
source: Find Next
uk: Знайти наступне

# findPreviousMatchAction
source: Find Previous
uk: Знайти попереднє

# nextSelectionMatchFindAction
source: Find Next Selection
uk: Знайти наступний виділений фрагмент

# previousSelectionMatchFindAction
source: Find Previous Selection
uk: Знайти попередній виділений фрагмент

# startReplace
source: Replace
uk: Замінити

# showNextFindTermAction
source: Show Next Find Term
uk: Показати наступний знайдений фрагмент

# showPreviousFindTermAction
source: Show Previous Find Term
uk: Показати попередній знайдений фрагмент

# unfoldAction.label
source: Unfold
uk: Розгорнути

# unFoldRecursivelyAction.label
source: Unfold Recursively
uk: Розгорнути рекурсивно

# foldAction.label
source: Fold
uk: Згорнути

# foldRecursivelyAction.label
source: Fold Recursively
uk: Згорнути рекурсивно

# foldAllBlockComments.label
source: Fold All Block Comments
uk: Згорнути всі закоментовані блоки

# foldAllMarkerRegions.label
source: Fold All Regions
uk: Згорнути всі регіони

# unfoldAllMarkerRegions.label
source: Unfold All Regions
uk: Розгорнути всі регіони

# foldAllAction.label
source: Fold All
uk: Згорнути все

# unfoldAllAction.label
source: Unfold All
uk: Розгорнути все

# foldLevelAction.label
source: Fold Level {0}
uk: Згорнути рівень {0}

# hint11
source: Made 1 formatting edit on line {0}
uk: Виконано 1 зміну формату у рядку {0}

# hintn1
source: Made {0} formatting edits on line {1}
uk: Виконано {0} змін формату у рядку {1}

# hint1n
source: Made 1 formatting edit between lines {0} and {1}
uk: Виконано 1 зміну формату між рядками {0} та {1}

# hintnn
source: Made {0} formatting edits between lines {1} and {2}
uk: Виконано {0} змін формату між рядками {1} та {2}

# no.provider
source: Sorry, but there is no formatter for '{0}'-files installed.
uk: На жаль немає не форматувальника для файлів типу '{0}'.

# formatDocument.label
source: Format Document
uk: Форматувати документ

# formatSelection.label
source: Format Selection
uk: Форматувати виділений фрагмент

# noResultWord
source: No definition found for '{0}'
uk: Не знайдено визначення для "{0}"

# generic.noResults
source: No definition found
uk: Не знайдено визначення

# meta.title
source: – {0} definitions
uk: – {0} визначень

# actions.goToDecl.label
source: Go to Definition
uk: Перейти до визначення

# actions.goToDeclToSide.label
source: Open Definition to the Side
uk: Відкрити визначення збоку

# actions.previewDecl.label
source: Peek Definition
uk: Переглянути визначення

# goToImplementation.noResultWord
source: No implementation found for '{0}'
uk: Не знайдено реалізації для "{0}"

# goToImplementation.generic.noResults
source: No implementation found
uk: Не знайдено реалізації

# meta.implementations.title
source: – {0} implementations
uk: – {0} реалізацій

# actions.goToImplementation.label
source: Go to Implementation
uk: Перейти до реалізації

# actions.peekImplementation.label
source: Peek Implementation
uk: Переглянути реалізацію

# goToTypeDefinition.noResultWord
source: No type definition found for '{0}'
uk: Немає визначення типу для "{0}"

# goToTypeDefinition.generic.noResults
source: No type definition found
uk: Тип не визначено

# meta.typeDefinitions.title
source: – {0} type definitions
uk: – {0} визначень типу

# actions.goToTypeDefinition.label
source: Go to Type Definition
uk: Перейти до визначення типу

# actions.peekTypeDefinition.label
source: Peek Type Definition
uk: Переглянути визначення типу

# multipleResults
source: Click to show {0} definitions.
uk: Натисніть, щоб показати {0} визначень.

# markerAction.next.label
source: Go to Next Error or Warning
uk: Перейти до наступної халепи або попередження

# markerAction.previous.label
source: Go to Previous Error or Warning
uk: Перейти до попередньої халепи або попередження

# editorMarkerNavigationError
source: Editor marker navigation widget error color.
uk: Колір халепи навігаційного віджета редактору маркерів.

# editorMarkerNavigationWarning
source: Editor marker navigation widget warning color.
uk: Колір попередження навігаційного віджета редактору маркерів.

# editorMarkerNavigationInfo
source: Editor marker navigation widget info color.
uk: Колір інфо навігаційного віджета редактору маркерів.

# editorMarkerNavigationBackground
source: Editor marker navigation widget background.
uk: Колір фону навігаційного віджета редактору маркерів.

source: Show Hover
uk: Показати курсор

# InPlaceReplaceAction.previous.label
source: Replace with Previous Value
uk: Замінити попереднім значенням

# InPlaceReplaceAction.next.label
source: Replace with Next Value
uk: Замінити наступним значенням

# lines.copyUp
source: Copy Line Up
uk: Скопіювати рядок догори

# lines.copyDown
source: Copy Line Down
uk: Скопіювати рядок донизу

# lines.moveUp
source: Move Line Up
uk: Посунути рядок догори

# lines.moveDown
source: Move Line Down
uk: Посунути рядок донизу

# lines.sortAscending
source: Sort Lines Ascending
uk: Сортувати рядки за зростанням

# lines.sortDescending
source: Sort Lines Descending
uk: Сортувати рядки за спаданням

# lines.trimTrailingWhitespace
source: Trim Trailing Whitespace
uk: Обрізати пробіли в кінці рядків

# lines.delete
source: Delete Line
uk: Видалити рядок

# lines.indent
source: Indent Line
uk: Збільшити відступ рядка

# lines.outdent
source: Outdent Line
uk: Зменшити відступ рядка

# lines.insertBefore
source: Insert Line Above
uk: Вставити рядок вище

# lines.insertAfter
source: Insert Line Below
uk: Вставити рядок нижче

# lines.deleteAllLeft
source: Delete All Left
uk: Видалити усе ліворуч

# lines.deleteAllRight
source: Delete All Right
uk: Видалити усе праворуч

# lines.joinLines
source: Join Lines
uk: Обʼєднати рядки

# editor.transpose
source: Transpose characters around the cursor
uk: Поміняти місцями символи навколо курсору

# editor.transformToUppercase
source: Transform to Uppercase
uk: Перетворення у верхній регістр

# editor.transformToLowercase
source: Transform to Lowercase
uk: Перетворення в нижній регістр

# links.navigate.mac
source: Cmd + click to follow link
uk: Cmd + клацніть, щоб перейти за посиланням

# links.navigate
source: Ctrl + click to follow link
uk: Ctlr + клацніть, щоб перейти за посиланням

# links.command.mac
source: Cmd + click to execute command
uk: Cmd + клацніть, щоб виконати команду

# links.command
source: Ctrl + click to execute command
uk: Ctrl + клацніть, щоб виконати команду

# links.navigate.al
source: Alt + click to follow link
uk: Alt + клацніть, щоб перейти за посиланням

# links.command.al
source: Alt + click to execute command
uk: Alt + клацніть, щоб виконати команду

# invalid.url
source: Sorry, failed to open this link because it is not well-formed: {0}
uk: На жаль, не вдалося відкрити це посилання, тому що воно не добре сформовано: {0}

# missing.url
source: Sorry, failed to open this link because its target is missing.
uk: На жаль, не вдалося відкрити це посилання, оскільки його ціль відсутня.

# label
source: Open Link
uk: Відкрити посилання

# mutlicursor.insertAbove
source: Add Cursor Above
uk: Додати курсор вище

# mutlicursor.insertBelow
source: Add Cursor Below
uk: Додати курсор нижче

# mutlicursor.insertAtEndOfEachLineSelected
source: Add Cursors to Line Ends
uk: Додати курсори в кінці рядків

source: Add Selection To Next Find Match
uk: Додати вибір до наступної відповідності

source: Add Selection To Previous Find Match
uk: Додати вибір до попередньої відповідності

# moveSelectionToNextFindMatch
source: Move Last Selection To Next Find Match
uk: Перемістити останній вибір до наступного пошуку відповідності

# moveSelectionToPreviousFindMatch
source: Move Last Selection To Previous Find Match
uk: Перемістити останній вибір до попереднього пошуку відповідності

source: Select All Occurrences of Find Match
uk: Вибрати усі випадки збігу

# changeAll.label
source: Change All Occurrences
uk: Змінити Всі Входження

# parameterHints.trigger.label
source: Trigger Parameter Hints
uk: Перемикач параметру підказки

# quickFixWithKb
source: Show Fixes ({0})
uk: Показати виправлення ({0})

# quickFix
source: Show Fixes
uk: Показати виправлення

# quickfix.trigger.label
source: Quick Fix
uk: Швидке виправлення

# meta.titleReference
source: – {0} references
uk: - посилань {0}

# references.action.label
source: Find All References
uk: Знайти всі посилання

source: No result.
uk: Нема результату.

# aria
source: Successfully renamed '{0}' to '{1}'. Summary: {2}
uk: Успішно перейменовано "{0}" з "{1}". Всього: {2}

# rename.failed
source: Sorry, rename failed to execute.
uk: На жаль, перейменувати не вдалося.

# rename.label
source: Rename Symbol
uk: Перейменувати символ

# smartSelect.grow
source: Expand Select
uk: Розгорнути обране

# smartSelect.shrink
source: Shrink Select
uk: Згорнути обране

# arai.alert.snippet
source: Accepting '{0}' did insert the following text: {1}
uk: Приймаючи '{0}' вставити наступний текст: {1}

# suggest.trigger.label
source: Trigger Suggest
uk: Перемикач пропозицій

# toggle.tabMovesFocus
source: Toggle Tab Key Moves Focus
uk: Переміщення фокусу клавішею Tab

# wordHighlight
source: Background color of a symbol during read-access, like reading a variable.
uk: Колір фону символу під час читання, як читання змінної.

# wordHighlightStrong
source: Background color of a symbol during write-access, like writing to a variable.
uk: Колір фону символу під час запису, як запис в змінну.

# overviewRulerWordHighlightForeground
source: Overview ruler marker color for symbol highlights.
uk: Колір для виділених проміжків на лінійці огляду

# overviewRulerWordHighlightStrongForeground
source: Overview ruler marker color for write-access symbol highlights.
uk: Огляд лінійки кольору маркерів для доступ на запис символу підсвічування.

# wordHighlight.next.label
source: Go to Next Symbol Highlight
uk: Перейти до наступного символу підсвічування

# wordHighlight.previous.label
source: Go to Previous Symbol Highlight
uk: Перейти до попереднього символу підсвічування

# label.find
source: Find
uk: Знайти

# placeholder.find
source: Find
uk: Знайти

# label.previousMatchButton
source: Previous match
uk: Попереднє співпадання

# label.nextMatchButton
source: Next match
uk: Наступне співпадання

# label.toggleSelectionFind
source: Find in selection
uk: Знайти у виділеному фрагменті

# label.closeButton
source: Close
uk: Закрити

# label.replace
source: Replace
uk: Замінити

# placeholder.replace
source: Replace
uk: Замінити

# label.replaceButton
source: Replace
uk: Замінити

# label.replaceAllButton
source: Replace All
uk: Замінити всі

# label.toggleReplaceButton
source: Toggle Replace mode
uk: Переключити режим заміни

# title.matchesCountLimit
source: Only the first {0} results are highlighted, but all find operations work on the entire text.
uk: Виділяти тільки перший {0} результат, але всі операції пошуку роботи по всьому тексту.

# label.matchesLocation
source: {0} of {1}
uk: {0} із {1}

# label.noResults
source: No Results
uk: Результатів немає

# labelLoading
source: Loading...
uk: Завантаження...

# aria.oneReference
source: symbol in {0} on line {1} at column {2}
uk: символ {0} У рядку {1} в стовпець {2}

# aria.fileReferences.1
source: 1 symbol in {0}, full path {1}
uk: 1 символ {0}, повний шлях {1}

# aria.fileReferences.N
source: {0} symbols in {1}, full path {2}
uk: {0} символів {1}, повний шлях {2}

# aria.result.0
source: No results found
uk: Результатів не знайдено

# aria.result.1
source: Found 1 symbol in {0}
uk: Знайдено 1 символ {0}

# aria.result.n1
source: Found {0} symbols in {1}
uk: Знайшли {0} символів {1}

# aria.result.nm
source: Found {0} symbols in {1} files
uk: Знайшли {0} символів {1} файли

# label.close
source: Close
uk: Закрити

# modesContentHover.loading
source: Loading...
uk: Завантаження...

# hint
source: {0}, hint
uk: {0}, Підказка

# renameAriaLabel
source: Rename input. Type new name and press Enter to commit.
uk: Перейменувати ввід. Введіть нове ім'я та натисніть клавішу Enter для фіксації.

# editorSuggestWidgetBackground
source: Background color of the suggest widget.
uk: Колір фону віджету пропозицій.

# editorSuggestWidgetBorder
source: Border color of the suggest widget.
uk: Колір рамки віджету пропозицій.

# editorSuggestWidgetForeground
source: Foreground color of the suggest widget.
uk: Колір переднього плану віджету пропозицій.

# editorSuggestWidgetSelectedBackground
source: Background color of the selected entry in the suggest widget.
uk: Колір фону для виділеного елемента у віджеті пропозицій.

# editorSuggestWidgetHighlightForeground
source: Color of the match highlights in the suggest widget.
uk: Колір збігу підсвічується у віджеті пропозицій.

# readMore
source: Read More...{0}
uk: Читати далі... {0}

# suggestionWithDetailsAriaLabel
source: {0}, suggestion, has details
uk: {0}, пропозиція, має подробиці

# suggestionAriaLabel
source: {0}, suggestion
uk: {0}, пропозиція

# readLess
source: Read less...{0}
uk: Менше чити...{0}

# suggestWidget.loading
source: Loading...
uk: Завантаження...

# suggestWidget.noSuggestions
source: No suggestions.
uk: Немає пропозицій.

# suggestionAriaAccepted
source: {0}, accepted
uk: {0}, прийнято

# ariaCurrentSuggestionWithDetails
source: {0}, suggestion, has details
uk: {0}, пропозиція, має подробиці

# ariaCurrentSuggestion
source: {0}, suggestion
uk: {0}, пропозиція

# referencesFailre
source: Failed to resolve file.
uk: Не вдалося вирішити файл.

# referencesCount
source: {0} references
uk: {0} посилань

# referenceCount
source: {0} reference
uk: {0} посилання

# missingPreviewMessage
source: no preview available
uk: попередній перегляд не доступний

# treeAriaLabel
source: References
uk: Посилання

source: No results
uk: Результатів немає

# peekView.alternateTitle
source: References
uk: Посилання

# peekViewTitleBackground
source: Background color of the peek view title area.
uk: Колір фону в режимі перегляду назви області.

# peekViewTitleForeground
source: Color of the peek view title.
uk: Колір заголовка перегляду виду.

# peekViewTitleInfoForeground
source: Color of the peek view title info.
uk: Колір заголовка перегляду виду інформації.

# peekViewBorder
source: Color of the peek view borders and arrow.
uk: Колір peek вигляду межі та стрілки.

# peekViewResultsBackground
source: Background color of the peek view result list.
uk: Колір тла списку результатів виду peek.

# peekViewResultsMatchForeground
source: Foreground color for line nodes in the peek view result list.
uk: Колір переднього плану для лінії вузлів peek подання списку результатів пошуку.

# peekViewResultsFileForeground
source: Foreground color for file nodes in the peek view result list.
uk: Колір переднього плану для файлу вузлів peek подання списку результатів пошуку.

# peekViewResultsSelectionBackground
source: Background color of the selected entry in the peek view result list.
uk: Фоновий колір вибраного елементу peek подання списку результатів пошуку.

# peekViewResultsSelectionForeground
source: Foreground color of the selected entry in the peek view result list.
uk: Колір переднього плану вибраного елементу peek подання списку результатів пошуку.

# peekViewEditorBackground
source: Background color of the peek view editor.
uk: Колір тла peek вигляд редактора.

# peekViewEditorGutterBackground
source: Background color of the gutter in the peek view editor.
uk: Колір тла жолобу peek вигляд редактора.

# peekViewResultsMatchHighlight
source: Match highlight color in the peek view result list.
uk: Колір виділення збігу peek подання списку результатів пошуку.

# peekViewEditorMatchHighlight
source: Match highlight color in the peek view editor.
uk: Колір виділення збігу у peek вигляд редактора.

# indentationToSpaces
source: Convert Indentation to Spaces
uk: Перетворити Відступ у Пробіли

# indentationToTabs
source: Convert Indentation to Tabs
uk: Перетворити Відступ у Таби

source: Configured Tab Size
uk: Задати розмір Табів

# selectTabWidth
source: Select Tab Size for Current File
uk: Обрати розмір Табів для поточного файлу

source: Indent Using Tabs
uk: Відступ за допомогою Табів

source: Indent Using Spaces
uk: Відступ за допомогою пробілу

# detectIndentation
source: Detect Indentation from Content
uk: Визначити типи Відступів з Контенту

# editor.reindentlines
source: Reindent Lines
uk: Повторно збільшити відступ рядка
