Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_editor(uk).xlf
Languages: uk

# diff.tooLarge
source: Cannot compare files because one file is too large.
uk: Не можна порівнювати файли, тому що один з файлів завеликий.

# lineHighlight
source: Background color for the highlight of line at the cursor position.
uk: Фоновий колір для підсвічування рядка на позиції курсора.

# lineHighlightBorderBox
source: Background color for the border around the line at the cursor position.
uk: Фоновий колір обрамлення навколо рядка де знаходиться курсор.

# rangeHighlight
source: Background color of highlighted ranges, like by quick open and find features.
uk: Тло виділеного проміжку, як при швидкому відкритті та пошуку функцій.

# caret
source: Color of the editor cursor.
uk: Колір курсора редактора.

# editorCursorBackground
source: The background color of the editor cursor. Allows customizing the color of a character overlapped by a block cursor.
uk: Тло курсора редактора. Дозволяє обрати колір символів, що покриті блочним курсором.

# editorWhitespaces
source: Color of whitespace characters in the editor.
uk: Колір символів пробілу в редакторі.

# editorIndentGuides
source: Color of the editor indentation guides.
uk: Колір відступних ліній редактора.

# editorLineNumbers
source: Color of editor line numbers.
uk: Колір нумерації рядків редактора.

# editorRuler
source: Color of the editor rulers.
uk: Колір лінійок редактора

# editorCodeLensForeground
source: Foreground color of editor code lenses
uk: Колір тексту в редакторі під кодолінзою

# editorBracketMatchBackground
source: Background color behind matching brackets
uk: Колір фону за парною дужкою

# editorBracketMatchBorder
source: Color for matching brackets boxes
uk: Колір для рамок парних дужкою

# editorOverviewRulerBorder
source: Color of the overview ruler border.
uk: Колір рамки олядової лінійки.

# editorGutter
source: Background color of the editor gutter. The gutter contains the glyph margins and the line numbers.
uk: Колір фону поля. Поле містить значки і номери рядків

# errorForeground
source: Foreground color of error squigglies in the editor.
uk: Колір переднього плану хвильок для помилок в редакторі.

# errorBorder
source: Border color of error squigglies in the editor.
uk: Колір рамки хвильок для помилок в редакторі.

# warningForeground
source: Foreground color of warning squigglies in the editor.
uk: Колір переднього плау попереждувальних хвильок в редакторі.

# warningBorder
source: Border color of warning squigglies in the editor.
uk: Колір рамки попереджувальних хвильок в редакторі.

# infoForeground
source: Foreground color of info squigglies in the editor.
uk: Колір переднього фону інформаційних хвильок в редакторі.

# infoBorder
source: Border color of info squigglies in the editor.
uk: Колір рамки інформаційних хвильок в редакторі.

# overviewRulerRangeHighlight
source: Overview ruler marker color for range highlights.
uk: Колір для виділених проміжків на лінійці огляду

# overviewRuleError
source: Overview ruler marker color for errors.
uk: Колір для помилок на лінійці огляду

# overviewRuleWarning
source: Overview ruler marker color for warnings.
uk: Колір для застережень на лінійці огляду

# overviewRuleInfo
source: Overview ruler marker color for infos.
uk: Колір для інформацій на лінійці огляду

# plainText.alias
source: Plain Text
uk: Звичайний текст

# accessibilityOffAriaLabel
source: The editor is not accessible at this time. Press Alt+F1 for options.
uk: Редактор зараз не доступний. Натисни Alt+F1 для варіантів.

# editorViewAccessibleLabel
source: Editor content
uk: Вміст редактора

# label.close
source: Close
uk: Закрити

# header
source: Difference {0} of {1}: original {2}, {3} lines, modified {4}, {5} lines
uk: Зміна {0} з {1}: оригінал {2}, {3} рядків, змінено {4}, {5}

# blankLine
source: blank
uk: пусто

# equalLine
source: original {0}, modified {1}: {2}
uk: оригінал {0}, змінено {1}: {2}

# insertLine
source: + modified {0}: {1}
uk: + змінено {0}: {1}

# deleteLine
source: - original {0}: {1}
uk: - оригінал {0}: {1}

# editor.action.diffReview.next
source: Go to Next Difference
uk: Перейти до наступної відмінності

# editor.action.diffReview.prev
source: Go to Previous Difference
uk: Перейти до попередньої відмінності

# conflict
source: These files have changed in the meantime: {0}
uk: Ці файли було нещодавно змінено: {0}

# summary.0
source: Made no edits
uk: Жодних змін

# summary.nm
source: Made {0} text edits in {1} files
uk: Зроблено {0} змін до змісту {1} файлів

# summary.n0
source: Made {0} text edits in one file
uk: Зроблено {0} змін до змісту в одному файлі

# editorConfigurationTitle
source: Editor
uk: Редактор

# fontFamily
source: Controls the font family.
uk: Контролює сімейство шрифту.

# fontWeight
source: Controls the font weight.
uk: Контролює товщину шрифту.

# fontSize
source: Controls the font size in pixels.
uk: Контролює розмір шрифту в пікселях.

# lineHeight
source: Controls the line height. Use 0 to compute the lineHeight from the fontSize.
uk: Контролює висоту рядка. При 0 висота рядка буде розрахована на основі розміру шрифту.

# letterSpacing
source: Controls the letter spacing in pixels.
uk: Контролює інтервал між літерами в пікселях

# lineNumbers.off
source: Line numbers are not rendered.
uk: Номери рядків не відображаються.

# lineNumbers.on
source: Line numbers are rendered as absolute number.
uk: Номери рядків відображаються як абсолютне значення.

# lineNumbers.relative
source: Line numbers are rendered as distance in lines to cursor position.
uk: Номери рядків відображаються як відстань а рядках до позиції курсора.

# lineNumbers.interval
source: Line numbers are rendered every 10 lines.
uk: Номери відображаються кожних 10 рядків.

# lineNumbers
source: Controls the display of line numbers. Possible values are 'on', 'off', 'relative' and 'interval'.
uk: Контролює відображення номерів рядків. Можливими значеннями є 'on', 'off', 'relative' та 'interval'.

# rulers
source: Render vertical rulers after a certain number of monospace characters. Use multiple values for multiple rulers. No rulers are drawn if array is empty
uk: Відображати вертикальні лінійки після заданої кількості символів. Задайте більше одного значення для відповідної кількості лінійок. Якщо масив пустий, лінійки відображатись не будуть.

# wordSeparators
source: Characters that will be used as word separators when doing word related navigations or operations
uk: Символ, що використовуватиметься для розділення слів при навігації по словах або схожий операціях

# tabSize
source: The number of spaces a tab is equal to. This setting is overridden based on the file contents when `editor.detectIndentation` is on.
uk: Кількість пробілів яка рівна одній табуляції. Це налаштування переКонтролюється значенням базованим на вмісті файлу коли ввімкнено `editor.detectIndentation`.

# tabSize.errorMessage
source: Expected 'number'. Note that the value "auto" has been replaced by the `editor.detectIndentation` setting.
uk: Очікується число. Зауважте, що значення "auto" (автоматично) було замінено налаштуванням `editor.detectIndentation`.

# insertSpaces
source: Insert spaces when pressing Tab. This setting is overridden based on the file contents when `editor.detectIndentation` is on.
uk: Вставляти пробіли при табуляції. Це налаштування переКонтролюється значенням базованим на вмісті файлу коли ввімкнено `editor.detectIndentation`.

# insertSpaces.errorMessage
source: Expected 'boolean'. Note that the value "auto" has been replaced by the `editor.detectIndentation` setting.
uk: Очікується логічне значення. Зауважте, що значення "auto" (автоматично) було замінено налаштуванням `editor.detectIndentation`.

# detectIndentation
source: When opening a file, `editor.tabSize` and `editor.insertSpaces` will be detected based on the file contents.
uk: При відкриванні файлу, `editor.tabSize` та `editor.insertSpaces` буде визначено на основі змісту файлу.

# roundedSelection
source: Controls if selections have rounded corners
uk: Контролює чи виділення має округлені краї

# scrollBeyondLastLine
source: Controls if the editor will scroll beyond the last line
uk: Контролює, чи редактор прокручуватиме зміст поза останній рядок

# smoothScrolling
source: Controls if the editor will scroll using an animation
uk: Контролює чи редактор буде прокручуватись з використанням анімації

# minimap.enabled
source: Controls if the minimap is shown
uk: Контролює чи міні-карту буде показано

# minimap.showSlider
source: Controls whether the minimap slider is automatically hidden. Possible values are 'always' and 'mouseover'
uk: Контролює, чи міні-кару буде автоматично сховано. Можливі значення є 'always' (завжди) та 'mouseover' (залежно від позиції вказівника миші)

# minimap.renderCharacters
source: Render the actual characters on a line (as opposed to color blocks)
uk: Відображати символи в рядку (на відміну від кольорових блоків)

# minimap.maxColumn
source: Limit the width of the minimap to render at most a certain number of columns
uk: Обмежує ширину міні-карти до максимальної кількості колонок

# find.seedSearchStringFromSelection
source: Controls if we seed the search string in Find Widget from editor selection
uk: Контролює, чи виділення в редакторі буде використано в діалозі пошуку віджетів

# find.autoFindInSelection
source: Controls if Find in Selection flag is turned on when multiple characters or lines of text are selected in the editor
uk: Контролює, чи вибір "шукати у виділеному" ввімкнено, коли в редакторі вибрано кілька символів або рядків тексту.

# find.globalFindClipboard
source: Controls if the Find Widget should read or modify the shared find clipboard on macOS
uk: Контролює, чи віджет пошуку читає або змінює спільний буфер пошуку на macOS

# wordWrap.off
source: Lines will never wrap.
uk: Рядки не переноситимуться.

# wordWrap.on
source: Lines will wrap at the viewport width.
uk: Рядки буде перенесено при виході за межі видимої області.

# wordWrap.wordWrapColumn
source: Lines will wrap at `editor.wordWrapColumn`.
uk: Рядки буде перенесено з колонки заданої в `editor.wordWrapColumn`.

# wordWrap.bounded
source: Lines will wrap at the minimum of viewport and `editor.wordWrapColumn`.
uk: Рядки буде перенесено коли менше з двох значень досягнуто - видимої області або `editor.wordWrapColumn`.

# wordWrap
source: Controls how lines should wrap. Can be: - 'off' (disable wrapping), - 'on' (viewport wrapping), - 'wordWrapColumn' (wrap at `editor.wordWrapColumn`) or - 'bounded' (wrap at minimum of viewport and `editor.wordWrapColumn`).
uk: Контролює як рядки буде перенесено. Можливі значення: - 'off' (перенесення вимкнуто), - 'on' (перенесення видимої області), - 'wordWrapColumn' (переносити на колонці завданій у `editor.wordWrapColumn`) або - 'bounded' (переносити на мінімумі з видимої області та колонки завданої у `editor.wordWrapColumn`).

# wordWrapColumn
source: Controls the wrapping column of the editor when `editor.wordWrap` is 'wordWrapColumn' or 'bounded'.
uk: Контролює колонку з якого рядку редактора буде перенесено коли `editor.wordWrap` має значення 'wordWrapColumn' або 'bounded'.

# wrappingIndent
source: Controls the indentation of wrapped lines. Can be one of 'none', 'same' or 'indent'.
uk: Контролює відступ на перенесених рядках. Може бути одне з 'none' (жодного), 'same' (однаковий) або 'indent' (відступ).

# mouseWheelScrollSensitivity
source: A multiplier to be used on the `deltaX` and `deltaY` of mouse wheel scroll events
uk: Множник, що застосовуватиметься до `deltaX` та `deltaY` колеса прокрутки миші

# multiCursorModifier.ctrlCmd
source: Maps to `Control` on Windows and Linux and to `Command` on OSX.
uk: ПереКонтролює в `Control` на Windows та Linux і в `Command` на OSX.

# multiCursorModifier.alt
source: Maps to `Alt` on Windows and Linux and to `Option` on OSX.
uk: ПереКонтролює в `Alt` на Windows та Linux і в `Option` на OSX.

# multiCursorModifier
source: The modifier to be used to add multiple cursors with the mouse. `ctrlCmd` maps to `Control` on Windows and Linux and to `Command` on OSX. The Go To Definition and Open Link mouse gestures will adapt such that they do not conflict with the multicursor modifier.
uk: Клавіша-модифікатор котра буде використовуватись щоб додати кілька курсорів мишею. `ctrlCmd` визначена як `Control` у Windows та Linux і як `Command` у OSX. Жести "Йти до визначення" та "Відкрити посилання" буде відповідно пристосовано так, що не виникало конфлікту з клавішею-модифікатором.

# quickSuggestions.strings
source: Enable quick suggestions inside strings.
uk: Дозволити швидкі пропозиції всередині рядка.

# quickSuggestions.comments
source: Enable quick suggestions inside comments.
uk: Дозволити швидкі пропозиції всередині коментаря.

# quickSuggestions.other
source: Enable quick suggestions outside of strings and comments.
uk: Дозволити миттєві пропозиції поза строками та коментарями.

# quickSuggestions
source: Controls if suggestions should automatically show up while typing
uk: Контролює, чи пропозиції буде автоматично показано під час набору

# quickSuggestionsDelay
source: Controls the delay in ms after which quick suggestions will show up
uk: Контролює затримку в мілісекундах після котрої миттєва пропозиція буде показана

# parameterHints
source: Enables pop-up that shows parameter documentation and type information as you type
uk: Вмикає спливаюче вікно з документацією параметрів та інформацію про типи під час набору

# autoClosingBrackets
source: Controls if the editor should automatically close brackets after opening them
uk: Контролює, чи редактор автоматично закриває дужки після їх відкриття

# formatOnType
source: Controls if the editor should automatically format the line after typing
uk: Контролює, чи редактор автоматично форматує рядок коли набір закінчено

# formatOnPaste
source: Controls if the editor should automatically format the pasted content. A formatter must be available and the formatter should be able to format a range in a document.
uk: Контролює, чи редактор автоматично форматує вставлений вміст. Форматувальник має бути доступним і в стані опрацювати проміжок документу.

# autoIndent
source: Controls if the editor should automatically adjust the indentation when users type, paste or move lines. Indentation rules of the language must be available.
uk: Контролює, чи редактор автоматично підправляє відступи під час набору, вставки чи перенесення рядків. Необхідна присутність налаштувань відступів для актуальної мови.

# suggestOnTriggerCharacters
source: Controls if suggestions should automatically show up when typing trigger characters
uk: Контролює, чи показувати пропозиції автоматично коли введено символ-тригер

# acceptSuggestionOnEnter
source: Controls if suggestions should be accepted on 'Enter' - in addition to 'Tab'. Helps to avoid ambiguity between inserting new lines or accepting suggestions. The value 'smart' means only accept a suggestion with Enter when it makes a textual change
uk: Контролює, чи пропозиції приймаються після клавіші введення, додатково до клавіші табуляції. Це допомагає уникнути двозначності при введенні нових рядків та прийнятті пропозицій. Значення 'smart' (розумно) веде до прийняття пропозиції після клавіші введення тільки коли це приведе до зміни тексту

# acceptSuggestionOnCommitCharacter
source: Controls if suggestions should be accepted on commit characters. For instance in JavaScript the semi-colon (';') can be a commit character that accepts a suggestion and types that character.
uk: Контролює, чи пропозиції будуть прийняті після завершувального символу. Наприклад, в JavaScript крапка з комою (';') може бути таким завершувальним символом, який приймає пропозицію доповнюючи текст цим символом.

# snippetSuggestions.top
source: Show snippet suggestions on top of other suggestions.
uk: Показувати пропозиції сніпетів перед усіма іншими пропозиціями.

# snippetSuggestions.bottom
source: Show snippet suggestions below other suggestions.
uk: Показувати пропозиції сніпетів після усіх інших пропозицій.

# snippetSuggestions.inline
source: Show snippets suggestions with other suggestions.
uk: Показувати пропозиції сніпетів разом з усіма іншими пропозиціями.

# snippetSuggestions.none
source: Do not show snippet suggestions.
uk: Не показувати пропозиції сніпетів.

# snippetSuggestions
source: Controls whether snippets are shown with other suggestions and how they are sorted.
uk: Контролює чи сніпети буде показано разом з іншими пропозиціями і як їх сортувати.

# emptySelectionClipboard
source: Controls whether copying without a selection copies the current line.
uk: Контролює, чи при копіюванні без виділення буде скопійовано цілий рядок.

# wordBasedSuggestions
source: Controls whether completions should be computed based on words in the document.
uk: Контролює, чи пропозиції завершення будуть обиратися на основі слів у документі.

# suggestFontSize
source: Font size for the suggest widget
uk: Розмір шрифту для віджету пропозицій

# suggestLineHeight
source: Line height for the suggest widget
uk: Висота рядка для віджету пропозицій

# selectionHighlight
source: Controls whether the editor should highlight similar matches to the selection
uk: Чи треба підсвічувати подібні збіги у виділенні

# occurrencesHighlight
source: Controls whether the editor should highlight semantic symbol occurrences
uk: Чи треба виділяти входження семантичних символів

# overviewRulerLanes
source: Controls the number of decorations that can show up at the same position in the overview ruler
uk: Кількість декорацій, що можуть з'явитися в оглядовій лінійці на одній позиції

# overviewRulerBorder
source: Controls if a border should be drawn around the overview ruler.
uk: Чи треба малювати межу довкола оглядової лінійки.

# cursorBlinking
source: Control the cursor animation style, possible values are 'blink', 'smooth', 'phase', 'expand' and 'solid'
uk: Стиль блимання курсора. Можливі варіанти: 'blink' (звичайне), 'smooth' (плавне), 'phase' (поступове), 'expand' (вертикальне), 'solid' (не блимати)

# mouseWheelZoom
source: Zoom the font of the editor when using mouse wheel and holding Ctrl
uk: Встановлювати розмір шрифта відповідно до колеса миші при затисненому Ctrl

# cursorStyle
source: Controls the cursor style, accepted values are 'block', 'block-outline', 'line', 'line-thin', 'underline' and 'underline-thin'
uk: Стиль курсора. Можливі варіанти: 'block' (примокутник), 'block-outline' (рамка), 'line' (вертикальний), 'line-thin' (тонкий вертикальний), 'underline' (підкреслення) and 'underline-thin' (тонке підкреслення)

# fontLigatures
source: Enables font ligatures
uk: Дозволяє шрифтові лігатури

# hideCursorInOverviewRuler
source: Controls if the cursor should be hidden in the overview ruler.
uk: Чи ховати курсор в оглядовій лінійці

# renderWhitespace
source: Controls how the editor should render whitespace characters, possibilities are 'none', 'boundary', and 'all'. The 'boundary' option does not render single spaces between words.
uk: Чи виводити в редакторі пробіли. Можливо 'none' (жодного), 'all' (всі), 'boundary' (тільки поля, між словами пробіли не виводити)

# renderControlCharacters
source: Controls whether the editor should render control characters
uk: Контролює, чи має редактор відображати контрольні символи

# renderIndentGuides
source: Controls whether the editor should render indent guides
uk: Чи виводити межі відступів (вертикальні лінії, що з'єднують відступи однакового розміру)

# renderLineHighlight
source: Controls how the editor should render the current line highlight, possibilities are 'none', 'gutter', 'line', and 'all'.
uk: Контролює, як редакторі відображає виділення поточного рядку, можливі значення є 'none' (жодного), 'gutter' (поле), 'line' (рядок), та 'all' (все).

# codeLens
source: Controls if the editor shows code lenses
uk: Контролює чи кодо-лінзу буде відображено в редакторі

# folding
source: Controls whether the editor has code folding enabled
uk: Контролює чи редактор дозволяє згортання коду

# showFoldingControls
source: Controls whether the fold controls on the gutter are automatically hidden.
uk: Контролює чи елементи керування згортанням на полі буде автоматично приховано.

# matchBrackets
source: Highlight matching brackets when one of them is selected.
uk: Підсвітити відповідну дужку, з однієї пари, коли вибрано одну з них.

# glyphMargin
source: Controls whether the editor should render the vertical glyph margin. Glyph margin is mostly used for debugging.
uk: Контролює, чи редактор додає вертикальний відступ для значків. Відступ для значків в основному використовується при відлагодженні програм.

# useTabStops
source: Inserting and deleting whitespace follows tab stops
uk: Вставлення та усунення пробілів враховує розмір табуляції

# trimAutoWhitespace
source: Remove trailing auto inserted whitespace
uk: Прибирати автоматично вставлені в кінці рядків пробіли

# stablePeek
source: Keep peek editors open even when double clicking their content or when hitting Escape.
uk: Залишати редактор швидкого перегляду відкритим, навіть коли клацнуто на їх зміст або натиснуто клавішу Escape.

# dragAndDrop
source: Controls if the editor should allow to move selections via drag and drop.
uk: Контролює, чи редактор повинен дозволити переміщення виділень за допомогою перетягування.

# accessibilitySupport.auto
source: The editor will use platform APIs to detect when a Screen Reader is attached.
uk: Редактор використовуватиме API платформи, щоб визначити, коли прикріплено читач екрану (Screen Reader).

# accessibilitySupport.on
source: The editor will be permanently optimized for usage with a Screen Reader.
uk: Редактор буде перманентно оптимізований для використання з читачем екрану (Screen Reader).

# accessibilitySupport.off
source: The editor will never be optimized for usage with a Screen Reader.
uk: Редактор ніколи не буде оптимізовано для використання з читачами екрану.

# accessibilitySupport
source: Controls whether the editor should run in a mode where it is optimized for screen readers.
uk: Визначає, чи редактор повинен працювати в режимі, коли він оптимізований для читання з екрану.

# links
source: Controls whether the editor should detect links and make them clickable
uk: Контролює, чи повинен редактор виявляти посилання та зробити їх активними, для переходу по них

# colorDecorators
source: Controls whether the editor should render the inline color decorators and color picker.
uk: Контролює, чи має редактор відображати вбудовані декоратори кольорів та віджет вибору кольору.

# codeActions
source: Enables the code action lightbulb
uk: Вмикає лампочку дій

# selectionClipboard
source: Controls if the Linux primary clipboard should be supported.
uk: Елементи управління якщо основна буфер обміну в Linux повинна бути підтримана.

# sideBySide
source: Controls if the diff editor shows the diff side by side or inline
uk: Контролює, якщо редактор diff показує різницю пліч-о-пліч або рядний

# ignoreTrimWhitespace
source: Controls if the diff editor shows changes in leading or trailing whitespace as diffs
uk: Управління якщо діфф редактор показує зміни в початкові чи кінцеві пробіли як диференціали

# renderIndicators
source: Controls if the diff editor shows +/- indicators for added/removed changes
uk: Елементи управління, якщо редактор diff показує +/- індикатори для додавання або видалення зміни

# corrupt.commands
source: Unexpected exception while executing command.
uk: Неочікувана халепа під час виконання команди.

# mode.tokenizationSupportFailed
source: The mode has failed while tokenizing the input.
uk: Режим завершено з халепою при розборі вводу.
