Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_preferences(uk).xlf
Languages: uk

source: Default Preferences Editor
uk: Редактор налаштувань за замовчуванням

source: Keybindings Editor
uk: Редактор привязки клавіш

source: Preferences
uk: Налаштування

# defineKeybinding.start
source: Define Keybinding
uk: Визначити Сполучення Клавіш

# defineKeybinding.kbLayoutErrorMessage
source: You won't be able to produce this key combination under your current keyboard layout.
uk: Ви не зможете зробити цю комбінацію клавіш під вашу поточну розкладку клавіатури.

# defineKeybinding.kbLayoutLocalAndUSMessage
source: **{0}** for your current keyboard layout (**{1}** for US standard).
uk: **{0}** для поточної розкладки клавіатури (**{1}** для США стандартний).

# defineKeybinding.kbLayoutLocalMessage
source: **{0}** for your current keyboard layout.
uk: **{0}** для поточної розкладки клавіатури.

# userSettingsTarget
source: User Settings
uk: Налаштування Користувача

# workspaceSettingsTarget
source: Workspace Settings
uk: Параметри Робочої Області

# openFolderFirst
source: Open a folder first to create workspace settings
uk: Відкрийте папку спершу, щоб створити налаштування робочої області

# emptyKeybindingsHeader
source: Place your key bindings in this file to overwrite the defaults
uk: Розмістити клавішні прив'язки в цьому файлі перезаписати параметри за замовчуванням

source: Default Keybindings
uk: Комбінації Клавіш За Замовчуванням

# folderSettingsName
source: {0} (Folder Settings)
uk: {0} (папка настройки)

# fail.createSettings
source: Unable to create '{0}' ({1}).
uk: Не вдається створити '{0}' ({1}).

# settingsEditorName
source: Default Settings
uk: Налаштування За Замовчуванням

# SearchSettingsWidget.AriaLabel
source: Search settings
uk: Параметри пошуку

# SearchSettingsWidget.Placeholder
source: Search Settings
uk: Параметри пошуку

# noSettingsFound
source: No Results
uk: Результатів немає

# oneSettingFound
source: 1 Setting matched
uk: 1 налаштування збіглося

# settingsFound
source: {0} Settings matched
uk: {0} налаштування збіглися

# totalSettingsMessage
source: Total {0} Settings
uk: Загально {0} налаштувань

source: Default Settings
uk: Налаштування За Замовчуванням

source: Default Folder Settings
uk: Папка налаштувань За Замовчуванням

# defaultEditorReadonly
source: Edit in the right hand side editor to override defaults.
uk: Редагувати в правій стороні редактора, щоб змінити значення за замовчуванням.

# preferencesAriaLabel
source: Default preferences. Readonly text editor.
uk: Налаштування за замовчуванням. Тільки для читання.

source: Open Raw Default Settings
uk: Відкрити RAW Налаштування

# openGlobalSettings
source: Open User Settings
uk: Відкрийте Настройки Користувача

# openGlobalKeybindings
source: Open Keyboard Shortcuts
uk: Відкрити Сполучення Клавіш

# openGlobalKeybindingsFile
source: Open Keyboard Shortcuts File
uk: Відкрити Файл Сполучення Клавіш

source: Open Workspace Settings
uk: Відкрийте параметри робочої області

source: Open Folder Settings
uk: Відкрити настройки папок

# configureLanguageBasedSettings
source: Configure Language Specific Settings...
uk: Настроїти конкретні параметри мови...

# pickLanguage
source: Select Language
uk: Виберіть Мову

# keybindingsInputName
source: Keyboard Shortcuts
uk: Сполучення Клавіш

# SearchKeybindings.AriaLabel
source: Search keybindings
uk: Комбінації клавіш пошуку

# SearchKeybindings.Placeholder
source: Search keybindings
uk: Комбінації клавіш пошуку

# sortByPrecedene
source: Sort by Precedence
uk: Сортувати по пріоритетом

# header-message
source: For advanced customizations open and edit
uk: Для додаткової настройки відкривання і редагування

# keybindingsLabel
source: Keybindings
uk: Комбінації клавіш

# changeLabel
source: Change Keybinding
uk: Змінити Комбінацію клавіш

# addLabel
source: Add Keybinding
uk: Додати Комбінацію клавіш

# removeLabel
source: Remove Keybinding
uk: Видалити Комбінацію клавіш

# resetLabel
source: Reset Keybinding
uk: Скинути комбінацію клавіш

# showConflictsLabel
source: Show Conflicts
uk: Показати Конфлікти

# copyLabel
source: Copy
uk: Скопіювати

# error
source: Error '{0}' while editing keybinding. Please open 'keybindings.json' file and check.
uk: Помилка '{0}' при редагуванні комбінації клавіш. Будь ласка, відкрийте 'keybindings.json' файл і перевірте.

source: Keybinding
uk: Комбінація клавіш

source: Source
uk: Джерело

source: When
uk: Коли

# editKeybindingLabelWithKey
source: Change Keybinding {0}
uk: Змінити Сполучення Клавіш {0}

# editKeybindingLabel
source: Change Keybinding
uk: Змінити Комбінацію клавіш

# addKeybindingLabelWithKey
source: Add Keybinding {0}
uk: Додати Сполучення Клавіш {0}

# addKeybindingLabel
source: Add Keybinding
uk: Додати Комбінацію клавіш

# commandAriaLabel
source: Command is {0}.
uk: Команда {0}.

# keybindingAriaLabel
source: Keybinding is {0}.
uk: Комбінація клавіш {0}.

# noKeybinding
source: No Keybinding assigned.
uk: Комбінацію клавіш не призначено.

# sourceAriaLabel
source: Source is {0}.
uk: Джерело {0}.

# whenAriaLabel
source: When is {0}.
uk: Коли {0}.

# noWhen
source: No when context.
uk: Коли немає контексту.

# defaultSettingsFuzzyPrompt
source: Try natural language search!
uk: Спробуйте пошук на природній мові!

# defaultSettings
source: Place your settings in the right hand side editor to override.
uk: Помістіть ваші параметри у правій стороні редактора, щоб перевизначити.

source: No Settings Found.
uk: Жодні параметри не знайдено.

# settingsSwitcherBarAriaLabel
source: Settings Switcher
uk: Параметри Switcher

source: User Settings
uk: Налаштування Користувача

source: Workspace Settings
uk: Параметри Робочої Області

source: Folder Settings
uk: Параметри Папки

# enableFuzzySearch
source: Enable natural language search
uk: Увімкнення пошуку за природною мовою

# defineKeybinding.initial
source: Press desired key combination and then press ENTER.
uk: Натисніть необхідну комбінацію клавіш, а потім натисніть клавішу enter.

# defineKeybinding.chordsTo
source: chord to
uk: акорд на

source: Commonly Used
uk: Зазвичай використовуються

source: Most Relevant
uk: Найбільш Актуальні

# defaultKeybindingsHeader
source: Overwrite key bindings by placing them into your key bindings file.
uk: Перезаписати комбінації клавіш, розмістивши їх у файлі.

source: Default
uk: За замовчуванням

source: User
uk: Користувач

source: meta
uk: Мета

source: option
uk: параметр

# emptyUserSettingsHeader
source: Place your settings here to overwrite the Default Settings.
uk: Помістіть ваші налаштування тут, щоб замінити настройки за замовчуванням.

# emptyWorkspaceSettingsHeader
source: Place your settings here to overwrite the User Settings.
uk: Помістіть ваші налаштування тут, щоб перезаписати настройок користувача.

# emptyFolderSettingsHeader
source: Place your folder settings here to overwrite those from the Workspace Settings.
uk: Помістіть ваші настройки папок тут, щоб перезаписати тих, для параметрів робочої області.

# editTtile
source: Edit
uk: Редагувати

# replaceDefaultValue
source: Replace in Settings
uk: Замінити в налаштуваннях

# copyDefaultValue
source: Copy to Settings
uk: Скопіювати до налаштувань

# unsupportedPHPExecutablePathSetting
source: This setting must be a User Setting. To configure PHP for the workspace, open a PHP file and click on 'PHP Path' in the status bar.
uk: Цей параметр повинен бути інструкція по налаштуванню. Щоб налаштувати PHP для робочої області, відкрийте PHP файл і натисніть кнопку 'PHP Path' в рядку стану.

# unsupportedWorkspaceSetting
source: This setting must be a User Setting.
uk: Цей параметр має бути настройкою користувача.

# unsupportedWorkbenchSetting
source: This setting cannot be applied now. It will be applied when you open this folder directly.
uk: Ця установка не може бути застосована і зараз. Вона буде застосовуватися, коли ви відкриваєте цю папку безпосередньо.

# unsupportedWorkbenchSettingDevMode
source: This setting cannot be applied now. It will be applied if you define it's scope as 'resource' while registering, or when you open this folder directly.
uk: Ця установка не може бути застосована зараз. Він буде застосовуватися при визначенні обсягу як "ресурс" при реєстрації, або коли ви відкриваєте цю папку безпосередньо.
