Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_codeEditor(uk).xlf
Languages: uk

# toggleRenderControlCharacters
source: View: Toggle Control Characters
uk: Вид: on/off символи керування

# toggleLocation
source: Toggle Multi-Cursor Modifier
uk: On/off модифікатор мульти-курсору

# toggleMinimap
source: View: Toggle Minimap
uk: Вид: on/off мінікарту

# inspectTMScopes
source: Developer: Inspect TM Scopes
uk: Розробник: огляд ТМ області

# inspectTMScopesWidget.loading
source: Loading...
uk: Завантаження...

# toggleRenderWhitespace
source: View: Toggle Render Whitespace
uk: Вид: on/off відображення пробілів

# toggle.wordwrap
source: View: Toggle Word Wrap
uk: Вид: on/off перенесення слів

# wordWrap.notInDiffEditor
source: Cannot toggle word wrap in a diff editor.
uk: Не можна перемкнути перенесення слів у редакторі Змін.

# unwrapMinified
source: Disable wrapping for this file
uk: Вимкнення обтікання для цього файлу

# wrapMinified
source: Enable wrapping for this file
uk: Увімкнути обтікання для цього файлу

# wordWrapMigration.ok
source: OK
uk: Гаразд

# wordWrapMigration.dontShowAgain
source: Don't show again
uk: Більше не показувати

# wordWrapMigration.openSettings
source: Open Settings
uk: Відкрити Налаштування

# wordWrapMigration.prompt
source: The setting `editor.wrappingColumn` has been deprecated in favor of `editor.wordWrap`.
uk: Параметр 'editor.wrappingColumn' було вилучено на користь 'editor.wordWrap'.

# emergencyConfOn
source: Now changing the setting `editor.accessibilitySupport` to 'on'.
uk: Тепер змінюється параметр `editor.accessibilitySupport` на 'on'.

# openingDocs
source: Now opening the VS Code Accessibility documentation page.
uk: Тепер відкрийте сторінку документації щодо доступності VS Code.

# introMsg
source: Thank you for trying out VS Code's accessibility options.
uk: Дякую, що спробували вибрати параметри доступності VS Code.

source: Status:
uk: Статус:

# changeConfigToOnMac
source: To configure the editor to be permanently optimized for usage with a Screen Reader press Command+E now.
uk: Налаштувати редактор для постійного оптимізації для використання Зчитувача Екрана натисніть Command+E зараз.

# changeConfigToOnWinLinux
source: To configure the editor to be permanently optimized for usage with a Screen Reader press Control+E now.
uk: Налаштувати редактор для постійного оптимізації для використання Зчитувача Екрана натисніть Control+E зараз.

# auto_unknown
source: The editor is configured to use platform APIs to detect when a Screen Reader is attached, but the current runtime does not support this.
uk: Редактор налаштований на використання API платформи, щоб визначити, коли програма читання з екрану, однак нинішнє середовище виконання не підтримує це.

# auto_on
source: The editor has automatically detected a Screen Reader is attached.
uk: Редактор автоматично виявляє прикріпленні програми читання з екрану.

# auto_off
source: The editor is configured to automatically detect when a Screen Reader is attached, which is not the case at this time.
uk: Редактор налаштований на автовизначення прикріплення програми читання з екрану, чого не буває в цей час.

# configuredOn
source: The editor is configured to be permanently optimized for usage with a Screen Reader - you can change this by editing the setting `editor.accessibilitySupport`.
uk: Редактор налаштований, щоб бути постійно оптимізовані для використання з програмами читання з екрана можна змінити шляхом редагування параметру `editor.accessibilitySupport`.

# configuredOff
source: The editor is configured to never be optimized for usage with a Screen Reader.
uk: Редактор налаштований так, щоб не бути оптимізований для використання програм читання з екрану.

# tabFocusModeOnMsg
source: Pressing Tab in the current editor will move focus to the next focusable element. Toggle this behavior by pressing {0}.
uk: Натискання Tab у поточному редакторі перемістить фокус до наступного фокусуючого елемента. Змінити таку поведінку по натисненню {0}.

# tabFocusModeOnMsgNoKb
source: Pressing Tab in the current editor will move focus to the next focusable element. The command {0} is currently not triggerable by a keybinding.
uk: Натискання Tab у поточному редакторі перемістить фокус до наступного фокусуючого елемента. Команда {0} в даний час не викликається за допомогою клавіш.

# tabFocusModeOffMsg
source: Pressing Tab in the current editor will insert the tab character. Toggle this behavior by pressing {0}.
uk: Натискаючи Tab у поточному редакторі, буде вставлено символ табуляції. Увімкніть цю поведінку, натиснувши {0}.

# tabFocusModeOffMsgNoKb
source: Pressing Tab in the current editor will insert the tab character. The command {0} is currently not triggerable by a keybinding.
uk: Натискаючи Tab у поточному редакторі, буде вставлено символ табуляції. Команда {0} в даний час не викликається за допомогою клавіш.

# openDocMac
source: Press Command+H now to open a browser window with more VS Code information related to Accessibility.
uk: Натисніть Command+H, щоб відкрити вікно браузера з інформацією про VS Code, що стосується зі спеціальними можливостями.

# openDocWinLinux
source: Press Control+H now to open a browser window with more VS Code information related to Accessibility.
uk: Натисніть Control+H, щоб відкрити вікно браузера з інформацією про VS Code, що стосується зі спеціальними можливостями.

# outroMsg
source: You can dismiss this tooltip and return to the editor by pressing Escape or Shift+Escape.
uk: Ви можете закрити цю підказку і повернутися в редактор, натиснувши клавішу Escape або Shift+Escape.

# ShowAccessibilityHelpAction
source: Show Accessibility Help
uk: Довідка про спеціальні можливості

# workbench.action.inspectKeyMap
source: Developer: Inspect Key Mappings
uk: Розробник: Перевірити схему Клавіш

# parseErrors
source: Errors parsing {0}: {1}
uk: Помилки парсингу {0}: {1}

# schema.openBracket
source: The opening bracket character or string sequence.
uk: Символ відкритої дужки або рядкова послідовність.

# schema.closeBracket
source: The closing bracket character or string sequence.
uk: Символ закритої дужки або рядкова послідовність.

# schema.comments
source: Defines the comment symbols
uk: Визначає символи коментарів

# schema.blockComments
source: Defines how block comments are marked.
uk: Визначає, як позначати блок коментарів.

# schema.blockComment.begin
source: The character sequence that starts a block comment.
uk: Послідовність символів, яка запускає блоковий коментар.

# schema.blockComment.end
source: The character sequence that ends a block comment.
uk: Послідовність символів, яка завершує блоковий коментар.

# schema.lineComment
source: The character sequence that starts a line comment.
uk: Послідовність символів, що починає рядок коментарю.

# schema.brackets
source: Defines the bracket symbols that increase or decrease the indentation.
uk: Визначає символи дужок, які збільшують або зменшують відступи.

# schema.autoClosingPairs
source: Defines the bracket pairs. When a opening bracket is entered, the closing bracket is inserted automatically.
uk: Визначає пари дужок. Коли вводиться відкриваюча дужка, то закриваюча дужка вставляється автоматично.

# schema.autoClosingPairs.notIn
source: Defines a list of scopes where the auto pairs are disabled.
uk: Визначає список областей, де авто пари вимикаються.

# schema.surroundingPairs
source: Defines the bracket pairs that can be used to surround a selected string.
uk: Визначає пари дужок, які можуть бути використані, щоб оточити вибраний рядок.

# schema.wordPattern
source: The word definition for the language.
uk: Визначення слова для мови.

# schema.wordPattern.pattern
source: The RegExp pattern used to match words.
uk: Шаблон регулярного виразу використовуються для зіставлення слів.

# schema.wordPattern.flags
source: The RegExp flags used to match words.
uk: Прапори RegExp використовуються для зіставлення слів.

# schema.wordPattern.flags.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Має відповідати шаблону `/^([gimuy]+)$/`.

# schema.indentationRules
source: The language's indentation settings.
uk: Параметри відступу мови.

# schema.indentationRules.increaseIndentPattern
source: If a line matches this pattern, then all the lines after it should be indented once (until another rule matches).
uk: Якщо рядок відповідає цьому шаблону, то всі рядки після нього слід відступити один раз (поки не буде інше правило).

# schema.indentationRules.increaseIndentPattern.pattern
source: The RegExp pattern for increaseIndentPattern.
uk: Шаблон регулярного виразу для increaseIndentPattern.

# schema.indentationRules.increaseIndentPattern.flags
source: The RegExp flags for increaseIndentPattern.
uk: Прапори регулярного виразу для increaseIndentPattern.

# schema.indentationRules.increaseIndentPattern.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Має відповідати шаблону `/^([gimuy]+)$/`.

# schema.indentationRules.decreaseIndentPattern
source: If a line matches this pattern, then all the lines after it should be unindendented once (until another rule matches).
uk: Якщо рядок відповідає цьому шаблону, то всі рядки після нього слід позбавити відступа один раз (поки не буде інше правило).

# schema.indentationRules.decreaseIndentPattern.pattern
source: The RegExp pattern for decreaseIndentPattern.
uk: Шаблон регулярного виразу для decreaseIndentPattern.

# schema.indentationRules.decreaseIndentPattern.flags
source: The RegExp flags for decreaseIndentPattern.
uk: Прапори регулярного виразу для decreaseIndentPattern.

# schema.indentationRules.decreaseIndentPattern.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Має відповідати шаблону `/^([gimuy]+)$/`.

# schema.indentationRules.indentNextLinePattern
source: If a line matches this pattern, then **only the next line** after it should be indented once.
uk: Якщо рядок відповідає цьому шаблону, тоді ** тільки наступний рядок ** після нього слід відступити один раз.

# schema.indentationRules.indentNextLinePattern.pattern
source: The RegExp pattern for indentNextLinePattern.
uk: Шаблон регулярного виразу для indentNextLinePattern.

# schema.indentationRules.indentNextLinePattern.flags
source: The RegExp flags for indentNextLinePattern.
uk: Прапори регулярного виразу для indentNextLinePattern.

# schema.indentationRules.indentNextLinePattern.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Має відповідати шаблону `/^([gimuy]+)$/`.

# schema.indentationRules.unIndentedLinePattern
source: If a line matches this pattern, then its indentation should not be changed and it should not be evaluated against the other rules.
uk: Якщо рядок відповідає цьому шаблону, то його відступ не слід змінювати, і його не слід порівнювати з іншими правилами.

# schema.indentationRules.unIndentedLinePattern.pattern
source: The RegExp pattern for unIndentedLinePattern.
uk: Шаблон регулярного виразу для unIndentedLinePattern.

# schema.indentationRules.unIndentedLinePattern.flags
source: The RegExp flags for unIndentedLinePattern.
uk: Прапори регулярного виразу для unIndentedLinePattern.

# schema.indentationRules.unIndentedLinePattern.errorMessage
source: Must match the pattern `/^([gimuy]+)$/`.
uk: Має відповідати шаблону `/^([gimuy]+)$/`.

# schema.folding
source: The language's folding settings.
uk: Параметри складання мови.

# schema.folding.offSide
source: A language adheres to the off-side rule if blocks in that language are expressed by their indentation. If set, empty lines belong to the subsequent block.
uk: Мова дотримується правил поза межами, якщо блоки в цій мові виражаються їх відступів. Якщо встановлено, порожні рядки належать до наступного блоку.

# schema.folding.markers
source: Language specific folding markers such as '#region' and '#endregion'. The start and end regexes will be tested against the contents of all lines and must be designed efficiently
uk: Маркери, що складаються з мовою такі, як '#region' та '#endregion'. Початок і кінець regexes будуть перевірені проти вміст всіх ліній і повинні бути спроектовані ефективно

# schema.folding.markers.start
source: The RegExp pattern for the start marker. The regexp must start with '^'.
uk: Шаблон регулярного виразу для початку маркером. Регулярний вираз повинен починатися з '^'.

# schema.folding.markers.end
source: The RegExp pattern for the end marker. The regexp must start with '^'.
uk: Шаблон регулярного виразу для кінцевого маркера. Регулярний вираз повинен починатися з '^'.
