Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_debug(uk).xlf
Languages: uk

# launch.config.comment3
source: For more information, visit: {0}
uk: Для отримання додаткової інформації, відвідайте: {0}

# debugType
source: Type of configuration.
uk: Тип конфігурації.

# debugTypeNotRecognised
source: The debug type is not recognized. Make sure that you have a corresponding debug extension installed and that it is enabled.
uk: Тип Налагодження не розпізнано. Переконайтеся, що у вас встановлено відповідне розширення налагодження і що воно включене.

# node2NotSupported
source: "node2" is no longer supported, use "node" instead and set the "protocol" attribute to "inspector".
uk: "node2" не підтримується, натомість Використовуйте "node" та встановіть атрибут "protocol" до "inspector".

# debugName
source: Name of configuration; appears in the launch configuration drop down menu.
uk: Назва конфігурації; з'являється при запуску конфігурації в випадаючому меню.

# debugRequest
source: Request type of configuration. Can be "launch" or "attach".
uk: Тип запиту конфігурації. Можна "запустити" або "прикріпити".

# debugServer
source: For debug extension development only: if a port is specified VS Code tries to connect to a debug adapter running in server mode
uk: Для налагодження розвитку розширення тільки: якщо зазначений порт VS Code намагається підключитися до адаптера налагодження, що працює в режимі сервера

# debugPrelaunchTask
source: Task to run before debug session starts.
uk: Завдання для виконання перед початком сесії налагодження починається.

# debugWindowsConfiguration
source: Windows specific launch configuration attributes.
uk: Специфічні Windows атрибути налаштування запуску.

# debugOSXConfiguration
source: OS X specific launch configuration attributes.
uk: Конкретні ОС x атрибути конфігурація запуску.

# debugLinuxConfiguration
source: Linux specific launch configuration attributes.
uk: Спеціальні Linux атрибути конфігурації запуску.

# deprecatedVariables
source: 'env.', 'config.' and 'command.' are deprecated, use 'env:', 'config:' and 'command:' instead.
uk: 'env.', 'config.' і 'command.' є застарілими, використовуйте краще 'env:', 'config:' and 'command:'.
