Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_explorers(uk).xlf
Languages: uk

# vscode.extension.contributes.view
source: Contributes custom view
uk: Надає індивідуальний вигляд

# vscode.extension.contributes.view.id
source: Unique id used to identify view created through vscode.workspace.createTreeView
uk: Унікальний ідентифікатор, використовуваний для ідентифікації вигляду, створеного через vscode.workspace.createTreeView

# vscode.extension.contributes.view.label
source: Human readable string used to render the view
uk: Зрозумілий вигляд рядка використовується для подання

# vscode.extension.contributes.view.icon
source: Path to the view icon
uk: Шлях до піктограми

# vscode.extension.contributes.views
source: Contributes custom views
uk: Надає індивідуальні вигляди

# showViewlet
source: Show {0}
uk: Показати {0}

source: View
uk: Вид

# treeExplorer.noMatchingProviderId
source: No TreeExplorerNodeProvider with id {providerId} registered.
uk: Немає TreeExplorerNodeProvider з ID {providerId} зареєстровано.

# treeExplorerViewlet.tree
source: Tree Explorer Section
uk: Розділ Провідника

source: Refresh
uk: Оновити
