Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_feedback(uk).xlf
Languages: uk

# sendFeedback
source: Tweet Feedback
uk: Твітнути відгук

# label.sendASmile
source: Tweet us your feedback.
uk: Твітнути нам свої відгуки.

# patchedVersion1
source: Your installation is corrupt.
uk: Ваша установка пошкоджена.

# patchedVersion2
source: Please specify this if you submit a bug.
uk: Будь ласка, вкажіть це при відправці помилки.

# sentiment
source: How was your experience?
uk: Яким був ваш досвід?

# smileCaption
source: Happy
uk: Щасливий

# frownCaption
source: Sad
uk: Сумно

source: Other ways to contact us
uk: Інші способи, щоб зв'язатися з нами

source: Submit a bug
uk: Повідомити про помилку

source: Request a missing feature
uk: Запитати відсутні функції

source: Tell us why?
uk: Розкажіть, чому?

# commentsHeader
source: Comments
uk: Коментарі

source: Tweet
uk: Твіт

source: character left
uk: залишився символ

source: characters left
uk: залишилось символів

# feedbackSending
source: Sending
uk: Відправка

# feedbackSent
source: Thanks
uk: Дякую

# feedbackSendingError
source: Try again
uk: Спробуйте знову
