Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_services_configuration(uk).xlf
Languages: uk

# vscode.extension.contributes.configuration.title
source: A summary of the settings. This label will be used in the settings file as separating comment.
uk: Зведені параметри. Ця мітка буде використовуватися у налаштуваннях файлу у якості розділення коментаря.

# vscode.extension.contributes.configuration.properties
source: Description of the configuration properties.
uk: Опис властивостей конфігурації.

# scope.window.description
source: Window specific configuration, which can be configured in the User or Workspace settings.
uk: Специфічне вікно конфігурації, в якому можна налаштувати параметри користувача або робоче місце.

# scope.resource.description
source: Resource specific configuration, which can be configured in the User, Workspace or Folder settings.
uk: Певні конфігурації ресурсів, які можуть бути налаштовані користувачем, робочої області або папки з налаштуваннями.

# scope.description
source: Scope in which the configuration is applicable. Available scopes are `window` and `resource`.
uk: Область, в якій конфігурація застосовна. Доступні області "вікно" і "ресурс".

# vscode.extension.contributes.defaultConfiguration
source: Contributes default editor configuration settings by language.
uk: Вносить свій редактор стандартних конфігураційних установок від мови.

# vscode.extension.contributes.configuration
source: Contributes configuration settings.
uk: Включає налаштування конфігурації.

# invalid.title
source: 'configuration.title' must be a string
uk: 'configuration.title' має бути рядком

# invalid.properties
source: 'configuration.properties' must be an object
uk: 'configuration.properties' має бути об'єктом

# invalid.allOf
source: 'configuration.allOf' is deprecated and should no longer be used. Instead, pass multiple configuration sections as an array to the 'configuration' contribution point.
uk: 'configuration.allOf' є застарілим і більше не повинні бути використані. Замість цього, передавати кілька розділів налаштування як масив 'configuration' до точки внеску.

# workspaceConfig.folders.description
source: List of folders to be loaded in the workspace.
uk: Список папок, які повинні бути завантажені в робочу область.

# workspaceConfig.path.description
source: A file path. e.g. `/root/folderA` or `./folderA` for a relative path that will be resolved against the location of the workspace file.
uk: Шлях до файлу. наприклад, `/корінь/папкаА` або `./папкаА` для відносний шлях, який буде вирішене на розташування файлу робочої області.

# workspaceConfig.name.description
source: An optional name for the folder.
uk: Необов'язкове ім'я папки.

# workspaceConfig.uri.description
source: URI of the folder
uk: URI папки

# workspaceConfig.settings.description
source: Workspace settings
uk: Параметри робочої області

# workspaceConfig.extensions.description
source: Workspace extensions
uk: Розширення робочої області

# unknownWorkspaceProperty
source: Unknown workspace configuration property
uk: Невідома властивість конфігурації робочої області

# errorInvalidFile
source: Unable to write into the file. Please open the file to correct errors/warnings in the file and try again.
uk: Не вдається записати у файл. Будь ласка, відкрийте файл, щоб виправити помилки/попередження в файл і спробуйте знову.

# errorFileDirty
source: Unable to write into the file because the file is dirty. Please save the file and try again.
uk: Не вдається записати у файл, тому що файл змінений. Будь ласка, збережіть файл і спробуйте знову.

source: Open Tasks Configuration
uk: Відкрити конфігурацію завдань

source: Open Launch Configuration
uk: Відкрити налаштування запуску

source: Close
uk: Закрити

# open
source: Open Settings
uk: Відкрити Налаштування

source: Save and Retry
uk: Зберегти і повторити

# errorUnknownKey
source: Unable to write to {0} because {1} is not a registered configuration.
uk: Можете написати {0}, оскільки {1} не зареєстровані конфігурації.

# errorInvalidFolderConfiguration
source: Unable to write to Folder Settings because {0} does not support the folder resource scope.
uk: Неможливо записати параметри папки, оскільки {0} не підтримує область ресурсів папок.

# errorInvalidUserTarget
source: Unable to write to User Settings because {0} does not support for global scope.
uk: Не вдається записати до налаштувань робочої області, оскільки {0} не підтримує область робочого простору в робочій області мультипапки.

# errorInvalidWorkspaceTarget
source: Unable to write to Workspace Settings because {0} does not support for workspace scope in a multi folder workspace.
uk: Не вдається записати до налаштувань робочої області, оскільки {0} не підтримує область робочого простору в робочій області мультипапки.

# errorInvalidFolderTarget
source: Unable to write to Folder Settings because no resource is provided.
uk: Не вдалося записати до настройки папок, тому що немає ресурсу.

# errorNoWorkspaceOpened
source: Unable to write to {0} because no workspace is opened. Please open a workspace first and try again.
uk: Не вдається записати до {0}, оскільки не відкрито жодного робочого простору. Спершу відкрийте робоче середовище і повторіть спробу.

# errorInvalidTaskConfiguration
source: Unable to write into tasks file. Please open **Tasks** file to correct errors/warnings in it and try again.
uk: Не вдається записати у файл завдання. Будь ласка, відкрийте **завдання** файл, щоб виправити помилки/попередження його і спробуйте знову.

# errorInvalidLaunchConfiguration
source: Unable to write into launch file. Please open **Launch** file to correct errors/warnings in it and try again.
uk: Не вдається записати у файл Launch. Будь ласка, відкрийте **запуск** файл, щоб виправити помилки/попередження його і спробуйте знову.

# errorInvalidConfiguration
source: Unable to write into user settings. Please open **User Settings** file to correct errors/warnings in it and try again.
uk: Не вдалося записати до настройок користувача. Будь ласка, відкрийте * * користувача настройки * * файл правильні помилки/попередження в ньому і повторіть спробу.

# errorInvalidConfigurationWorkspace
source: Unable to write into workspace settings. Please open **Workspace Settings** file to correct errors/warnings in the file and try again.
uk: Не вдалося записати в налаштування робочої області. Будь ласка, відкрийте * * робочої області настройки * * файлу правильні помилки/попередження у файлі та повторіть спробу.

# errorInvalidConfigurationFolder
source: Unable to write into folder settings. Please open **Folder Settings** file under **{0}** folder to correct errors/warnings in it and try again.
uk: Можете писати в налаштуваннях папку. Будь ласка, відкрийте **папки налаштування* файл* **{0}** папка для виправлення помилок/попереджень і спробуйте знову.

# errorTasksConfigurationFileDirty
source: Unable to write into tasks file because the file is dirty. Please save the **Tasks Configuration** file and try again.
uk: Не вдалося записати до завдань файл, оскільки файл є брудні. Будь ласка, зберігайте у * * завдання конфігурації * * файл і повторіть спробу.

# errorLaunchConfigurationFileDirty
source: Unable to write into launch file because the file is dirty. Please save the **Launch Configuration** file and try again.
uk: Не вдалося записати у файл запуску, оскільки файл брудні. Будь ласка, зберігайте у * * запуску конфігурації * * файл і повторіть спробу.

# errorConfigurationFileDirty
source: Unable to write into user settings because the file is dirty. Please save the **User Settings** file and try again.
uk: Не вдалося записати до настройок користувача, оскільки файл брудні. Будь ласка, зберігайте у * * користувача настройки * * файл і повторіть спробу.

# errorConfigurationFileDirtyWorkspace
source: Unable to write into workspace settings because the file is dirty. Please save the **Workspace Settings** file and try again.
uk: Не вдалося записати в налаштування робочої області, оскільки файл брудні. Будь ласка, зберігайте у * * робочої області настройки * * файл і повторіть спробу.

# errorConfigurationFileDirtyFolder
source: Unable to write into folder settings because the file is dirty. Please save the **Folder Settings** file under **{0}** folder and try again.
uk: Неможливо записати в налаштуваннях папки, оскільки файл змінений. Будь ласка, збережіть **налаштування папки** файл **{0}** папки і спробуйте знову.

# userTarget
source: User Settings
uk: Налаштування Користувача

# workspaceTarget
source: Workspace Settings
uk: Параметри Робочої Області

# folderTarget
source: Folder Settings
uk: Параметри Папки
