Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_output(uk).xlf
Languages: uk

# outputPanelWithInputAriaLabel
source: {0}, Output panel
uk: {0}, панелі виводу

# outputPanelAriaLabel
source: Output panel
uk: Панель виведення

source: Output
uk: Вивід

source: Log Viewer
uk: Переглянути Журнал

# viewCategory
source: View
uk: Вид

# clearOutput.label
source: Clear Output
uk: Очистити Вивід

# output
source: {0} - Output
uk: {0} - вихідний

# channel
source: Output channel for '{0}'
uk: Вихідний канал для '{0}'

source: Toggle Output
uk: Перемкнути Вивід

source: Clear Output
uk: Очистити Вивід

source: Toggle Output Scroll Lock
uk: Переключити Scroll Lock виводу

# switchToOutput.label
source: Switch to Output
uk: Перемикач для виведення
