Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_debug(uk).xlf
Languages: uk

# toggleDebugViewlet
source: Show Debug
uk: Показати Налагодження

# toggleDebugPanel
source: Debug Console
uk: Консоль Налагодження

source: Debug
uk: Налагоджувати

# debugPanel
source: Debug Console
uk: Консоль Налагодження

source: Variables
uk: Змінні

source: Watch
uk: Дивитися

source: Call Stack
uk: Стек Викликів

source: Breakpoints
uk: Точки зупинки

source: View
uk: Вид

# debugCategory
source: Debug
uk: Налагоджувати

# debugCommands
source: Debug Configuration
uk: Конфігурації Налагодження

# debugConfigurationTitle
source: Debug
uk: Налагоджувати

# allowBreakpointsEverywhere
source: Allows setting breakpoint in any file
uk: Дозволяє встановити точку зупинки у будь-який файл

# openExplorerOnEnd
source: Automatically open explorer view on the end of a debug session
uk: Автоматично відкрийте вікно оглядача в кінці сеансу налагодження

# inlineValues
source: Show variable values inline in editor while debugging
uk: Показати значення змінних вбудованого в редактор під час налагодження

# hideActionBar
source: Controls if the floating debug action bar should be hidden
uk: Контролює, чи слід приховати плаваючу панель дій для налагодження

# never
source: Never show debug in status bar
uk: Ніколи не показувати налагодження в рядку стану

# always
source: Always show debug in status bar
uk: Завжди показують налагодження в рядку стану

# onFirstSessionStart
source: Show debug in status bar only after debug was started for the first time
uk: Показувати налагодження в рядку стану лише після першого запуску налагодження

# showInStatusBar
source: Controls when the debug status bar should be visible
uk: Контролює, коли панель стану налагодження повинна бути видимою

# openDebug
source: Controls whether debug viewlet should be open on debugging session start.
uk: Контролює налагодження viewlet повинні бути відкриті на налагодження початку сесії.

# launch
source: Global debug launch configuration. Should be used as an alternative to 'launch.json' that is shared across workspaces
uk: Глобальні конфігурації запуску налагодження. Повинні бути використані в якості альтернативи для 'launch.json', яка використовується в різних робочих областях

# entryAriaLabel
source: {0}, debug
uk: {0}, налагодження

# debugAriaLabel
source: Type a name of a launch configuration to run.
uk: Введіть ім'я конфігурації запуску для запуску.

# addConfigTo
source: Add Config ({0})...
uk: Додати конфігурацію ({0})...

source: Add Configuration...
uk: Додати конфігурацію...

# noConfigurationsMatching
source: No debug configurations matching
uk: Немає відповідної конфігурації налагодження

# noConfigurationsFound
source: No debug configurations found. Please create a 'launch.json' file.
uk: Конфігурацій налагодження не знайдено. Будь ласка, створіть файл 'launch.json'.

# replAriaLabel
source: Read Eval Print Loop Panel
uk: Читати панель Loop Eval Print

# actions.repl.historyPrevious
source: History Previous
uk: Історія Попередніх

# actions.repl.historyNext
source: History Next
uk: Наступна Історія

# actions.repl.acceptInput
source: REPL Accept Input
uk: REPL приймати введені дані

# actions.repl.copyAll
source: Debug: Console Copy All
uk: Налагодження: Консоль Скопіювати Всі

# toggleBreakpointAction
source: Debug: Toggle Breakpoint
uk: Налагодження: Перемикання точки зупинки

# columnBreakpointAction
source: Debug: Column Breakpoint
uk: Налагодження: Стовпець точки зупинки

# columnBreakpoint
source: Add Column Breakpoint
uk: Додати стовпець точки зупинки

# conditionalBreakpointEditorAction
source: Debug: Add Conditional Breakpoint...
uk: Налагодження: Додати умовну точку зупинки...

source: Run to Cursor
uk: Виконати до курсору

source: Debug: Evaluate
uk: Налагодження: Оцінка

source: Debug: Add to Watch
uk: Налагодження: Додати до спостереження

# showDebugHover
source: Debug: Show Hover
uk: Налагодження: Показати Hover

# debugFocusVariablesView
source: Focus Variables
uk: Фокус Змінних

# debugFocusWatchView
source: Focus Watch
uk: Фокус спостереження

# debugFocusCallStackView
source: Focus CallStack
uk: Фокус-Стек Викликів

# debugFocusBreakpointsView
source: Focus Breakpoints
uk: Фокус-Точки Зупинки

source: Call Stack Section
uk: Розділ Стек Викликів

# debugStopped
source: Paused on {0}
uk: Призупинення на {0}

# callStackAriaLabel
source: Debug Call Stack
uk: Налагодження Стека Викликів

source: Process
uk: Процес

source: Paused
uk: Призупинено

source: Running
uk: Працює

source: Thread
uk: Нитка

# pausedOn
source: Paused on {0}
uk: Призупинення на {0}

source: Load More Stack Frames
uk: Навантаження Більш Стекових Фреймів

# threadAriaLabel
source: Thread {0}, callstack, debug
uk: Потік {0}, стек викликів, налагодження

# stackFrameAriaLabel
source: Stack Frame {0} line {1} {2}, callstack, debug
uk: Стековий фрейм {0} рядок {1} {2}, стек викликів, налагодження

source: Variables Section
uk: Змінні розділ

# variablesAriaTreeLabel
source: Debug Variables
uk: Змінні Налагодження

# variableValueAriaLabel
source: Type new variable value
uk: Введіть нове значення змінної

# variableScopeAriaLabel
source: Scope {0}, variables, debug
uk: Області {0}, змінні, налагодження

# variableAriaLabel
source: {0} value {1}, variables, debug
uk: {0} значення {1}, змінних, налагодження

# editConditionalBreakpoint
source: Edit Breakpoint...
uk: Редагувати Зупинку...

# functionBreakpointsNotSupported
source: Function breakpoints are not supported by this debug type
uk: Функція зупинки не підтримує цей тип налагодження

# functionBreakpointPlaceholder
source: Function to break on
uk: Функції розбити на

# functionBreakPointInputAriaLabel
source: Type function breakpoint
uk: Тип функції зупинки

source: Expressions Section
uk: Розділ Вираження

# watchAriaTreeLabel
source: Debug Watch Expressions
uk: Налагодження дивитися вирази

# watchExpressionPlaceholder
source: Expression to watch
uk: Вираз дивитися

# watchExpressionInputAriaLabel
source: Type watch expression
uk: Тип дивитися вираз

# watchExpressionAriaLabel
source: {0} value {1}, watch, debug
uk: {0} значення {1}, дивитися, налагодження

# watchVariableAriaLabel
source: {0} value {1}, watch, debug
uk: {0} значення {1}, дивитися, налагодження

# internalConsoleOptions
source: Controls behavior of the internal debug console.
uk: Контролює поведінку консолі внутрішнього налагодження.

# breakpointDisabledHover
source: Disabled Breakpoint
uk: Точки Зупинки Відключені

# breakpointUnverifieddHover
source: Unverified Breakpoint
uk: Неперевірена точка зупинки

# breakpointDirtydHover
source: Unverified breakpoint. File is modified, please restart debug session.
uk: Неперевірені точки зупинки. Файл змінено, необхідно перезавантажити сеанс налагодження.

# breakpointUnsupported
source: Conditional breakpoints not supported by this debug type
uk: Умовні точки зупинки не підтримуються цим типом налагодження

# debugToolBarBackground
source: Debug toolbar background color.
uk: Фоновий колір панелі інструментів Налагодження.

# debugToolBarBorder
source: Debug toolbar border color.
uk: Колір рамки панелі інструментів Налагодження.

# openLaunchJson
source: Open {0}
uk: Відкрити {0}

# launchJsonNeedsConfigurtion
source: Configure or Fix 'launch.json'
uk: Налаштувати або виправити 'launch.json'

# noFolderDebugConfig
source: Please first open a folder in order to do advanced debug configuration.
uk: Будь ласка, спочатку відкрийте папку для того, щоб зробити додаткові параметри налагодження.

# startDebug
source: Start Debugging
uk: Почати Налагодження

source: Start Without Debugging
uk: Запуск Без Налагодження

source: Select and Start Debugging
uk: Вибрати й почати налагодження

# restartDebug
source: Restart
uk: Перезавантаження

# reconnectDebug
source: Reconnect
uk: Повторне підключення

# stepOverDebug
source: Step Over
uk: Переступити

# stepIntoDebug
source: Step Into
uk: Крок у

# stepOutDebug
source: Step Out
uk: Вийти

# stopDebug
source: Stop
uk: Зупинити

# disconnectDebug
source: Disconnect
uk: Від'єднати

# continueDebug
source: Continue
uk: Продовжити

# pauseDebug
source: Pause
uk: Пауза

source: Restart Frame
uk: Перезавантаження Кадру

source: Remove Breakpoint
uk: Видалити Точку Зупину

source: Remove All Breakpoints
uk: Видалити Всі Точки Зупинки

source: Enable Breakpoint
uk: Включити Точку Зупину

source: Disable Breakpoint
uk: Відключити Точку Зупину

source: Enable All Breakpoints
uk: Увімкнути всі точки зупинки

source: Disable All Breakpoints
uk: Вимкнути Всі Точки Зупинки

source: Activate Breakpoints
uk: Активувати Точки Зупинки

source: Deactivate Breakpoints
uk: Деактивувати точки зупинки

source: Reapply All Breakpoints
uk: Повторно застосувати всі точки зупинки

source: Add Function Breakpoint
uk: Додати Функцію Зупинки

source: Add Conditional Breakpoint...
uk: Додати Умовну Точку Зупину...

source: Set Value
uk: Встановиити значення

# addWatchExpression
source: Add Expression
uk: Додати вираз

# editWatchExpression
source: Edit Expression
uk: Редагування виразу

# addToWatchExpressions
source: Add to Watch
uk: Додати до спостереження

# removeWatchExpression
source: Remove Expression
uk: Видалити вираз

# removeAllWatchExpressions
source: Remove All Expressions
uk: Видалити всі вирази

# clearRepl
source: Clear Console
uk: Очистити консоль

# debugConsoleAction
source: Debug Console
uk: Консоль Налагодження

# unreadOutput
source: New Output in Debug Console
uk: Новий вихід у налагодження консолі

# debugFocusConsole
source: Focus Debug Console
uk: Фокус налагодження консолі

source: Focus Process
uk: Фокус Процесу

# stepBackDebug
source: Step Back
uk: Крок Назад

# reverseContinue
source: Reverse
uk: Реверс

# unable
source: Unable to resolve the resource without a debug session
uk: Неможливо вирішити ресурс без сеансу налагодження

# statusBarDebuggingBackground
source: Status bar background color when a program is being debugged. The status bar is shown in the bottom of the window
uk: Колір фону панелі статусу під час налагодження програми. Стрічка стану відображається у нижній частині вікна

# statusBarDebuggingForeground
source: Status bar foreground color when a program is being debugged. The status bar is shown in the bottom of the window
uk: Колір переднього плану панелі стану при налагодженні програми. Стрічка стану відображається у нижній частині вікна

# statusBarDebuggingBorder
source: Status bar border color separating to the sidebar and editor when a program is being debugged. The status bar is shown in the bottom of the window
uk: Колір рамки панелі стану при налагодженні програми. Стрічка стану відображається у нижній частині вікна

# selectAndStartDebug
source: Select and start debug configuration
uk: Виберіть і запустіть конфігурацію debug

# snapshotObj
source: Only primitive values are shown for this object.
uk: Для цього об'єкта відображаються лише примітивні значення.

# debuggingPaused
source: Debugging paused, reason {0}, {1} {2}
uk: Налагодження призупиненого, причина {0}, {1} (2)

source: Debugging started.
uk: Налагодження почалося.

source: Debugging stopped.
uk: Налагодження зупиненно.

# breakpointAdded
source: Added breakpoint, line {0}, file {1}
uk: Додана точка зупинки, рядок {0}, файл {1}

# breakpointRemoved
source: Removed breakpoint, line {0}, file {1}
uk: Видалити точку зупину, рядок {0}, файл {1}

# compoundMustHaveConfigurations
source: Compound must have "configurations" attribute set in order to start multiple configurations.
uk: З'єднання повинне мати атрибут "configurations", встановлений для запуску декількох конфігурацій.

# configMissing
source: Configuration '{0}' is missing in 'launch.json'.
uk: Конфігурація "{0}" відсутня в 'launch.json'.

source: 'launch.json' does not exist.
uk: 'launch.json' не існує.

# debugRequestNotSupported
source: Attribute `{0}` has an unsupported value '{1}' in the chosen debug configuration.
uk: Атрибут `{0}` має неприпустиме значення '{1}' в обраній конфігурації налагодження.

# debugRequesMissing
source: Attribute '{0}' is missing from the chosen debug configuration.
uk: Атрибут '{0}' відсутній в обраної конфігурації налагодження.

# debugTypeNotSupported
source: Configured debug type '{0}' is not supported.
uk: Налаштований тип налагодження '{0}' не підтримується.

# debugTypeMissing
source: Missing property `type` for the chosen launch configuration.
uk: Відсутня властивість 'type' для обраної запуску конфігурації.

source: Debug Anyway
uk: У всякому разі налагодження

# preLaunchTaskErrors
source: Build errors have been detected during preLaunchTask '{0}'.
uk: Помилки побудови були виявлені під час preLaunchTask "{0}".

# preLaunchTaskError
source: Build error has been detected during preLaunchTask '{0}'.
uk: Помилка побудови була виявлена під час preLaunchTask "{0}".

# preLaunchTaskExitCode
source: The preLaunchTask '{0}' terminated with exit code {1}.
uk: preLaunchTask '{0}' завершено з кодом виходу {1}.

# noFolderWorkspaceDebugError
source: The active file can not be debugged. Make sure it is saved on disk and that you have a debug extension installed for that file type.
uk: Активний файл не може бути налагоджений. Переконайтеся, що він збережений на диску і що у вас є розширення налагодження встановлених для цього типу файлів.

# NewLaunchConfig
source: Please set up the launch configuration file for your application. {0}
uk: Будь ласка налаштуйте файл конфігурації запуску для вашої програми. {0}

# DebugTaskNotFound
source: Could not find the preLaunchTask '{0}'.
uk: Не вдалося знайти preLaunchTask '{0}'.

# taskNotTracked
source: The preLaunchTask '{0}' cannot be tracked.
uk: PreLaunchTask '{0}' неможливо відстежити.

source: Remove Breakpoints
uk: Видалити точки зупинки

# removeBreakpointOnColumn
source: Remove Breakpoint on Column {0}
uk: Видалити точку зупину на стовпець {0}

source: Remove Line Breakpoint
uk: Видалити Точки Зупину Лінії

source: Edit Breakpoints
uk: Редагувати точки зупинки

# editBreakpointOnColumn
source: Edit Breakpoint on Column {0}
uk: Редагувати точку зупинки у стовпці {0}

# editLineBrekapoint
source: Edit Line Breakpoint
uk: Редагувати рядок точки зупинки

source: Enable/Disable Breakpoints
uk: Включення/Відключення точок зупинки

# disableColumnBreakpoint
source: Disable Breakpoint on Column {0}
uk: Відключити точку зупинки у стовпці {0}

# disableBreakpointOnLine
source: Disable Line Breakpoint
uk: Відключити точку зупинки рядку

# enableBreakpoints
source: Enable Breakpoint on Column {0}
uk: Включити точку зупинки у стовпці {0}

# enableBreakpointOnLine
source: Enable Line Breakpoint
uk: Включити точку зупинки рядку

source: Add Breakpoint
uk: Додати Точку Зупину

# stateCapture
source: Object state is captured from first evaluation
uk: Стан об'єкта фіксується від першої оцінки

# replVariableAriaLabel
source: Variable {0} has value {1}, read eval print loop, debug
uk: Змінна {0} має значення {1}, читати цикл друку эвал налагодження

# replExpressionAriaLabel
source: Expression {0} has value {1}, read eval print loop, debug
uk: Вираз {0} має значення {1}, читати цикл друку эвал налагодження

# replValueOutputAriaLabel
source: {0}, read eval print loop, debug
uk: {0}, читати цикл друку эвал налагодження

# replRawObjectAriaLabel
source: Repl variable {0} has value {1}, read eval print loop, debug
uk: Змінні витрат {0} має значення {1}, читати цикл друку эвал налагодження

source: No Configurations
uk: Жодних Конфігурацій

source: not available
uk: не доступний

# startDebugFirst
source: Please start a debug session to evaluate
uk: Будь ласка, почніть сеанс налагодження, щоб оцінити

source: Copy Value
uk: Скопіювати значення

source: Copy
uk: Скопіювати

source: Copy All
uk: Скопіювати Всі

# copyStackTrace
source: Copy Call Stack
uk: Стек Викликів Копія

source: More Info
uk: Детальніше

# unableToLaunchDebugAdapter
source: Unable to launch debug adapter from '{0}'.
uk: Не вдається запустити налагодження адаптер від "{0}".

# unableToLaunchDebugAdapterNoArgs
source: Unable to launch debug adapter.
uk: Не вдається запустити налагодження адаптера.

# stoppingDebugAdapter
source: {0}. Stopping the debug adapter.
uk: {0}. зупинки debug адаптера.

# debugAdapterCrash
source: Debug adapter process has terminated unexpectedly
uk: Процес адаптеру налагодження було несподівано перервано

source: Unknown Source
uk: Невідоме джерело

# treeAriaLabel
source: Debug Hover
uk: Налагодження Hover

# breakpointWidgetExpressionPlaceholder
source: Break when expression evaluates to true. 'Enter' to accept, 'esc' to cancel.
uk: Перерва, якщо вираз має значення true. 'Enter' - прийняти, 'esc' щоб скасувати.

# breakpointWidgetAriaLabel
source: The program will only stop here if this condition is true. Press Enter to accept or Escape to cancel.
uk: Програма буде зупинятися тільки тут, якщо виконується така умова. Натисніть клавішу Enter для підтвердження або ESC, щоб скасувати.

# breakpointWidgetHitCountPlaceholder
source: Break when hit count condition is met. 'Enter' to accept, 'esc' to cancel.
uk: Перерва коли досягнуто кількості умов hit лічильника. 'Enter' - прийняти, 'esc' щоб скасувати.

# breakpointWidgetHitCountAriaLabel
source: The program will only stop here if the hit count is met. Press Enter to accept or Escape to cancel.
uk: Програма буде зупинятися тільки тут, якщо досягнуто кількості hit лічильника. Натисніть клавішу Enter для підтвердження або ESC, щоб скасувати.

source: Expression
uk: Вираз

source: Hit Count
uk: Хіт лічильник

# debugExceptionWidgetBorder
source: Exception widget border color.
uk: Виключення елемента керування колір рамки.

# debugExceptionWidgetBackground
source: Exception widget background color.
uk: Колір фону віджету винятку.

# exceptionThrownWithId
source: Exception has occurred: {0}
uk: Виняток відбувся: {0}

# exceptionThrown
source: Exception has occurred.
uk: Виключення відбулося.

# vscode.extension.contributes.debuggers
source: Contributes debug adapters.
uk: Сприяє налагодження адаптерів.

# vscode.extension.contributes.debuggers.type
source: Unique identifier for this debug adapter.
uk: Унікальний ідентифікатор для цього адаптера налагодження.

# vscode.extension.contributes.debuggers.label
source: Display name for this debug adapter.
uk: Коротке ім'я для цього адаптера налагодження.

# vscode.extension.contributes.debuggers.program
source: Path to the debug adapter program. Path is either absolute or relative to the extension folder.
uk: Шлях до адаптеру налагодження програми. Шлях абсолютним або відносним до папки розширення.

# vscode.extension.contributes.debuggers.args
source: Optional arguments to pass to the adapter.
uk: Додаткові аргументи для передачі в адаптер.

# vscode.extension.contributes.debuggers.runtime
source: Optional runtime in case the program attribute is not an executable but requires a runtime.
uk: Необов'язково під час виконання у разі, якщо атрибут програми не є виконуваним, але вимагає виконання.

# vscode.extension.contributes.debuggers.runtimeArgs
source: Optional runtime arguments.
uk: Необов'язкові аргументи під час виконання.

# vscode.extension.contributes.debuggers.variables
source: Mapping from interactive variables (e.g ${action.pickProcess}) in `launch.json` to a command.
uk: Зіставлення з інтерактивними змінними (наприклад ${action.pickProcess}) в 'launch.json' до команди.

# vscode.extension.contributes.debuggers.initialConfigurations
source: Configurations for generating the initial 'launch.json'.
uk: Конфігурації для генерації початкового 'launch.json'.

# vscode.extension.contributes.debuggers.languages
source: List of languages for which the debug extension could be considered the "default debugger".
uk: Список мов, для яких розширення налагодження можна вважати "типовий відладчик".

# vscode.extension.contributes.debuggers.adapterExecutableCommand
source: If specified VS Code will call this command to determine the executable path of the debug adapter and the arguments to pass.
uk: Якщо вказаний VS Code закликає цю команду визначити виконуваний шлях адаптера налагодження та аргументи для передачі.

# vscode.extension.contributes.debuggers.configurationSnippets
source: Snippets for adding new configurations in 'launch.json'.
uk: Фрагменти для додавання нових конфігурацій в 'launch.json'.

# vscode.extension.contributes.debuggers.configurationAttributes
source: JSON schema configurations for validating 'launch.json'.
uk: JSON схему конфігураціях для перевірки 'launch.json'.

# vscode.extension.contributes.debuggers.windows
source: Windows specific settings.
uk: Конкретні параметри Windows.

# vscode.extension.contributes.debuggers.windows.runtime
source: Runtime used for Windows.
uk: Середовище виконання для Windows.

# vscode.extension.contributes.debuggers.osx
source: OS X specific settings.
uk: Конкретні параметри ОС х.

# vscode.extension.contributes.debuggers.osx.runtime
source: Runtime used for OSX.
uk: Виконання, що використовуються для OSX.

# vscode.extension.contributes.debuggers.linux
source: Linux specific settings.
uk: Специфічні налаштування ОС Linux.

# vscode.extension.contributes.debuggers.linux.runtime
source: Runtime used for Linux.
uk: Середовище виконання для Linux.

# vscode.extension.contributes.breakpoints
source: Contributes breakpoints.
uk: Сприяє точці зупинки.

# vscode.extension.contributes.breakpoints.language
source: Allow breakpoints for this language.
uk: Дозволити точки зупинки для цієї мови.

# app.launch.json.title
source: Launch
uk: Запуск

# app.launch.json.version
source: Version of this file format.
uk: Версія цього формату файлів.

# app.launch.json.configurations
source: List of configurations. Add new configurations or edit existing ones by using IntelliSense.
uk: Список конфігурацій. Додати нові конфігурації або редагувати вже існуючі за допомогою intellisense.

# app.launch.json.compounds
source: List of compounds. Each compound references multiple configurations which will get launched together.
uk: Список сполучень. Кожне сполучення посилається на кілька конфігурацій, які запускаються разом.

# app.launch.json.compound.name
source: Name of compound. Appears in the launch configuration drop down menu.
uk: Назва сполучення. З'являється в запуску конфігурації випадаючого меню.

# app.launch.json.compounds.configurations
source: Names of configurations that will be started as part of this compound.
uk: Імена конфігурацій, які будуть запущені в рамках цього сполучення.

# debugNoType
source: Debug adapter 'type' can not be omitted and must be of type 'string'.
uk: Тип адаптеру налагодження не може бути пропущено і має належати до типу "рядок".

# selectDebug
source: Select Environment
uk: Виберіть Середовище

# DebugConfig.failed
source: Unable to create 'launch.json' file inside the '.vscode' folder ({0}).
uk: Не вдалося створити файл 'launch.json' всередині '.vscode' папки ({0}).

# fileLinkMac
source: Click to follow (Cmd + click opens to the side)
uk: Натисніть, щоб слідувати (Cmd + клік відкриється збоку)

# fileLink
source: Click to follow (Ctrl + click opens to the side)
uk: Натисніть, щоб слідувати (Ctrl + клік відкриється збоку)

# debug.terminal.title
source: debuggee
uk: відладчик

# debug.terminal.not.available.error
source: Integrated terminal not available
uk: Інтегрований термінал не доступний

# debugAdapterBinNotFound
source: Debug adapter executable '{0}' does not exist.
uk: Адаптер налагодження виконуваного файлу '{0}' не існує.

# debugAdapterCannotDetermineExecutable
source: Cannot determine executable for debug adapter '{0}'.
uk: Не вдалося визначити виконуваний файл для адаптеру налагодження '{0}'.

# launch.config.comment1
source: Use IntelliSense to learn about possible attributes.
uk: Використовувати intellisense, щоб дізнатися про можливі атрибутів.

# launch.config.comment2
source: Hover to view descriptions of existing attributes.
uk: Наведіть для перегляду опису існуючих атрибутів.
