Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_services_textMate(uk).xlf
Languages: uk

# invalid.language
source: Unknown language in `contributes.{0}.language`. Provided value: {1}
uk: Невідома мова в `contributes.{0}.language`. Пропоновані значення: {1}

# invalid.scopeName
source: Expected string in `contributes.{0}.scopeName`. Provided value: {1}
uk: Очікується, що рядки в `contributes.{0}.scopeName`. Пропоновані значення: {1}

# invalid.path.0
source: Expected string in `contributes.{0}.path`. Provided value: {1}
uk: Очікуються рядки в `contributes.{0}.path`. Пропоновані значення: {1}

# invalid.injectTo
source: Invalid value in `contributes.{0}.injectTo`. Must be an array of language scope names. Provided value: {1}
uk: Неприпустиме значення в `contributes.{0}.injectTo`. Повинен бути масив імен областей мови. Пропоновані значення: {1}

# invalid.embeddedLanguages
source: Invalid value in `contributes.{0}.embeddedLanguages`. Must be an object map from scope name to language. Provided value: {1}
uk: Неприпустиме значення в `contributes.{0}.embeddedLanguages`. Повинен бути об'єкт карти від імені мови. Пропоновані значення: {1}

# invalid.path.1
source: Expected `contributes.{0}.path` ({1}) to be included inside extension's folder ({2}). This might make the extension non-portable.
uk: Очікуваний `contributes.{0}.path` ({1}), щоб бути включеними в папці модуля ({2}). Це може усунути портативність додатку.

# no-tm-grammar
source: No TM Grammar registered for this language.
uk: Немає ТМ граматики зареєстровано для цієї мови.

# vscode.extension.contributes.grammars
source: Contributes textmate tokenizers.
uk: Сприяє textmate tokenizers.

# vscode.extension.contributes.grammars.language
source: Language identifier for which this syntax is contributed to.
uk: Ідентифікатор мови, для якого цей синтаксис сприяли.

# vscode.extension.contributes.grammars.scopeName
source: Textmate scope name used by the tmLanguage file.
uk: Textmate ім'я області, що використовується файлом tmLanguage.

# vscode.extension.contributes.grammars.path
source: Path of the tmLanguage file. The path is relative to the extension folder and typically starts with './syntaxes/'.
uk: Шлях до файлу tmLanguage. Шлях є відносним до папки розширень і, як правило, починається з './syntaxes/'.

# vscode.extension.contributes.grammars.embeddedLanguages
source: A map of scope name to language id if this grammar contains embedded languages.
uk: Карта назви областей дії мови, якщо ця граматика містить вбудовані мови.

# vscode.extension.contributes.grammars.injectTo
source: List of language scope names to which this grammar is injected to.
uk: Карта назви областей дії мови, якщо ця граматика містить вбудовані мови.
