Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_services_files(uk).xlf
Languages: uk

# fileBinaryError
source: File seems to be binary and cannot be opened as text
uk: Файл, здається, бінарний і не може бути відкритий як текстовий

# netVersionError
source: The Microsoft .NET Framework 4.5 is required. Please follow the link to install it.
uk: Microsoft .NET Framework 4.5 є обов'язковим. Будь ласка, слідуйте за посиланням, щоб встановити його.

# installNet
source: Download .NET Framework 4.5
uk: Завантажити .NET Framework 4.5

# neverShowAgain
source: Don't Show Again
uk: Більше не показувати

# trashFailed
source: Failed to move '{0}' to the trash
uk: Не вдалося перемістити "{0}" в кошик

# fileInvalidPath
source: Invalid file resource ({0})
uk: Неправильний файл ресурсу ({0})

# fileIsDirectoryError
source: File is directory
uk: Файл - це каталог

# fileNotModifiedError
source: File not modified since
uk: Файл не змінено з моменту

# fileTooLargeError
source: File too large to open
uk: Занадто великий файл для відкриття

# fileNotFoundError
source: File not found ({0})
uk: Файл не знайдено ({0})

# filePermission
source: Permission denied writing to file ({0})
uk: Доступ заборонений при записі у файл ({0})

# fileExists
source: File to create already exists ({0})
uk: Файл вже існує ({0})

# fileMoveConflict
source: Unable to move/copy. File already exists at destination.
uk: Не вдається перемістити/скопіювати. Файл вже існує в місці призначення.

# unableToMoveCopyError
source: Unable to move/copy. File would replace folder it is contained in.
uk: Не вдається перемістити/скопіювати. Файл замінить папку, де він знаходиться.

# foldersCopyError
source: Folders cannot be copied into the workspace. Please select individual files to copy them.
uk: Папки не можуть бути скопійовані в робочу область. Будь ласка, виберіть окремі файли, щоб скопіювати їх.

# fileModifiedError
source: File Modified Since
uk: Файл змінено з моменту

# fileReadOnlyError
source: File is Read Only
uk: Файл тільки для читання
