Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_services_themes(uk).xlf
Languages: uk

# error.cannotloadtheme
source: Unable to load {0}: {1}
uk: Не вдалося завантажити {0}: {1}

# colorTheme
source: Specifies the color theme used in the workbench.
uk: Задає колір теми, що використовуються в робочій зоні.

# colorThemeError
source: Theme is unknown or not installed.
uk: Тема невідома або не встановлена.

# iconTheme
source: Specifies the icon theme used in the workbench or 'null' to not show any file icons.
uk: Вказує тему іконки, яка використовується в робочому столі, або "null", щоб не відображати будь-які піктограми файлів.

# noIconThemeDesc
source: No file icons
uk: Немає іконок файлів

# iconThemeError
source: File icon theme is unknown or not installed.
uk: Тема значків файлів невідома або не встановлена.

# workbenchColors
source: Overrides colors from the currently selected color theme.
uk: Перевизначає кольору з обраної колірної темою.

# editorColors.comments
source: Sets the colors and styles for comments
uk: Набори кольорів і стилів для коментарів

# editorColors.strings
source: Sets the colors and styles for strings literals.
uk: Задає кольори і стилі для рядків символів.

# editorColors.keywords
source: Sets the colors and styles for keywords.
uk: Набори кольорів і стилів за ключовими словами.

# editorColors.numbers
source: Sets the colors and styles for number literals.
uk: Набори кольорів і стилів для числових символів.

# editorColors.types
source: Sets the colors and styles for type declarations and references.
uk: Задає кольори і стилі для опису типу і посилання.

# editorColors.functions
source: Sets the colors and styles for functions declarations and references.
uk: Набори кольорів і стилів для оголошення функцій і посилань.

# editorColors.variables
source: Sets the colors and styles for variables declarations and references.
uk: Набори кольорів і стилів для оголошення змінних і посилань.

# editorColors.textMateRules
source: Sets colors and styles using textmate theming rules (advanced).
uk: Набори кольорів і стилів, використовуючи textmate тематизації правил (додатково).

# editorColors
source: Overrides editor colors and font style from the currently selected color theme.
uk: Змінення кольорів редактор і стиль шрифту з вибраного кольору теми.

# error.cannotparsejson
source: Problems parsing JSON theme file: {0}
uk: Проблеми аналізу JSON файлу теми: {0}

# error.invalidformat.colors
source: Problem parsing color theme file: {0}. Property 'colors' is not of type 'object'.
uk: Проблема парсингу файлу теми кольорів: {0}. Властивість 'кольори' не є типом 'об'єкт'.

# error.invalidformat.tokenColors
source: Problem parsing color theme file: {0}. Property 'tokenColors' should be either an array specifying colors or a path to a TextMate theme file
uk: Проблема парсингу файлу теми кольорів: {0}. Властивість 'tokenColors' повинна бути або масивом із зазначенням кольорів або шляхом до файлу теми TextMate

# error.plist.invalidformat
source: Problem parsing tmTheme file: {0}. 'settings' is not array.
uk: Проблема парсинга tmTheme файлу: {0}. 'settings' - не масив.

# error.cannotparse
source: Problems parsing tmTheme file: {0}
uk: Проблеми при розборі файлу tmTheme: {0}

# error.cannotload
source: Problems loading tmTheme file {0}: {1}
uk: Проблеми з завантаженням файлів tmTheme {0}: {1}

# schema.token.settings
source: Colors and styles for the token.
uk: Кольори та стилі для токенів.

# schema.token.foreground
source: Foreground color for the token.
uk: Колір переднього плану для токену.

# schema.token.background.warning
source: Token background colors are currently not supported.
uk: В даний час токен кольору фону не підтримуються.

# schema.token.fontStyle
source: Font style of the rule: One or a combination of 'italic', 'bold' and 'underline'
uk: Стиль шрифту правила: одне або поєднання 'курсив', 'жирний' і 'підкреслений'

# schema.fontStyle.error
source: Font style must be a combination of 'italic', 'bold' and 'underline'
uk: Стиль шрифту має бути поєднання 'курсив', 'жирний' і 'підкреслений'

# schema.properties.name
source: Description of the rule.
uk: Опис правила.

# schema.properties.scope
source: Scope selector against which this rule matches.
uk: Селектор області, щодо яких це правило відповідає.

# schema.tokenColors.path
source: Path to a tmTheme file (relative to the current file).
uk: Шлях до файлу tmTheme (щодо поточного файлу).

# schema.colors
source: Colors for syntax highlighting
uk: Кольори для підсвічування синтаксису

# error.cannotparseicontheme
source: Problems parsing file icons file: {0}
uk: Проблеми при розборі файлу іконки файл: {0}

# schema.folderExpanded
source: The folder icon for expanded folders. The expanded folder icon is optional. If not set, the icon defined for folder will be shown.
uk: Піктограма папки для розгорнутих папок. Розгорнутий значок теки не є обов'язковим. Якщо не встановлено, буде показано значок, визначений для папки.

# schema.folder
source: The folder icon for collapsed folders, and if folderExpanded is not set, also for expanded folders.
uk: Значок папки для згорнутих папок, і якщо folderExpanded не встановлено, також для розгорнутої папки.

# schema.file
source: The default file icon, shown for all files that don't match any extension, filename or language id.
uk: Типовий значок файлу відображається для всіх файлів, які не відповідають будь-яким розширенням, ім'ям або ідентифікатором мови.

# schema.folderNames
source: Associates folder names to icons. The object key is is the folder name, not including any path segments. No patterns or wildcards are allowed. Folder name matching is case insensitive.
uk: Пов'язує імена папок до іконок. Ключовий об'єкт-ім'я папки, не включаючи будь-які відрізки шляху. Жодних шаблонів або масок. Ім'я папки зіставлення без урахування регістру.

# schema.folderName
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення значок асоціації.

# schema.folderNamesExpanded
source: Associates folder names to icons for expanded folders. The object key is is the folder name, not including any path segments. No patterns or wildcards are allowed. Folder name matching is case insensitive.
uk: Папка пов'язує імена іконок для розгорнутих папок. Ключовий об'єкт-ім'я папки, не включаючи будь-які відрізки шляху. Жодних шаблонів або масок. Ім'я папки зіставлення без урахування регістру.

# schema.folderNameExpanded
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення значок асоціації.

# schema.fileExtensions
source: Associates file extensions to icons. The object key is is the file extension name. The extension name is the last segment of a file name after the last dot (not including the dot). Extensions are compared case insensitive.
uk: Асоціює розширення файлів до іконок. Ключовий об'єкт-це розширення імені файлу. Назва розширення-це остання частина імені файлу після останньої крапки (не включаючи точку). Розширення порівнюються без урахування регістру.

# schema.fileExtension
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення значок асоціації.

# schema.fileNames
source: Associates file names to icons. The object key is is the full file name, but not including any path segments. File name can include dots and a possible file extension. No patterns or wildcards are allowed. File name matching is case insensitive.
uk: Пов'язує імена файлів до іконок. Ключовим об'єктом є повне ім'я файлу, але не включаючи будь-які відрізки шляху. Ім'я файлу може містити точки і можливе розширення. Жодних шаблонів або масок. Відповідність імені файлу без урахування регістру.

# schema.fileName
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення значок асоціації.

# schema.languageIds
source: Associates languages to icons. The object key is the language id as defined in the language contribution point.
uk: Асоціює мову з іконками. Ключовим об'єктом є ідентифікатор мови, як це визначено в точці вкладу мовою.

# schema.languageId
source: The ID of the icon definition for the association.
uk: Ідентифікатор визначення значок асоціації.

# schema.fonts
source: Fonts that are used in the icon definitions.
uk: Шрифти, які використовуються у визначеннях значку.

# schema.id
source: The ID of the font.
uk: Ідентифікатор шрифту.

# schema.src
source: The locations of the font.
uk: Розташування шрифту.

# schema.font-path
source: The font path, relative to the current icon theme file.
uk: Шлях шрифту щодо поточного файл значка.

# schema.font-format
source: The format of the font.
uk: Формат шрифту.

# schema.font-weight
source: The weight of the font.
uk: Вага шрифту.

# schema.font-sstyle
source: The style of the font.
uk: Стиль шрифту.

# schema.font-size
source: The default size of the font.
uk: За замовчуванням розмір шрифту.

# schema.iconDefinitions
source: Description of all icons that can be used when associating files to icons.
uk: Опис всіх значків які можна використовувати при зв'язуванні файлів в іконки.

# schema.iconDefinition
source: An icon definition. The object key is the ID of the definition.
uk: Визначення значка. Ключовий об'єкт-це ідентифікатор визначенням.

# schema.iconPath
source: When using a SVG or PNG: The path to the image. The path is relative to the icon set file.
uk: При використанні SVG або PNG: шлях до зображення. Шлях є відносним до ікони встановити файл.

# schema.fontCharacter
source: When using a glyph font: The character in the font to use.
uk: Під час використання гліфів шрифту: символів шрифту для використання.

# schema.fontColor
source: When using a glyph font: The color to use.
uk: Під час використання гліфів шрифту: колір буде використано.

# schema.fontSize
source: When using a font: The font size in percentage to the text font. If not set, defaults to the size in the font definition.
uk: При використанні шрифту: розмір шрифту у відсотках до текстового шрифту. Якщо не вказано, використовується за умовчанням розмір у визначенні шрифту.

# schema.fontId
source: When using a font: The id of the font. If not set, defaults to the first font definition.
uk: При використанні шрифту: ідентифікатор шрифту. Якщо не задано, за замовчуванням використовується перше визначення шрифту.

# schema.light
source: Optional associations for file icons in light color themes.
uk: Необов'язкові асоціації для піктограм файлів у світлих тонах.

# schema.highContrast
source: Optional associations for file icons in high contrast color themes.
uk: Необов'язкові асоціації для піктограм файлів в контрастних колірних гамах.

# schema.hidesExplorerArrows
source: Configures whether the file explorer's arrows should be hidden when this theme is active.
uk: Налаштовує чи потрібно приховати Файловий провідник стрілки, коли ця тема є активною.

# vscode.extension.contributes.themes
source: Contributes textmate color themes.
uk: Допомагає текстові кольорові теми.

# vscode.extension.contributes.themes.id
source: Id of the icon theme as used in the user settings.
uk: Ідентифікатор теми значків, використовуваного в налаштуваннях користувача.

# vscode.extension.contributes.themes.label
source: Label of the color theme as shown in the UI.
uk: Мітки теми колір, як показано в інтерфейсі.

# vscode.extension.contributes.themes.uiTheme
source: Base theme defining the colors around the editor: 'vs' is the light color theme, 'vs-dark' is the dark color theme. 'hc-black' is the dark high contrast theme.
uk: Тема бази, що визначає колір навколо редактора: 'vs' - це тема світлого кольору, 'vs-dark' - темний колір теми. 'hc-black' - темна тема високої контрастності.

# vscode.extension.contributes.themes.path
source: Path of the tmTheme file. The path is relative to the extension folder and is typically './themes/themeFile.tmTheme'.
uk: Шлях до файлу tmTheme. Шлях є відносним до папки розширення, і зазвичай './themes/themeFile.tmTheme'.

# reqarray
source: Extension point `{0}` must be an array.
uk: Точки розширення `{0}` повинен бути масивом.

# reqpath
source: Expected string in `contributes.{0}.path`. Provided value: {1}
uk: Очікуються рядки в `contributes.{0}.path`. Пропоновані значення: {1}

# invalid.path.1
source: Expected `contributes.{0}.path` ({1}) to be included inside extension's folder ({2}). This might make the extension non-portable.
uk: Очікуваний `contributes.{0}.path` ({1}), щоб бути включеними в папці модуля ({2}). Це може усунути портативність додатку.

# vscode.extension.contributes.iconThemes
source: Contributes file icon themes.
uk: Сприяє файл теми іконок.

# vscode.extension.contributes.iconThemes.id
source: Id of the icon theme as used in the user settings.
uk: Ідентифікатор теми значків, використовуваного в налаштуваннях користувача.

# vscode.extension.contributes.iconThemes.label
source: Label of the icon theme as shown in the UI.
uk: Мітки теми значок, як показано в інтерфейсі.

# vscode.extension.contributes.iconThemes.path
source: Path of the icon theme definition file. The path is relative to the extension folder and is typically './icons/awesome-icon-theme.json'.
uk: Шлях до файлу визначення тем іконок. Шлях є відносним до папки розширення, і зазвичай './icons/awesome-icon-theme.json'.

# reqid
source: Expected string in `contributes.{0}.id`. Provided value: {1}
uk: Очікується, що рядки в `contributes.{0}.id`. Пропоновані значення: {1}
