Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_execution(uk).xlf
Languages: uk

# terminalConfigurationTitle
source: External Terminal
uk: Зовнішній Термінал

# explorer.openInTerminalKind
source: Customizes what kind of terminal to launch.
uk: Налаштовує який термінал запустити.

# terminal.external.windowsExec
source: Customizes which terminal to run on Windows.
uk: Налаштовує термінал для роботи у Windows.

# terminal.external.osxExec
source: Customizes which terminal application to run on OS X.
uk: Налаштовує, яке додаток терміналу для роботи на ОС Х.

# terminal.external.linuxExec
source: Customizes which terminal to run on Linux.
uk: Налаштовує термінал для запуску у Linux.

# globalConsoleActionWin
source: Open New Command Prompt
uk: Відкрити новий командний рядок

# globalConsoleActionMacLinux
source: Open New Terminal
uk: Відкрити новий термінал

# scopedConsoleActionWin
source: Open in Command Prompt
uk: Відкрити в командному рядку

# scopedConsoleActionMacLinux
source: Open in Terminal
uk: Відкрийте в терміналі

# openFolderInIntegratedTerminal
source: Open in Terminal
uk: Відкрийте в терміналі

# console.title
source: VS Code Console
uk: VS Code консоль

# mac.terminal.script.failed
source: Script '{0}' failed with exit code {1}
uk: Сценарій '{0}' завершився з кодом виходу {1}

# mac.terminal.type.not.supported
source: '{0}' not supported
uk: '{0}' не підтримується

# press.any.key
source: Press any key to continue...
uk: Натисніть будь-яку клавішу для продовження...

# linux.term.failed
source: '{0}' failed with exit code {1}
uk: '{0}' завершився з кодом виходу {1}
