Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_tasks(uk).xlf
Languages: uk

# tasksCategory
source: Tasks
uk: Завдання

# ConfigureTaskRunnerAction.label
source: Configure Task
uk: Настроювання завдання

# CloseMessageAction.label
source: Close
uk: Закрити

source: Problems
uk: Проблеми

source: Building...
uk: Будування...

# runningTasks
source: Show Running Tasks
uk: Показати запущені завдання

source: Tasks
uk: Завдання

# TaskSystem.noHotSwap
source: Changing the task execution engine with an active task running requires to reload the Window
uk: Зміна движка виконання завдання з активним завданням вимагає перезавантаження вікна

# TaskServer.folderIgnored
source: The folder {0} is ignored since it uses task version 0.1.0
uk: Папка {0} проігноровано, оскільки він використовує завдання версії 0.1.0

# TaskService.noBuildTask1
source: No build task defined. Mark a task with 'isBuildCommand' in the tasks.json file.
uk: Завдання побудови не визначено. Позначення завдання 'isBuildCommand' у файлі tasks.json.

# TaskService.noBuildTask2
source: No build task defined. Mark a task with as a 'build' group in the tasks.json file.
uk: Завдання побудови не визначено. Позначити завдання як групу 'build' у файлі tasks.json.

# TaskService.noTestTask1
source: No test task defined. Mark a task with 'isTestCommand' in the tasks.json file.
uk: Тест завдання не визначено. Позначення завдання 'isTestCommand' у файлі tasks.json.

# TaskService.noTestTask2
source: No test task defined. Mark a task with as a 'test' group in the tasks.json file.
uk: Тест завдання не визначено. Позначити завдання як 'test' групи у файлі tasks.json.

# TaskServer.noTask
source: Requested task {0} to execute not found.
uk: Запит завдання {0} для виконання не знайдено.

# TaskService.associate
source: associate
uk: зв'язати

# TaskService.attachProblemMatcher.continueWithout
source: Continue without scanning the task output
uk: Продовжити без сканування вихідних даних завдання

# TaskService.attachProblemMatcher.never
source: Never scan the task output
uk: Ніколи не скануйвати вихідні дані завдання

# TaskService.attachProblemMatcher.learnMoreAbout
source: Learn more about scanning the task output
uk: Дізнатися більше про сканування вихідних даних завдання

# selectProblemMatcher
source: Select for which kind of errors and warnings to scan the task output
uk: Виберіть для якого роду помилок і попереджень для сканування вихідного завдання

# customizeParseErrors
source: The current task configuration has errors. Please fix the errors first before customizing a task.
uk: Поточна задача містить помилки. Будь ласка, виправте помилки, перш ніж настроювати завдання.

# moreThanOneBuildTask
source: There are many build tasks defined in the tasks.json. Executing the first one.
uk: Існує безліч завдань побудови у tasks.json. Виконання першого.

# TaskSystem.activeSame.background
source: The task '{0}' is already active and in background mode. To terminate it use `Terminate Task...` from the Tasks menu.
uk: Завдання '{0}' вже активно працює і у фоновому режимі. Щоб зупинити його виберіть `Завершити завдання...` в меню Завдання.

# TaskSystem.activeSame.noBackground
source: The task '{0}' is already active. To terminate it use `Terminate Task...` from the Tasks menu.
uk: Завдання '{0}' вже активне. Щоб зупинити його виберіть `Завершити завдання...` в меню Завдання.

# TaskSystem.active
source: There is already a task running. Terminate it first before executing another task.
uk: Тут вже запущене завдання. Завершіть його, перш ніж виконати інше завдання.

# TaskSystem.restartFailed
source: Failed to terminate and restart task {0}
uk: Не вдалося перервати і перезапустити завдання {0}

# TaskService.noConfiguration
source: Error: The {0} task detection didn't contribute a task for the following configuration: {1} The task will be ignored.
uk: Помилка: визначення завдань {0} не дало завдання для наступної конфігурації: {1} завдання буде ігноруватися.

# TaskSystem.configurationErrors
source: Error: the provided task configuration has validation errors and can't not be used. Please correct the errors first.
uk: Помилка: надана конфігурація завдань має помилки перевірки та не може бути використана. Будь ласка, спочатку виправте помилки.

# taskService.ignoreingFolder
source: Ignoring task configurations for workspace folder {0}. Multi folder workspace task support requires that all folders use task version 2.0.0
uk: Ігнорування конфігурації завдань для папок робочого простору {0}. Підтримка завдань для робочих областей з кількома папками вимагає використання всіх папок у версії 2.0.0 завдання

# TaskSystem.invalidTaskJson
source: Error: The content of the tasks.json file has syntax errors. Please correct them before executing a task.
uk: Помилка: зміст tasks.json-файл має синтаксичні помилки. Будь ласка, виправте їх перед виконанням завдання.

# TaskSystem.runningTask
source: There is a task running. Do you want to terminate it?
uk: Там це завдання запущено. Ви хочете, перервати його?

# TaskSystem.terminateTask
source: &&Terminate Task
uk: &&Припинити завдання

# TaskSystem.noProcess
source: The launched task doesn't exist anymore. If the task spawned background processes exiting VS Code might result in orphaned processes. To avoid this start the last background process with a wait flag.
uk: Запущена задача більше не існує. Якщо завдання викликало фонові процеси, що виходять з VS Code, це може призвести до сирітських процесів. Щоб уникнути цього початку, останній фонове процес з прапором чекання.

# TaskSystem.exitAnyways
source: &&Exit Anyways
uk: &&Вийти хоч би що

# TerminateAction.label
source: Terminate Task
uk: Завершити Завдання

# TaskSystem.unknownError
source: An error has occurred while running a task. See task log for details.
uk: Сталася помилка під час виконання завдання. Подивитися журнал завдань для деталей.

# TaskService.noWorkspace
source: Tasks are only available on a workspace folder.
uk: Завдання доступні лише у папці робочої області.

# recentlyUsed
source: recently used tasks
uk: нещодавно використовуваних завдань

# configured
source: configured tasks
uk: налаштовані завдання

# detected
source: detected tasks
uk: виявлені завдання

# TaskService.ignoredFolder
source: The following workspace folders are ignored since they use task version 0.1.0:
uk: Такі папки робочої області ігноруються, оскільки вони використовують завдання версії 0.1.0:

# TaskService.notAgain
source: Don't Show Again
uk: Більше не показувати

# TaskService.ok
source: OK
uk: Гаразд

# TaskService.pickRunTask
source: Select the task to run
uk: Виберіть завдання для виконання

# TaslService.noEntryToRun
source: No task to run found. Configure Tasks...
uk: Завдань для запуску не знайдено. Налаштувати Завдання...

# TaskService.fetchingBuildTasks
source: Fetching build tasks...
uk: Вибірка завдання побудови...

# TaskService.pickBuildTask
source: Select the build task to run
uk: Виберіть задачу побудови для виконання

# TaskService.noBuildTask
source: No build task to run found. Configure Build Task...
uk: Завдань побудови для запуску не знайдено. Налаштування завдань побудови...

# TaskService.fetchingTestTasks
source: Fetching test tasks...
uk: Вибірка тестових завдань...

# TaskService.pickTestTask
source: Select the test task to run
uk: Виберіть тестове завдання для виконання

# TaskService.noTestTaskTerminal
source: No test task to run found. Configure Tasks...
uk: Завдання тесту не знайдено. Налаштувати Завдання...

# TaskService.tastToTerminate
source: Select task to terminate
uk: Виберіть завдання, щоб припинити

# TaskService.noTaskRunning
source: No task is currently running
uk: В даний час жодна задача не виконується

# TerminateAction.noProcess
source: The launched process doesn't exist anymore. If the task spawned background tasks exiting VS Code might result in orphaned processes.
uk: Запущений процес більше не існує. Якщо завдання породжених фонових завдань, що виходять з VS Code, може призвести до сирітських процесів.

# TerminateAction.failed
source: Failed to terminate running task
uk: Не вдалося завершити виконання завдань

# TaskService.tastToRestart
source: Select the task to restart
uk: Виберіть завдання для перезавантаження

# TaskService.noTaskToRestart
source: No task to restart
uk: Немає завдань, щоб перезавантажити

# TaskService.template
source: Select a Task Template
uk: Виберіть шаблон завдання

# TaskService.createJsonFile
source: Create tasks.json file from template
uk: Створити tasks.json файл із шаблону

# TaskService.openJsonFile
source: Open tasks.json file
uk: Відкрити tasks.json файл

# TaskService.pickTask
source: Select a task to configure
uk: Виберіть завдання для налаштування

# TaskService.defaultBuildTaskExists
source: {0} is already marked as the default build task
uk: {0}, вже відзначено як значення за замовчуванням для задач побудови

# TaskService.pickDefaultBuildTask
source: Select the task to be used as the default build task
uk: Виберіть завдання, щоб використовуватися в якості значення за замовчуванням для задач побудови

# TaskService.defaultTestTaskExists
source: {0} is already marked as the default test task.
uk: {0}, вже відзначено як тестове завдання за замовчуванням.

# TaskService.pickDefaultTestTask
source: Select the task to be used as the default test task
uk: Виберіть задачу в якості тестового завдання за замовчуванням

# TaskService.pickShowTask
source: Select the task to show its output
uk: Виберіть завдання, щоб показати його вивід

# TaskService.noTaskIsRunning
source: No task is running
uk: Жодна задача не виконується

# ShowLogAction.label
source: Show Task Log
uk: Показати Журнал Завдань

# RunTaskAction.label
source: Run Task
uk: Запуск завдання

# RestartTaskAction.label
source: Restart Running Task
uk: Перезапуск Запущеного завдання

# ShowTasksAction.label
source: Show Running Tasks
uk: Показати запущені завдання

# BuildAction.label
source: Run Build Task
uk: Виконання завдань побудови

# TestAction.label
source: Run Test Task
uk: Виконання тестового завдання

# ConfigureDefaultBuildTask.label
source: Configure Default Build Task
uk: Налаштування За Замовчуванням Для Задач Побудови

# ConfigureDefaultTestTask.label
source: Configure Default Test Task
uk: Налаштувати Тестове Завдання За Замовчуванням

# quickOpen.task
source: Run Task
uk: Запуск завдання

# tasksAriaLabel
source: Type the name of a task to run
uk: Введіть ім'я завдання для виконання

source: No tasks matching
uk: Немає збігу завдання

source: No tasks found
uk: Ніякі завдання не знайдено

# dotnetCore
source: Executes .NET Core build command
uk: Виконує .NET Core команду побудови

# msbuild
source: Executes the build target
uk: Виконає ціль побудови

# externalCommand
source: Example to run an arbitrary external command
uk: Приклад для запуску довільних зовнішніх команд

# Maven
source: Executes common maven commands
uk: Виконує поширені команди maven

# TaskRunnerSystem.unknownError
source: A unknown error has occurred while executing a task. See task output log for details.
uk: Невідома помилка при виконанні завдання. Докладніше див. Журнал виводу завдання.

# TaskRunnerSystem.watchingBuildTaskFinished
source: Watching build tasks has finished.
uk: Перегляд завдань збірки завершено.

# TaskRunnerSystem.childProcessError
source: Failed to launch external program {0} {1}.
uk: Не вдалося запустити зовнішню програму {0} {1}.

# TaskRunnerSystem.cancelRequested
source: The task '{0}' was terminated per user request.
uk: Завдання "{0}" було припинено на запит користувача.

# unkownProblemMatcher
source: Problem matcher {0} can't be resolved. The matcher will be ignored
uk: Співставник проблем {0} не вдалося розпізнати. Він буде ігноруватися.

# TerminalTaskSystem.unknownError
source: A unknown error has occurred while executing a task. See task output log for details.
uk: Невідома помилка при виконанні завдання. Докладніше див. Журнал виводу завдання.

# dependencyFailed
source: Couldn't resolve dependent task '{0}' in workspace folder '{1}'
uk: Не можна вирішити залежні задачі '{0}' в папці робочої області '{1}'

# TerminalTaskSystem.terminalName
source: Task - {0}
uk: Завдання - {0}

# closeTerminal
source: Press any key to close the terminal.
uk: Натисніть будь-яку клавішу, щоб закрити термінал.

# reuseTerminal
source: Terminal will be reused by tasks, press any key to close it.
uk: Термінал буде використовуватися завдання, натисніть будь-яку клавішу, щоб закрити його.

# TerminalTaskSystem
source: Can't execute a shell command on an UNC drive.
uk: Не вдалося виконати shell команду на диску UNC.

# ConfigurationParser.invalidCWD
source: Warning: options.cwd must be of type string. Ignoring value {0}
uk: Попередження: options.cwd має належати до типу "рядок". Ігнорування значення {0}

# ConfigurationParser.noargs
source: Error: command arguments must be an array of strings. Provided value is: {0}
uk: Помилка: аргументи команди повинен бути масив рядків. Вказане значення: {0}

# ConfigurationParser.noShell
source: Warning: shell configuration is only supported when executing tasks in the terminal.
uk: Попередження: конфігурація оболонки підтримується тільки при виконанні завдань у терміналі.

# ConfigurationParser.noName
source: Error: Problem Matcher in declare scope must have a name: {0}
uk: Помилка: співставник проблем в області оголошення повинен мати ім'я: {0}

# ConfigurationParser.unknownMatcherKind
source: Warning: the defined problem matcher is unknown. Supported types are string | ProblemMatcher | (string | ProblemMatcher)[]. {0}
uk: Попередження: визначений співставник проблем невідомий. Підтримувані типи: рядок | ProblemMatcher | (рядок | ProblemMatcher)[]. {0}

# ConfigurationParser.invalidVaraibleReference
source: Error: Invalid problemMatcher reference: {0}
uk: Помилка: Некоректне посилання problemMatcher: {0}

# ConfigurationParser.noTaskType
source: Error: tasks configuration must have a type property. The configuration will be ignored. {0}
uk: Помилка: конфігурація завдань повинна мати властивість типу. Налаштування будуть проігноровані. {0}

# ConfigurationParser.noTypeDefinition
source: Error: there is no registered task type '{0}'. Did you miss to install an extension that provides a corresponding task provider?
uk: Помилка: немає зареєстрованих типів завдань '{0}'. Ви пропустили встановлення розширення, яке надає відповідний постачальник запитів?

# ConfigurationParser.missingRequiredProperty
source: Error: the task configuration '{0}' missed the required property '{1}'. The task configuration will be ignored.
uk: Помилка: у конфігурації завдання '{0}' пропустив обов'язкову властивість '{1}'. Задачу налаштування буде проігнорованно.

# ConfigurationParser.notCustom
source: Error: tasks is not declared as a custom task. The configuration will be ignored. {0}
uk: Помилка: завдання не оголошується в якості користувача завдання. Налаштування будуть проігноровані. {0}

# ConfigurationParser.noTaskName
source: Error: a task must provide a label property. The task will be ignored. {0}
uk: Помилка: завдання повинно містити властивість label. Завдання будуть ігноруватися. {0}

# taskConfiguration.shellArgs
source: Warning: the task '{0}' is a shell command and one of its arguments might have unescaped spaces. To ensure correct command line quoting please merge args into the command.
uk: Попередження: завдання '{0}' - це команда оболонки, і один з її аргументів може мати пропущені прогалини. Щоб забезпечити коректний командний рядок, будь ласка, об'єднайте аргументи в команду.

# taskConfiguration.noCommandOrDependsOn
source: Error: the task '{0}' neither specifies a command nor a dependsOn property. The task will be ignored. Its definition is: {1}
uk: Помилка: завдання '{0}' не вказує ні команду, ні власність залежності. Завдання будуть ігноруватися. Його визначення: {1}

# taskConfiguration.noCommand
source: Error: the task '{0}' doesn't define a command. The task will be ignored. Its definition is: {1}
uk: Помилка: завдання '{0}' не визначає команду. Завдання будуть ігноруватися. Його визначення: {1}

# TaskParse.noOsSpecificGlobalTasks
source: Task version 2.0.0 doesn't support global OS specific tasks. Convert them to a task with a OS specific command. Affected tasks are: {0}
uk: Завдання версії 2.0.0 не підтримує глобальні ОС конкретних завдань. Перетворити їх в задачі з конкретної команди операційної системи. Порушені завдання: {0}

# entryAriaLabel
source: {0}, tasks
uk: {0}, завдань

# customizeTask
source: Configure Task
uk: Настроювання завдання

# JsonSchema.shell
source: Specifies whether the command is a shell command or an external program. Defaults to false if omitted.
uk: Вказує, чи є команда командної оболонки чи зовнішньої програми. За замовчуванням false, якщо не зазначено.

# JsonSchema.tasks.isShellCommand.deprecated
source: The property isShellCommand is deprecated. Use the type property of the task and the shell property in the options instead. See also the 1.14 release notes.
uk: isShellCommand властивість є застарілою. Використовуйте властивість типу завдання і властивості оболонки замість варіантів. См. також у 1.14 версії.

# JsonSchema.tasks.dependsOn.string
source: Another task this task depends on.
uk: Інше завдання, залежить від цього завдання.

# JsonSchema.tasks.dependsOn.array
source: The other tasks this task depends on.
uk: Інші завдання, залежать від цього завдання.

# JsonSchema.tasks.presentation
source: Configures the panel that is used to present the task's ouput and reads its input.
uk: Налаштовує панель, яка використовується для представлення вихідної задачі і зчитує її вхідні дані.

# JsonSchema.tasks.presentation.echo
source: Controls whether the executed command is echoed to the panel. Default is true.
uk: Визначає, чи буде виконуватна команда відображається на панелі. За замовчуванням True.

# JsonSchema.tasks.presentation.focus
source: Controls whether the panel takes focus. Default is false. If set to true the panel is revealed as well.
uk: Контролює, чи бере панель фокус. За умовчанням це невірно. Якщо встановлено значення «true», панель також виявляється.

# JsonSchema.tasks.presentation.reveal.always
source: Always reveals the terminal when this task is executed.
uk: Завжди показує термінал, коли ця задача виконується.

# JsonSchema.tasks.presentation.reveal.silent
source: Only reveals the terminal if no problem matcher is associated with the task and an errors occurs executing it.
uk: Розкривається тільки в терміналі, якщо немає проблем збігів пов'язаний із завданням і помилок його виконання.

# JsonSchema.tasks.presentation.reveal.never
source: Never reveals the terminal when this task is executed.
uk: Ніколи не розкриває терміналу, коли ця задача виконується.

# JsonSchema.tasks.presentation.reveals
source: Controls whether the panel running the task is revealed or not. Default is "always".
uk: Визначає, чи панель запуску завдань розкривається чи ні. За замовчуванням "завжди".

# JsonSchema.tasks.presentation.instance
source: Controls if the panel is shared between tasks, dedicated to this task or a new one is created on every run.
uk: Якщо панель управління розділяється між завданнями, присвячений цим завданням або новий створюється при кожному запуску.

# JsonSchema.tasks.terminal
source: The terminal property is deprecated. Use presentation instead
uk: Властивість терміналу застаріла. Використовувати натомість презентації

# JsonSchema.tasks.group.kind
source: The task's execution group.
uk: Група виконання завдання.

# JsonSchema.tasks.group.isDefault
source: Defines if this task is the default task in the group.
uk: Визначає, якщо ця задача є задачею за замовчуванням в групі.

# JsonSchema.tasks.group.defaultBuild
source: Marks the tasks as the default build task.
uk: Мітки завдання для задач побудови.

# JsonSchema.tasks.group.defaultTest
source: Marks the tasks as the default test task.
uk: Позначити завдання тестового завдання за замовчуванням.

# JsonSchema.tasks.group.build
source: Marks the tasks as a build task accesible through the 'Run Build Task' command.
uk: Позначає завдання як завдання збірки, доступними через команду 'Запустити завдання зі створення'.

# JsonSchema.tasks.group.test
source: Marks the tasks as a test task accesible through the 'Run Test Task' command.
uk: Позначає завдання як завдання збірки, доступними через команду 'Запустити тестове завдання'.

# JsonSchema.tasks.group.none
source: Assigns the task to no group
uk: Призначає завдання без групи

# JsonSchema.tasks.group
source: Defines to which execution group this task belongs to. It supports "build" to add it to the build group and "test" to add it to the test group.
uk: Визначає, до якої групи виконання цього завдання належить. Він підтримує "побудувати", щоб додати його до групи побудувати і "тест", щоб додати його в тестовій групі.

# JsonSchema.tasks.type
source: Defines whether the task is run as a process or as a command inside a shell.
uk: Визначає, чи завдання виконується як процес або як команда всередині оболонки.

# JsonSchema.tasks.label
source: The task's user interface label
uk: Мітка інтерфейсу користувача із завданням

# JsonSchema.version
source: The config's version number.
uk: Номер версії конфігурації.

# JsonSchema.tasks.identifier
source: A user defined identifier to reference the task in launch.json or a dependsOn clause.
uk: Визначений користувачем код для посилання на завданні launch.json або пропозицію, залежить.

# JsonSchema.tasks.taskLabel
source: The task's label
uk: Мітки завдання

# JsonSchema.tasks.taskName
source: The task's name
uk: Назва завдання

# JsonSchema.tasks.taskName.deprecated
source: The task's name property is deprecated. Use the label property instead.
uk: Властивості назви завдання застаріли. Використовуйте властивість мітки.

# JsonSchema.tasks.background
source: Whether the executed task is kept alive and is running in the background.
uk: Незалежно від того, виконуване завдання зберігається живим і працює у фоновому режимі.

# JsonSchema.tasks.promptOnClose
source: Whether the user is prompted when VS Code closes with a running task.
uk: Користувачеві буде запропоновано, коли VS Code закривається із запущеною завдання.

# JsonSchema.tasks.matchers
source: The problem matcher(s) to use. Can either be a string or a problem matcher definition or an array of strings and problem matchers.
uk: Аналізатор проблем(и), щоб використовувати. Може бути або рядком, або визначенням сумісності проблем, або масивом рядків та проблемних параметрів.

# JsonSchema.customizations.customizes.type
source: The task type to customize
uk: Тип завдання для налаштування

# JsonSchema.tasks.customize.deprecated
source: The customize property is deprecated. See the 1.14 release notes on how to migrate to the new task customization approach
uk: Властивість налаштувань є застарілою. Побачити 1.14 нотатки про те, як перейти на новий підхід налаштування завдань

# JsonSchema.tasks.showOputput.deprecated
source: The property showOutput is deprecated. Use the reveal property inside the presentation property instead. See also the 1.14 release notes.
uk: showOutput властивість є застарілою. Замість властивості презентації використовуйте властивість reveal. Див. Також примітки до випуску 1.14.

# JsonSchema.tasks.echoCommand.deprecated
source: The property echoCommand is deprecated. Use the echo property inside the presentation property instead. See also the 1.14 release notes.
uk: echoCommand властивість є застарілою. Замість цього використовуйте властивість echo всередині властивості презентація. См. також у 1.14 версії.

# JsonSchema.tasks.suppressTaskName.deprecated
source: The property suppressTaskName is deprecated. Inline the command with its arguments into the task instead. See also the 1.14 release notes.
uk: suppressTaskName властивість є застарілою. Вбудовані команди з аргументами у завдань. См. також у 1.14 версії.
