Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_welcome(uk).xlf
Languages: uk

# walkThrough.editor.label
source: Interactive Playground
uk: Інтерактивний Майданчик

source: Help
uk: Допоможіть

source: Interactive Playground
uk: Інтерактивний Майданчик

# workbenchConfigurationTitle
source: Workbench
uk: Робоче місце

# workbench.startupEditor.none
source: Start without an editor.
uk: Почати без редактора.

# workbench.startupEditor.welcomePage
source: Open the Welcome page (default).
uk: Відкрити сторінку привітання (за замовчуванням).

# workbench.startupEditor.newUntitledFile
source: Open a new untitled file.
uk: Відкрийте новий файл без назви.

# workbench.startupEditor
source: Controls which editor is shown at startup, if none is restored from the previous session. Select 'none' to start without an editor, 'welcomePage' to open the Welcome page (default), 'newUntitledFile' to open a new untitled file (only opening an empty workspace).
uk: Управління в якому редакторі відображається при запуску, якщо не відновиться від попередньої сесії. Виберіть ні, щоб почати без редактора, 'welcomePage', щоб відкрити екран привітання (за замовчуванням), 'newUntitledFile', щоб відкрити новий файл без назви (тільки відкриваючи порожній простір).

# welcomeOverlay.explorer
source: File explorer
uk: Провідник

# welcomeOverlay.search
source: Search across files
uk: Пошук по файлах

# welcomeOverlay.git
source: Source code management
uk: Управління вихідним кодом

# welcomeOverlay.debug
source: Launch and debug
uk: Запуск і налагодження

# welcomeOverlay.extensions
source: Manage extensions
uk: Управління додатками

# welcomeOverlay.problems
source: View errors and warnings
uk: Переглянути помилки та попередження

# welcomeOverlay.commandPalette
source: Find and run all commands
uk: Знайти і виконувати всі команди

# welcomeOverlay
source: User Interface Overview
uk: Огляд інтерфейсу користувача

# hideWelcomeOverlay
source: Hide Interface Overview
uk: Приховати Огляд Інтерфейсу

# walkThrough.unboundCommand
source: unbound
uk: незв'язаний

# walkThrough.gitNotFound
source: It looks like Git is not installed on your system.
uk: Схоже, що git не встановлений на вашій системі.

# walkThrough.embeddedEditorBackground
source: Background color for the embedded editors on the Interactive Playground.
uk: Колір фону для вбудованих редакторів на інтерактивній майданчику.

# editorWalkThrough.arrowUp
source: Scroll Up (Line)
uk: Прокрутка Вгору (Лінія)

# editorWalkThrough.arrowDown
source: Scroll Down (Line)
uk: Прокрутіть Вниз (Лінія)

# editorWalkThrough.pageUp
source: Scroll Up (Page)
uk: Прокручування вгору (сторінки)

# editorWalkThrough.pageDown
source: Scroll Down (Page)
uk: Прокручування вниз (сторінки)

# editorWalkThrough.title
source: Interactive Playground
uk: Інтерактивний Майданчик

# editorWalkThrough
source: Interactive Playground
uk: Інтерактивний Майданчик

# welcomePage
source: Welcome
uk: Ласкаво просимо

# welcomePage.python
source: Python
uk: Пітон

# welcomePage.showAzureExtensions
source: Show Azure extensions
uk: Показати Azure додатки

# welcomePage.docker
source: Docker
uk: Докер

# welcomePage.atom
source: Atom
uk: Атом

# welcomePage.extensionPackAlreadyInstalled
source: Support for {0} is already installed.
uk: Підтримка для {0} уже інстальована.

# welcomePage.willReloadAfterInstallingExtensionPack
source: The window will reload after installing additional support for {0}.
uk: Вікно буде перезавантажити після установки додатковою підтримкою для {0}.

# welcomePage.installingExtensionPack
source: Installing additional support for {0}...
uk: Встановлення додаткових підтримок для {0}...

# welcomePage.extensionPackNotFound
source: Support for {0} with id {1} could not be found.
uk: Підтримка для {0} з кодом {1} не може бути знайдена.

# welcomePage.keymapAlreadyInstalled
source: The {0} keyboard shortcuts are already installed.
uk: Сполучення клавіш {0} уже інстальовано.

# welcomePage.willReloadAfterInstallingKeymap
source: The window will reload after installing the {0} keyboard shortcuts.
uk: Вікно буде перезавантажено після установки {0} сполучення клавіш.

# welcomePage.installingKeymap
source: Installing the {0} keyboard shortcuts...
uk: Установка {0} гарячі клавіші...

# welcomePage.keymapNotFound
source: The {0} keyboard shortcuts with id {1} could not be found.
uk: Сполучення клавіш {0} з ідентифікатором {1} не знайдено.

# welcome.title
source: Welcome
uk: Ласкаво просимо

# welcomePage.openFolderWithPath
source: Open folder {0} with path {1}
uk: Відкрити папку {0} за шляхом {1}

# welcomePage.installKeymap
source: Install {0} keymap
uk: Встановіть {0} розкладку

# welcomePage.installExtensionPack
source: Install additional support for {0}
uk: Встановити додаткову підтримку для {0}

# welcomePage.installedKeymap
source: {0} keymap is already installed
uk: {0} розкладку вже встановлено

# welcomePage.installedExtensionPack
source: {0} support is already installed
uk: {0} підтримка вже встановлена

source: OK
uk: Гаразд

source: Details
uk: Деталі

source: Cancel
uk: Скасувати

# welcomePage.buttonBackground
source: Background color for the buttons on the Welcome page.
uk: Колір фону для кнопок на сторінці привітання.

# welcomePage.buttonHoverBackground
source: Hover background color for the buttons on the Welcome page.
uk: Колір фону при наведенні для кнопок на сторінці привітання.

# welcomePage.editingEvolved
source: Editing evolved
uk: Редагування розвивалися

# welcomePage.start
source: Start
uk: Почати

# welcomePage.newFile
source: New file
uk: Новий файл

# welcomePage.openFolder
source: Open folder...
uk: Відкрити папку...

# welcomePage.addWorkspaceFolder
source: Add workspace folder...
uk: Додати папку робочої області...

# welcomePage.recent
source: Recent
uk: Останні

# welcomePage.moreRecent
source: More...
uk: Більше...

# welcomePage.noRecentFolders
source: No recent folders
uk: Немає останніх папок

# welcomePage.help
source: Help
uk: Допоможіть

# welcomePage.keybindingsCheatsheet
source: Printable keyboard cheatsheet
uk: Шпаргалка по комбінаціям клавіш

# welcomePage.introductoryVideos
source: Introductory videos
uk: Вступне відео

# welcomePage.tipsAndTricks
source: Tips and Tricks
uk: Поради та хитрості

# welcomePage.productDocumentation
source: Product documentation
uk: Документації по продукту

# welcomePage.gitHubRepository
source: GitHub repository
uk: Репозиторій GitHub

# welcomePage.showOnStartup
source: Show welcome page on startup
uk: Показати сторінку вітання при запуску

# welcomePage.customize
source: Customize
uk: Настроїти

# welcomePage.installExtensionPacks
source: Tools and languages
uk: Інструменти та мови

# welcomePage.installExtensionPacksDescription
source: Install support for {0} and {1}
uk: Встановити підтримки для {0} та {1}

# welcomePage.moreExtensions
source: more
uk: ще

# welcomePage.installKeymapDescription
source: Install keyboard shortcuts
uk: Встановіть сполучення клавіш

# welcomePage.installKeymapExtension
source: Install the keyboard shortcuts of {0} and {1}
uk: Встановити комбінації клавіш від {0} та {1}

# welcomePage.others
source: others
uk: інші

# welcomePage.colorTheme
source: Color theme
uk: Колір теми

# welcomePage.colorThemeDescription
source: Make the editor and your code look the way you love
uk: Зробити редактор і ваш код виглядати так, як ви любите

# welcomePage.learn
source: Learn
uk: Дізнатися

# welcomePage.showCommands
source: Find and run all commands
uk: Знайти і виконувати всі команди

# welcomePage.showCommandsDescription
source: Rapidly access and search commands from the Command Palette ({0})
uk: Швидкого доступу до команд і пошуку з командної панелі ({0})

# welcomePage.interfaceOverview
source: Interface overview
uk: Огляд інтерфейсу

# welcomePage.interfaceOverviewDescription
source: Get a visual overlay highlighting the major components of the UI
uk: Отримати візуальне накладення виділення основних компонентів інтерфейсу

# welcomePage.interactivePlayground
source: Interactive playground
uk: Інтерактивний майданчик

# welcomePage.interactivePlaygroundDescription
source: Try essential editor features out in a short walkthrough
uk: Спробувати найважливіші функцій редактора в кожному ролику
