Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_extensions(uk).xlf
Languages: uk

# extensionsCommands
source: Manage Extensions
uk: Управління додатками

# galleryExtensionsCommands
source: Install Gallery Extensions
uk: Встановити додаток Галереї

source: Extension
uk: Додаток

# runtimeExtension
source: Running Extensions
uk: Запуск додатків

source: Extensions
uk: Додатки

source: View
uk: Вид

source: Developer
uk: Розробник

# extensionsConfigurationTitle
source: Extensions
uk: Додатки

# extensionsAutoUpdate
source: Automatically update extensions
uk: Автоматичне оновлення додатків

# extensionsIgnoreRecommendations
source: If set to true, the notifications for extension recommendations will stop showing up.
uk: Якщо встановлено значення True, повідомлення рекомендації для додатку перестануть з'являтися.

# manage
source: Press Enter to manage your extensions.
uk: Натисніть клавішу Enter, щоб керувати вашими додатками.

# notfound
source: Extension '{0}' not found in the Marketplace.
uk: додаток '{0}' не знайдений на ринку.

# install
source: Press Enter to install '{0}' from the Marketplace.
uk: Натисніть клавішу enter, щоб встановити '{0}' з ринку.

# searchFor
source: Press Enter to search for '{0}' in the Marketplace.
uk: Натисніть клавішу Enter для пошуку '{0}' на ринку.

# noExtensionsToInstall
source: Type an extension name
uk: Введіть назву додатку

source: Marketplace
uk: Ринок

# installedExtensions
source: Installed
uk: Установлено

# searchInstalledExtensions
source: Installed
uk: Установлено

# recommendedExtensions
source: Recommended
uk: Рекомендовані

# otherRecommendedExtensions
source: Other Recommendations
uk: Інші Рекомендації

# workspaceRecommendedExtensions
source: Workspace Recommendations
uk: Рекомендації Робочої Області

# searchExtensions
source: Search Extensions in Marketplace
uk: Пошук додатку на ринку

# sort by installs
source: Sort By: Install Count
uk: Сортувати по: відліку встановлення

source: Sort By: Rating
uk: Сортувати по: рейтингу

source: Sort By: Name
uk: Сортувати по: Назві

# suggestProxyError
source: Marketplace returned 'ECONNREFUSED'. Please check the 'http.proxy' setting.
uk: Ринок повернув 'ECONNREFUSED'. Будь ласка, перевірте налаштування 'http.proxy'.

# outdatedExtensions
source: {0} Outdated Extensions
uk: {0} Застарілі додатки

# fileBasedRecommendation
source: This extension is recommended based on the files you recently opened.
uk: Цей додаток рекомендується на основі файлів, які ви нещодавно відкривали.

# workspaceRecommendation
source: This extension is recommended by users of the current workspace.
uk: Цей додаток рекомендований користувачам поточної робочої області.

# exeBasedRecommendation
source: This extension is recommended because you have {0} installed.
uk: Цей додаток рекомендується, тому що у вас встановлено {0}.

# reallyRecommended2
source: The '{0}' extension is recommended for this file type.
uk: Додаток '{0}' рекомендується для цього типу файлів.

# reallyRecommendedExtensionPack
source: The '{0}' extension pack is recommended for this file type.
uk: "{0}" пакет додатку рекомендується для даного типу файлів.

source: Show Recommendations
uk: Показати Рекомендації

source: Install
uk: Установіть

# neverShowAgain
source: Don't show again
uk: Більше не показувати

source: Close
uk: Закрити

# workspaceRecommended
source: This workspace has extension recommendations.
uk: Ця робоча область має рекомендації додатку.

source: Install All
uk: Встановити Всі

# ignoreExtensionRecommendations
source: Do you want to ignore all extension recommendations?
uk: Ви хочете, щоб ігнорувалися всі рекомендації додатку?

# ignoreAll
source: Yes, Ignore All
uk: Так, ігнорувати все

source: No
uk: Ні

source: Cancel
uk: Скасувати

# enableDependeciesConfirmation
source: Enabling '{0}' also enable its dependencies. Would you like to continue?
uk: Включення '{0}' і включити його залежності. Ви хотіли б продовжити?

# enable
source: Yes
uk: Так

# doNotEnable
source: No
uk: Ні

# disableDependeciesConfirmation
source: Would you like to disable '{0}' only or its dependencies also?
uk: Ви дійсно хочете лише вимкнути '{0}' або таклж його залежності?

# disableOnly
source: Only
uk: Тільки

# disableAll
source: All
uk: Всі

# singleDependentError
source: Cannot disable extension '{0}'. Extension '{1}' depends on this.
uk: Не можу вимкнути додаток '{0}'. Додатки '{1}' залежить від цього.

# twoDependentsError
source: Cannot disable extension '{0}'. Extensions '{1}' and '{2}' depend on this.
uk: Не можу вимкнути додаток '{0}'. Длдатки '{1}' і '{2}' залежать від цього.

# multipleDependentsError
source: Cannot disable extension '{0}'. Extensions '{1}', '{2}' and others depend on this.
uk: Не можу вимкнути додаток '{0}'. додатки '{1}', '{2}' та інші залежать від цього.

# installConfirmation
source: Would you like to install the '{0}' extension?
uk: Ви б хотіли встановити додаток '{0}'?

source: Open Extensions Folder
uk: Відкрийте папку з додатками

# installVSIX
source: Install from VSIX...
uk: Установка із VSIX...

source: Install from VSIX
uk: Встановити з VSIX

# installButton
source: &&Install
uk: &&Установити

# InstallVSIXAction.success
source: Successfully installed the extension. Restart to enable it.
uk: Успішно встановлений додаток. Перезавантажте, щоб включити його.

# InstallVSIXAction.reloadNow
source: Reload Now
uk: Перезавантажити зараз

# extensionsInputName
source: Extension: {0}
uk: Додаток: {0}

# installAction
source: Install
uk: Установіть

source: Installing
uk: Установка

# uninstallAction
source: Uninstall
uk: Видалити

source: Uninstalling
uk: Видалення

# updateAction
source: Update
uk: Оновлення

# updateTo
source: Update to {0}
uk: Оновлення для {0}

# ManageExtensionAction.uninstallingTooltip
source: Uninstalling
uk: Видалення

# enableForWorkspaceAction
source: Enable (Workspace)
uk: Увімкнути (робоча область)

# enableGloballyAction
source: Enable
uk: Включити

# enableAction
source: Enable
uk: Включити

# disableForWorkspaceAction
source: Disable (Workspace)
uk: Вимкнути (робоча область)

# disableGloballyAction
source: Disable
uk: Вимкнути

# disableAction
source: Disable
uk: Вимкнути

source: Check for Updates
uk: Перевірити наявність оновлень

# enableAutoUpdate
source: Enable Auto Updating Extensions
uk: Увімкнути автоматичне оновлення додатків

# disableAutoUpdate
source: Disable Auto Updating Extensions
uk: Вимкнути автоматичне оновлення додатків

# updateAll
source: Update All Extensions
uk: Оновити всі додатки

# reloadAction
source: Reload
uk: Перезавантажити

# postUpdateTooltip
source: Reload to update
uk: Перезавантаження для оновлення

# postUpdateMessage
source: Reload this window to activate the updated extension '{0}'?
uk: Перезавантаження це вікно, щоб активувати нові додатки '{0}'?

# postEnableTooltip
source: Reload to activate
uk: Перезавантажити для активації

# postEnableMessage
source: Reload this window to activate the extension '{0}'?
uk: Перезавантаження це вікно, щоб активувати додаток '{0}'?

# postDisableTooltip
source: Reload to deactivate
uk: Перезавантажити щоб виключити

# postDisableMessage
source: Reload this window to deactivate the extension '{0}'?
uk: Перезавантажте це вікно, щоб вимкнути додаток '{0}'?

# postUninstallTooltip
source: Reload to deactivate
uk: Перезавантажити щоб виключити

# postUninstallMessage
source: Reload this window to deactivate the uninstalled extension '{0}'?
uk: Перезавантажити це вікно, щоб деактивувати видалений додаток '{0}'?

# toggleExtensionsViewlet
source: Show Extensions
uk: Показати додатки

source: Install Extensions
uk: Встановити додатки

source: Show Enabled Extensions
uk: Показати ввімкнені додатки

source: Show Installed Extensions
uk: Показати встановлені додатки

source: Show Disabled Extensions
uk: Показати виключені додатки

source: Clear Extensions Input
uk: Очистити додатки вводу

source: Show Outdated Extensions
uk: Показати застарілі додатки

source: Show Popular Extensions
uk: Показати Популярні додатки

source: Show Recommended Extensions
uk: Показати рекомендовані додатки

# installWorkspaceRecommendedExtensions
source: Install All Workspace Recommended Extensions
uk: Інсталюйте всі додатки рекомендовані робочою областю

# allExtensionsInstalled
source: All extensions recommended for this workspace have already been installed
uk: Всі додатки, рекомендовані для даної робочої області вже встановлено

source: Install Recommended Extension
uk: Встановлення рекомендованих додатків

# extensionInstalled
source: The recommended extension has already been installed
uk: Рекомендований додаток вже встановлено

# showRecommendedKeymapExtensionsShort
source: Keymaps
uk: Розкладки

# showLanguageExtensionsShort
source: Language Extensions
uk: Розширення Мови

# showAzureExtensionsShort
source: Azure Extensions
uk: додатки Azure

# OpenExtensionsFile.failed
source: Unable to create 'extensions.json' file inside the '.vscode' folder ({0}).
uk: Не вдалося створити файл 'extensions.json' в папці '.vscode' ({0}).

# configureWorkspaceRecommendedExtensions
source: Configure Recommended Extensions (Workspace)
uk: Налаштувати рекомендовані додатки (Робочого Простору)

# configureWorkspaceFolderRecommendedExtensions
source: Configure Recommended Extensions (Workspace Folder)
uk: Налаштувати рекомендовані додатки (Папка Робочої Області)

source: Built-in
uk: Вбудований

# disableAll
source: Disable All Installed Extensions
uk: Вимкнути усі встановлені додатки

# disableAllWorkspace
source: Disable All Installed Extensions for this Workspace
uk: Вимкнути усі встановлені додатки для цієї робочої області

# enableAll
source: Enable All Installed Extensions
uk: Увімкнути всі встановлені додатки

# enableAllWorkspace
source: Enable All Installed Extensions for this Workspace
uk: Включити всі встановлені розширення для цієї робочої області

# extensionButtonProminentBackground
source: Button background color for actions extension that stand out (e.g. install button).
uk: Колір фону кнопки для розширення дій, що виділяються (наприклад, кнопки установки).

# extensionButtonProminentForeground
source: Button foreground color for actions extension that stand out (e.g. install button).
uk: Колір переднього плану кнопки для розширення дій, що виділяються (наприклад, кнопку установки).

# extensionButtonProminentHoverBackground
source: Button background hover color for actions extension that stand out (e.g. install button).
uk: Колір, при наведенні, фону кнопки для розширення дій, що виділяються (наприклад, кнопки установки).

# app.extensions.json.title
source: Extensions
uk: Додатки

# app.extensions.json.recommendations
source: List of extensions recommendations. The identifier of an extension is always '${publisher}.${name}'. For example: 'vscode.csharp'.
uk: Список рекомендацій додатків. Ідентифікатор розширення завжди '${publisher}.${name}'. Наприклад: 'vscode.csharp'.

# app.extension.identifier.errorMessage
source: Expected format '${publisher}.${name}'. Example: 'vscode.csharp'.
uk: Очікуваний формат ' ${publisher}. ${name}'. Наприклад: 'vscode.csharp'.

# disableOtherKeymapsConfirmation
source: Disable other keymaps ({0}) to avoid conflicts between keybindings?
uk: Виключити інші розкладки ({0}) щоб уникнути конфліктів між призначеннями клавіш?

source: Yes
uk: Так

# betterMergeDisabled
source: The Better Merge extension is now built-in, the installed extension was disabled and can be uninstalled.
uk: Кращий додаток злиття тепер вбудований, встановлені додатки були виключені та можуть бути видалені.

source: Uninstall
uk: Видалити

source: Later
uk: Пізніше

# name
source: Extension name
uk: додаток ім'я

# extension id
source: Extension identifier
uk: Ідентифікатор додатку

source: Preview
uk: Попередній перегляд

# publisher
source: Publisher name
uk: Ім'я видавця

source: Install count
uk: Встановити лічильник

source: Rating
uk: Рейтинг

source: Repository
uk: Репозиторій

source: License
uk: Ліцензія

source: Details
uk: Деталі

source: Contributions
uk: Внески

source: Changelog
uk: Список змін

source: Dependencies
uk: Залежності

# noReadme
source: No README available.
uk: Немає доступних README.

# noChangelog
source: No Changelog available.
uk: Немає доступних змін.

source: No Contributions
uk: Ніяких Внесків

source: No Dependencies
uk: Немає залежностей

# settings
source: Settings ({0})
uk: Налаштування ({0})

# setting name
source: Name
uk: Назва

source: Description
uk: Опис

source: Default
uk: За замовчуванням

# debuggers
source: Debuggers ({0})
uk: Відладчики ({0})

# debugger name
source: Name
uk: Назва

# debugger type
source: Type
uk: Тип

# views
source: Views ({0})
uk: Вид ({0})

# view id
source: ID
uk: Ідентифікатор

# view name
source: Name
uk: Назва

# view location
source: Where
uk: Де

# colorThemes
source: Color Themes ({0})
uk: Колірні Теми ({0})

# iconThemes
source: Icon Themes ({0})
uk: Теми Значків ({0})

# colors
source: Colors ({0})
uk: Кольори ({0})

# colorId
source: Id
uk: Ідентифікатор

# defaultDark
source: Dark Default
uk: Темна за замовчуванням

# defaultLight
source: Light Default
uk: Світла за замовчуванням

# defaultHC
source: High Contrast Default
uk: Високо-контрастна за замовчуванням

# JSON Validation
source: JSON Validation ({0})
uk: Перевірки json ({0})

# commands
source: Commands ({0})
uk: Команди ({0})

# command name
source: Name
uk: Назва

source: Keyboard Shortcuts
uk: Сполучення Клавіш

source: Menu Contexts
uk: Контексти Меню

# languages
source: Languages ({0})
uk: Мови ({0})

# language id
source: ID
uk: Ідентифікатор

# language name
source: Name
uk: Назва

source: File Extensions
uk: Розширення Файлів

source: Grammar
uk: Граматика

source: Snippets
uk: Фрагменти (сніпети)

# starActivation
source: Activated on start-up
uk: Активована при запуску

# workspaceContainsGlobActivation
source: Activated because a file matching {0} exists in your workspace
uk: Активоване, оскільки існує відповідний файл {0} у вашому робочому просторі

# workspaceContainsFileActivation
source: Activated because file {0} exists in your workspace
uk: Активувати, так як файл {0} існує у вашій робочої області

# languageActivation
source: Activated because you opened a {0} file
uk: Активувати, так як ви відкрили файл {0}

# workspaceGenericActivation
source: Activated on {0}
uk: Активоване на {0}

# errors
source: {0} uncaught errors
uk: {0} невідомі халепи

# extensionsInputName
source: Running Extensions
uk: Запуск додатків

# showRuntimeExtensions
source: Show Running Extensions
uk: Показати запущені додатки

# reportExtensionIssue
source: Report Issue
uk: Звіт

# extensionHostProfileStart
source: Start Extension Host Profile
uk: Почати розширення хосту профілю

# extensionHostProfileStop
source: Stop Extension Host Profile
uk: Припинити розширення хосту профілю

source: Save Extension Host Profile
uk: Зберегти розширення хосту профілю

# selectAndStartDebug
source: Click to stop profiling.
uk: Натисніть, щоб зупинити профілювання.

source: No extensions found.
uk: Додатки не знайдено.

source: Error
uk: Халепа

source: Unknown Dependency:
uk: Невідома залежність:

# ratedByUsers
source: Rated by {0} users
uk: За оцінкою {0} користувачів

# ratedBySingleUser
source: Rated by 1 user
uk: За оцінкою 1 користувача
