Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_cli(uk).xlf
Languages: uk

# install
source: Install '{0}' command in PATH
uk: Встановіть '{0}' команду в PATH

# not available
source: This command is not available
uk: Ця команда недоступна

# successIn
source: Shell command '{0}' successfully installed in PATH.
uk: Команда Shell '{0}' успішно встановлена в PATH.

# warnEscalation
source: Code will now prompt with 'osascript' for Administrator privileges to install the shell command.
uk: Код запитує з "osascript" для привілегій адміністратора щоб установити Shell команду.

source: OK
uk: Гаразд

# cantCreateBinFolder
source: Unable to create '/usr/local/bin'.
uk: Не вдається створити '/usr/local/bin'.

# cancel2
source: Cancel
uk: Скасувати

source: Aborted
uk: Перервано

# uninstall
source: Uninstall '{0}' command from PATH
uk: Видалити '{0}' команду з PATH

# successFrom
source: Shell command '{0}' successfully uninstalled from PATH.
uk: Команди Shell '{0}' успішно видалена з PATH.

source: Shell Command
uk: Командна Оболонка Shell
