Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_markers(uk).xlf
Languages: uk

# totalProblems
source: Total {0} Problems
uk: Загально {0} проблем

# filteredProblems
source: Showing {0} of {1} Problems
uk: Показ {0} з {1} проблем

# copyMarker
source: Copy
uk: Скопіювати

# copyMarkerMessage
source: Copy Message
uk: Копія повідомлення

# label
source: Problems
uk: Проблеми

# tooltip.1
source: 1 problem in this file
uk: 1 проблема в цьому файлі

# tooltip.N
source: {0} problems in this file
uk: {0} проблем в цьому файлі

# markers.showOnFile
source: Show Errors & Warnings on files and folder.
uk: Показати помилки і попередження у файлах і папках.

# viewCategory
source: View
uk: Вид

# problems.view.toggle.label
source: Toggle Problems
uk: Переключити проблеми

# problems.view.focus.label
source: Focus Problems
uk: Проблеми фокус

# problems.panel.configuration.title
source: Problems View
uk: Вид Проблеми

# problems.panel.configuration.autoreveal
source: Controls if Problems view should automatically reveal files when opening them
uk: Контролює чи перегляд проблем повинен автоматично виявити у файлах при їх відкритті

# markers.panel.title.problems
source: Problems
uk: Проблеми

# markers.panel.aria.label.problems.tree
source: Problems grouped by files
uk: Проблеми згруповані за файлів

# markers.panel.no.problems.build
source: No problems have been detected in the workspace so far.
uk: Ніяких проблем виявлено в робочій області до цих пір.

# markers.panel.no.problems.filters
source: No results found with provided filter criteria
uk: Не знайдено результатів з критеріями фільтра

# markers.panel.action.filter
source: Filter Problems
uk: Фільтр проблем

# markers.panel.filter.placeholder
source: Filter by type or text
uk: Фільтр по типу або тексту

# markers.panel.filter.errors
source: errors
uk: помилки

# markers.panel.filter.warnings
source: warnings
uk: попередження

# markers.panel.filter.infos
source: infos
uk: інформація

# markers.panel.single.error.label
source: 1 Error
uk: 1 помилка

# markers.panel.multiple.errors.label
source: {0} Errors
uk: {0} помилки

# markers.panel.single.warning.label
source: 1 Warning
uk: 1 попередження

# markers.panel.multiple.warnings.label
source: {0} Warnings
uk: {0} попередження

# markers.panel.single.info.label
source: 1 Info
uk: 1 інформація

# markers.panel.multiple.infos.label
source: {0} Infos
uk: {0} інформаційні повідомлення

# markers.panel.single.unknown.label
source: 1 Unknown
uk: 1 невідомо

# markers.panel.multiple.unknowns.label
source: {0} Unknowns
uk: {0} невідомі

# problems.tree.aria.label.resource
source: {0} with {1} problems
uk: {0} з {1} проблем

# problems.tree.aria.label.error.marker
source: Error generated by {0}: {1} at line {2} and character {3}
uk: Помилка, породжена {0}: {1} в лінії {2} символ {3}

# problems.tree.aria.label.error.marker.nosource
source: Error: {0} at line {1} and character {2}
uk: Помилка: {0} на лінії {1} символ {2}

# problems.tree.aria.label.warning.marker
source: Warning generated by {0}: {1} at line {2} and character {3}
uk: Попередження генерується {0}: {1} в лінії {2} символ {3}

# problems.tree.aria.label.warning.marker.nosource
source: Warning: {0} at line {1} and character {2}
uk: Попередження: {0} в лінії {1} символ {2}

# problems.tree.aria.label.info.marker
source: Info generated by {0}: {1} at line {2} and character {3}
uk: Інформація генерується {0}: {1} в лінії {2} символ {3}

# problems.tree.aria.label.info.marker.nosource
source: Info: {0} at line {1} and character {2}
uk: Інформація: {0} на лінії {1} символ {2}

# problems.tree.aria.label.marker
source: Problem generated by {0}: {1} at line {2} and character {3}
uk: Проблема, породжена {0}: {1} в лінії {2} символ {3}

# problems.tree.aria.label.marker.nosource
source: Problem: {0} at line {1} and character {2}
uk: Проблема: {0} на лінії {1} символ (2)

# errors.warnings.show.label
source: Show Errors and Warnings
uk: Показати помилки і попередження
