Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_services_extensions(uk).xlf
Languages: uk

# devTools
source: Developer Tools
uk: Інструменти розробника

# restart
source: Restart Extension Host
uk: Перезавантажте Розширення Вузла

# extensionHostProcess.crash
source: Extension host terminated unexpectedly.
uk: Розширення вузла було несподівано перервано.

# extensionHostProcess.unresponsiveCrash
source: Extension host terminated because it was not responsive.
uk: Розширення вузла припиняється, тому що вона не реагувала.

# overwritingExtension
source: Overwriting extension {0} with {1}.
uk: Перезапису розширення {0} з {1}.

# extensionUnderDevelopment
source: Loading development extension at {0}
uk: Завантаження розширення розвитку на {0}

# extensionCache.invalid
source: Extensions have been modified on disk. Please reload the window.
uk: Розширення було змінено на диску. Будь ласка, перезавантажте вікно.

# jsonParseFail
source: Failed to parse {0}: {1}.
uk: Не вдалося проаналізувати {0}: {1}.

# fileReadFail
source: Cannot read file {0}: {1}.
uk: Не вдалося прочитати файл {0}: {1}.

# jsonsParseFail
source: Failed to parse {0} or {1}: {2}.
uk: Не вдалося проаналізувати {0} або {1}: {2}.

# missingNLSKey
source: Couldn't find message for key {0}.
uk: Не можу знайти повідомлення для ключа {0}.

# extensionHostProcess.startupFailDebug
source: Extension host did not start in 10 seconds, it might be stopped on the first line and needs a debugger to continue.
uk: Розширення хоста не стартувало за 10 секунд, може бути зупинені на першій лінії і потребує налагоджувача щоб продовжити.

# extensionHostProcess.startupFail
source: Extension host did not start in 10 seconds, that might be a problem.
uk: Якщо розширення хосту не розпочнеться за 10 секунд, це може стати проблемою.

# extensionHostProcess.error
source: Error from the extension host: {0}
uk: Помилка з розширенням хосту: {0}

# message
source: $(zap) Profiling Extension Host...
uk: $(zap) профілювання розширення вузла...
