Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_views(uk).xlf
Languages: uk

# requirearray
source: views must be an array
uk: вид повинен бути масивом

# requirestring
source: property `{0}` is mandatory and must be of type `string`
uk: властивість "{0}" є обов'язковою і має належати до типу "рядок"

# optstring
source: property `{0}` can be omitted or must be of type `string`
uk: властивість "{0}" може бути пропущена або має належати до типу "рядок"

# vscode.extension.contributes.view.id
source: Identifier of the view. Use this to register a data provider through `vscode.window.registerTreeDataProviderForView` API. Also to trigger activating your extension by registering `onView:${id}` event to `activationEvents`.
uk: Ідентифікатор подання. Використовуйте це, щоб зареєструвати постачальника даних через `vscode.window.registerTreeDataProviderForView` API-інтерфейс. Також для активації продовження реєстрації `onView:${id}` до `activationEvents`.

# vscode.extension.contributes.view.name
source: The human-readable name of the view. Will be shown
uk: зручне для читання ім'я виду. Буде показано

# vscode.extension.contributes.view.when
source: Condition which must be true to show this view
uk: Умова, яка має бути істинним, щоб показати цей вид

# vscode.extension.contributes.views
source: Contributes views to the editor
uk: Вносить подання до редакції

# views.explorer
source: Explorer View
uk: Вид Провідника

# views.debug
source: Debug View
uk: Вид Налагодження

# locationId.invalid
source: `{0}` is not a valid view location
uk: `{0}` не є допустимим розташуванням виду

# viewToolbarAriaLabel
source: {0} actions
uk: {0} дії

# hideView
source: Hide from Side Bar
uk: Приховати від бічної панелі
