Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_services_keybinding(uk).xlf
Languages: uk

# nonempty
source: expected non-empty value.
uk: очікується, що непорожнє значення.

# requirestring
source: property `{0}` is mandatory and must be of type `string`
uk: властивість "{0}" є обов'язковою і має належати до типу "рядок"

# optstring
source: property `{0}` can be omitted or must be of type `string`
uk: властивість "{0}" може бути пропущена або має належати до типу "рядок"

# vscode.extension.contributes.keybindings.command
source: Identifier of the command to run when keybinding is triggered.
uk: Ідентифікатор команди, коли прив'язка клавіш спрацьовує.

# vscode.extension.contributes.keybindings.key
source: Key or key sequence (separate keys with plus-sign and sequences with space, e.g Ctrl+O and Ctrl+L L for a chord).
uk: Клавішу або послідовність клавіш (окремі клавіші зі знаками "плюс" і послідовності з простором, наприклад сполучення клавіш Ctrl+О Ctrl+L і L для акорду).

# vscode.extension.contributes.keybindings.mac
source: Mac specific key or key sequence.
uk: Певний Mac клавішу або послідовність клавіш.

# vscode.extension.contributes.keybindings.linux
source: Linux specific key or key sequence.
uk: Певну клавішу Linux або послідовність клавіш.

# vscode.extension.contributes.keybindings.win
source: Windows specific key or key sequence.
uk: Конкретна Windows клавіша або послідовність клавіш.

# vscode.extension.contributes.keybindings.when
source: Condition when the key is active.
uk: Стан, коли клавіша активна.

# vscode.extension.contributes.keybindings
source: Contributes keybindings.
uk: Сприяє формуванню комбінацій клавіш.

# invalid.keybindings
source: Invalid `contributes.{0}`: {1}
uk: Невірний `contributes.{0}`: {1}

# unboundCommands
source: Here are other available commands:
uk: Ось інші доступні команди:

# keybindings.json.title
source: Keybindings configuration
uk: Конфігурація гарячих клавіш

# keybindings.json.key
source: Key or key sequence (separated by space)
uk: Клавішу або послідовність клавіш (розділених пробілом)

# keybindings.json.command
source: Name of the command to execute
uk: Ім'я команди, яка виконується

# keybindings.json.when
source: Condition when the key is active.
uk: Стан, коли клавіша активна.

# keybindings.json.args
source: Arguments to pass to the command to execute.
uk: Аргументи, які потрібно передати, щоб виконати команду.

# keyboardConfigurationTitle
source: Keyboard
uk: Клавіатура

# dispatch
source: Controls the dispatching logic for key presses to use either `code` (recommended) or `keyCode`.
uk: Контролює диспетчерської логіку для натискання клавіш для використання у будь-якому 'код' (рекомендовано) або `keyCode`.

# touchbar.enabled
source: Enables the macOS touchbar buttons on the keyboard if available.
uk: Включає в MacOS сенсорної панелі кнопок на клавіатурі, якщо вони доступні.

# errorKeybindingsFileDirty
source: Unable to write because the file is dirty. Please save the **Keybindings** file and try again.
uk: Не вдалося виконати записування, оскільки файл має зміни. Будь ласка, зберігайте у **Keybindings** файл і повторіть спробу.

# parseErrors
source: Unable to write keybindings. Please open **Keybindings file** to correct errors/warnings in the file and try again.
uk: Не вдалося записати до комбінацій клавіш. Будь ласка, відкрийте **Keybindings file** щоб виправляти помилки/попередження у файлі та повторіть спробу.

# errorInvalidConfiguration
source: Unable to write keybindings. **Keybindings file** has an object which is not of type Array. Please open the file to clean up and try again.
uk: Не вдалося записати до комбінацій клавіш. **Keybindings file** є об'єкт, який не є типом Array. Будь ласка, відкрийте файл, щоб очистити і знову спробувати.

# emptyKeybindingsHeader
source: Place your key bindings in this file to overwrite the defaults
uk: Розмістити клавішні прив'язки в цьому файлі перезаписати параметри за замовчуванням
