Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_scm(uk).xlf
Languages: uk

# toggleGitViewlet
source: Show Git
uk: Показати Git

source: Source Control
uk: Керування джерелом

# toggleSCMViewlet
source: Show SCM
uk: Показати SCM

source: View
uk: Вид

# alwaysShowProviders
source: Whether to always show the Source Control Provider section.
uk: Чи завжди відображати розділ постачальнику керування вихідним кодом.

# diffDecorations
source: Controls diff decorations in the editor.
uk: Контролює декоратори Змін в редакторі.

# inputCounter
source: Controls when to display the input counter.
uk: Контролює, коли слід відображати лічильника вводу.

# scm providers
source: Source Control Providers
uk: Постачальники Контроллю Джерела

# hideRepository
source: Hide
uk: Сховати

# commitMessageInfo
source: {0} characters in current line
uk: {0} символів у поточному рядку

# commitMessageCountdown
source: {0} characters left in current line
uk: залишилося {0} символів у поточному рядку

# commitMessageWarning
source: {0} characters over {1} in current line
uk: {0} символів над {1} у поточному рядку

source: Install Additional SCM Providers...
uk: Установка додаткових постачальників SCM...

# no open repo
source: There are no active source control providers.
uk: Немає активних постачальників управління вихідним кодом.

# changes
source: {0} of {1} changes
uk: {0} з {1} змін

# change
source: {0} of {1} change
uk: {0} з {1} зміни

source: Show Previous Change
uk: Показати попередню зміну

source: Show Next Change
uk: Показати наступну зміну

# editorGutterModifiedBackground
source: Editor gutter background color for lines that are modified.
uk: Колір фону редактору виділення для рядків, які були змінені.

# editorGutterAddedBackground
source: Editor gutter background color for lines that are added.
uk: Колір фону редактору виділення для рядків, які додаються.

# editorGutterDeletedBackground
source: Editor gutter background color for lines that are deleted.
uk: Колір фону редактору виділення для рядків, які будуть видалені.

# overviewRulerModifiedForeground
source: Overview ruler marker color for modified content.
uk: Огляд лінійки кольорових маркерів для зміненого Вмісту.

# overviewRulerAddedForeground
source: Overview ruler marker color for added content.
uk: Огляд лінійки кольорових маркерів для доданого Контенту.

# overviewRulerDeletedForeground
source: Overview ruler marker color for deleted content.
uk: Огляд лінійки кольорових маркерів для видаленого Контенту.

# scmPendingChangesBadge
source: {0} pending changes
uk: {0} очікують зміни
