Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_terminal(uk).xlf
Languages: uk

# quickOpen.terminal
source: Show All Opened Terminals
uk: Показати Всі Відкриті Термінали

source: Terminal
uk: Термінал

# terminalIntegratedConfigurationTitle
source: Integrated Terminal
uk: Інтегрований Термінал

# terminal.integrated.shell.linux
source: The path of the shell that the terminal uses on Linux.
uk: Шлях до оболонки shell, що термінал використовує на Linux.

# terminal.integrated.shellArgs.linux
source: The command line arguments to use when on the Linux terminal.
uk: Аргументи командного рядка для використання на терміналі Linux.

# terminal.integrated.shell.osx
source: The path of the shell that the terminal uses on OS X.
uk: Шлях до оболонки, що термінал використовує на ОС Х.

# terminal.integrated.shellArgs.osx
source: The command line arguments to use when on the OS X terminal.
uk: Аргументи командного рядка для використання, коли на терміналі ОС х.

# terminal.integrated.shell.windows
source: The path of the shell that the terminal uses on Windows. When using shells shipped with Windows (cmd, PowerShell or Bash on Ubuntu).
uk: Шлях до оболонки, що термінал використовує на Windows. При використанні оболонок, що постачаються з Windows (cmd, PowerShell або bash на убунту).

# terminal.integrated.shellArgs.windows
source: The command line arguments to use when on the Windows terminal.
uk: Аргументи командного рядка для використання на терміналі Windows.

# terminal.integrated.rightClickCopyPaste
source: When set, this will prevent the context menu from appearing when right clicking within the terminal, instead it will copy when there is a selection and paste when there is no selection.
uk: При наборі, це дозволить запобігти появі контекстного меню, при клікові правою клавішою миші в межах терміналу, натомість буде копіювати, коли щось вибрано та вставляти коли нічого не вибрано.

# terminal.integrated.copyOnSelection
source: When set, text selected in the terminal will be copied to the clipboard.
uk: Коли встановлено, текст, вибраний у терміналі, буде скопійований у буфер обміну.

# terminal.integrated.fontFamily
source: Controls the font family of the terminal, this defaults to editor.fontFamily's value.
uk: Контролює сімейство шрифтів терміналу, це за замовчуванням значення в editor.fontFamily.

# terminal.integrated.fontSize
source: Controls the font size in pixels of the terminal.
uk: Контролює розмір шрифту в пікселях терміналу.

# terminal.integrated.lineHeight
source: Controls the line height of the terminal, this number is multiplied by the terminal font size to get the actual line-height in pixels.
uk: Регулювання висоти рядка терміналу, це число, помножене на розмір шрифту терміналу, щоб отримати фактичну висоту рядка в пікселях.

# terminal.integrated.enableBold
source: Whether to enable bold text within the terminal, note that this requires support from the terminal shell.
uk: Чи слід включити жирний текст в терміналі, зверніть увагу, що це вимагає підтримки з боку терміналу оболонки.

# terminal.integrated.cursorBlinking
source: Controls whether the terminal cursor blinks.
uk: Контролює, чи курсор терміналe блимає.

# terminal.integrated.cursorStyle
source: Controls the style of terminal cursor.
uk: Контролює стиль курсора терміналу.

# terminal.integrated.scrollback
source: Controls the maximum amount of lines the terminal keeps in its buffer.
uk: Контролює максимальну кількість рядків, що тримає термінал у своєму буфері.

# terminal.integrated.setLocaleVariables
source: Controls whether locale variables are set at startup of the terminal, this defaults to true on OS X, false on other platforms.
uk: Визначає змінні локалі встановлені при запуску терміналу, за замовчуванням це правда, на ОС х, false на інших платформах.

# terminal.integrated.cwd
source: An explicit start path where the terminal will be launched, this is used as the current working directory (cwd) for the shell process. This may be particularly useful in workspace settings if the root directory is not a convenient cwd.
uk: Явний шлях запуску, де буде запущений термінал, він використовується як поточний робочий каталог (cwd) для процесу оболонки. Це може бути особливо корисним у налаштуваннях робочого середовища, якщо кореневий каталог не є зручним cwd.

# terminal.integrated.confirmOnExit
source: Whether to confirm on exit if there are active terminal sessions.
uk: Потрібно підтвердження при виході при наявності активних сеансів.

# terminal.integrated.commandsToSkipShell
source: A set of command IDs whose keybindings will not be sent to the shell and instead always be handled by Code. This allows the use of keybindings that would normally be consumed by the shell to act the same as when the terminal is not focused, for example ctrl+p to launch Quick Open.
uk: Набір кодів команд, чиї клавіші не буде відправлено до оболонки і замість того, щоб завжди бути обробленими Code-м. Це дозволяє використовувати комбінації клавіш, які зазвичай споживаються оболонкою, діють так само, як коли термінал поза фокусом, наприклад, Ctrl+p, щоб запустити швидке відкриття.

# terminal.integrated.env.osx
source: Object with environment variables that will be added to the VS Code process to be used by the terminal on OS X
uk: Об'єкт із змінними оточення, яке буде додане до порівняння код процесу, який буде використовуватися термінал на ОС х

# terminal.integrated.env.linux
source: Object with environment variables that will be added to the VS Code process to be used by the terminal on Linux
uk: Об'єкт із змінними оточення, яке буде додане до процесу the VS Code, який буде використовувати термінал в Linux

# terminal.integrated.env.windows
source: Object with environment variables that will be added to the VS Code process to be used by the terminal on Windows
uk: Об'єкт із змінними оточення, яке буде додане до процесу the VS Code, який буде використовувати термінал на Windows

# terminalCategory
source: Terminal
uk: Термінал

# viewCategory
source: View
uk: Вид

# termEntryAriaLabel
source: {0}, terminal picker
uk: {0}, термінал палітра

# termCreateEntryAriaLabel
source: {0}, create new terminal
uk: {0}, створіть новий термінал

# workbench.action.terminal.newplus
source: $(plus) Create New Integrated Terminal
uk: $(plus) створити новий Інтегрований термінал

source: No terminals matching
uk: Немає відповідності терміналів

# noTerminalsFound
source: No terminals open
uk: Немає відкритих терміналів

source: Copy
uk: Скопіювати

source: Paste
uk: Вставити

source: Select All
uk: Вибрати Все

source: Clear
uk: Очистити

# terminal.background
source: The background color of the terminal, this allows coloring the terminal differently to the panel.
uk: Колір тла терміналу, це дозволяє пофарбувати термінал по-різному на панелі.

# terminal.foreground
source: The foreground color of the terminal.
uk: Колір переднього плану терміналу.

# terminalCursor.foreground
source: The foreground color of the terminal cursor.
uk: Колір переднього плану терміналу курсора.

# terminalCursor.background
source: The background color of the terminal cursor. Allows customizing the color of a character overlapped by a block cursor.
uk: Колір фону курсору терміналу. Дозволяє налаштовувати колір символу, накладеного курсором блоку.

# terminal.selectionBackground
source: The selection background color of the terminal.
uk: Вибір кольору фону терміналу.

# terminal.ansiColor
source: '{0}' ANSI color in the terminal.
uk: '{0}' АНСІ кольору в терміналі.

# terminal.integrated.chooseWindowsShellInfo
source: You can change the default terminal shell by selecting the customize button.
uk: Ви можете змінити термінал оболонки за замовчуванням, натиснувши кнопку налаштувати.

source: Customize
uk: Настроїти

source: Cancel
uk: Скасувати

# never again
source: OK, Never Show Again
uk: ОК, ніколи не показувати знову

# terminal.integrated.chooseWindowsShell
source: Select your preferred terminal shell, you can change this later in your settings
uk: Виберіть потрібний термінал Шелл, ви можете змінити його пізніше в налаштуваннях

# terminalService.terminalCloseConfirmationSingular
source: There is an active terminal session, do you want to kill it?
uk: Є активний сеанс терміналу, ви хочете вбити його?

# terminalService.terminalCloseConfirmationPlural
source: There are {0} active terminal sessions, do you want to kill them?
uk: Є {0} активних термінальних сесій, ви хочете вбити їх?

# workbench.action.terminal.toggleTerminal
source: Toggle Integrated Terminal
uk: Перемкнути Інтегрований Термінал

# workbench.action.terminal.kill
source: Kill the Active Terminal Instance
uk: Вбити активний екземпляр терміналу

# workbench.action.terminal.kill.short
source: Kill Terminal
uk: Вбити термінал

# workbench.action.terminal.quickKill
source: Kill Terminal Instance
uk: Вбити терміналу екземпляр

# workbench.action.terminal.copySelection
source: Copy Selection
uk: Копіювати виділений фрагмент

# workbench.action.terminal.selectAll
source: Select All
uk: Вибрати Все

# workbench.action.terminal.deleteWordLeft
source: Delete Word Left
uk: Видалити слово зліва

# workbench.action.terminal.deleteWordRight
source: Delete Word Right
uk: Видалити слово справа

# workbench.action.terminal.new
source: Create New Integrated Terminal
uk: Створення Нового Інтегрованого Терміналу

# workbench.action.terminal.new.short
source: New Terminal
uk: Новий Термінал

# workbench.action.terminal.newWorkspacePlaceholder
source: Select current working directory for new terminal
uk: Виберіть поточний робочий каталог для нового терміналу

# workbench.action.terminal.newInActiveWorkspace
source: Create New Integrated Terminal (In Active Workspace)
uk: Створити Новий Інтегрований Термінал (В Активній Області)

# workbench.action.terminal.focus
source: Focus Terminal
uk: Фокус На Термінал

# workbench.action.terminal.focusNext
source: Focus Next Terminal
uk: Фокус Наступному терміналу

# workbench.action.terminal.focusPrevious
source: Focus Previous Terminal
uk: Фокус попередньому терміналу

# workbench.action.terminal.paste
source: Paste into Active Terminal
uk: Вставити в активний термінал

# workbench.action.terminal.DefaultShell
source: Select Default Shell
uk: Вибір за замовчуванням оболонки

# workbench.action.terminal.runSelectedText
source: Run Selected Text In Active Terminal
uk: Запустити виділений текст в активному терміналі

# workbench.action.terminal.runActiveFile
source: Run Active File In Active Terminal
uk: Запустити активний файл у активному терміналі

# workbench.action.terminal.runActiveFile.noFile
source: Only files on disk can be run in the terminal
uk: У терміналі можна запускати лише файли на диску

# workbench.action.terminal.switchTerminalInstance
source: Switch Terminal Instance
uk: Перемикач Примірнику Терміналу

# workbench.action.terminal.scrollDown
source: Scroll Down (Line)
uk: Прокрутіть Вниз (Лінія)

# workbench.action.terminal.scrollDownPage
source: Scroll Down (Page)
uk: Прокручування вниз (сторінки)

# workbench.action.terminal.scrollToBottom
source: Scroll to Bottom
uk: Прокручування вниз

# workbench.action.terminal.scrollUp
source: Scroll Up (Line)
uk: Прокрутка Вгору (Лінія)

# workbench.action.terminal.scrollUpPage
source: Scroll Up (Page)
uk: Прокручування вгору (сторінки)

# workbench.action.terminal.scrollToTop
source: Scroll to Top
uk: Нагору

# workbench.action.terminal.clear
source: Clear
uk: Очистити

# workbench.action.terminal.allowWorkspaceShell
source: Allow Workspace Shell Configuration
uk: Дозволити конфігурацію Shell робочої області

# workbench.action.terminal.disallowWorkspaceShell
source: Disallow Workspace Shell Configuration
uk: Заборона конфігурації оболонки робочого середовища

# workbench.action.terminal.rename
source: Rename
uk: Перейменувати

# workbench.action.terminal.rename.prompt
source: Enter terminal name
uk: Введіть ім'я терміналу

# workbench.action.terminal.focusFindWidget
source: Focus Find Widget
uk: Фокус віджет пошуку

# workbench.action.terminal.hideFindWidget
source: Hide Find Widget
uk: Приховати віджет пошуку

# nextTerminalFindTerm
source: Show Next Find Term
uk: Показати наступний знайдений фрагмент

# previousTerminalFindTerm
source: Show Previous Find Term
uk: Показати попередній знайдений фрагмент

# quickOpenTerm
source: Switch Active Terminal
uk: Перемикач активного термінал

# terminal.integrated.allowWorkspaceShell
source: Do you allow {0} (defined as a workspace setting) to be launched in the terminal?
uk: Ви дозволяєте {0} (визначається як налаштування робочої області), щоб бути запущений в терміналі?

source: Allow
uk: Дозволити

source: Disallow
uk: Заборонити

# terminal.integrated.copySelection.noSelection
source: The terminal has no selection to copy
uk: Термінал не має вибору для копіювання

# terminal.integrated.exitedWithCode
source: The terminal process terminated with exit code: {0}
uk: Процес терміналу завершено з кодом завершення: {0}

# terminal.integrated.waitOnExit
source: Press any key to close the terminal
uk: Натисніть будь-яку клавішу, щоб закрити термінал.

# terminal.integrated.launchFailed
source: The terminal process command `{0}{1}` failed to launch (exit code: {2})
uk: Команда Process термінал `{0}{1}` не вдалося запустити (код виходу: {2})

# terminalLinkHandler.followLinkAlt
source: Alt + click to follow link
uk: Alt + клацніть, щоб перейти за посиланням

# terminalLinkHandler.followLinkCmd
source: Cmd + click to follow link
uk: Cmd + клацніть, щоб перейти за посиланням

# terminalLinkHandler.followLinkCtrl
source: Ctrl + click to follow link
uk: Ctlr + клацніть, щоб перейти за посиланням
