Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_search(uk).xlf
Languages: uk

# showTriggerActions
source: Go to Symbol in Workspace...
uk: Перейти на символ в робочій області...

# name
source: Search
uk: Пошук

source: Search
uk: Пошук

# showSearchViewlet
source: Show Search
uk: Показати Пошук

source: View
uk: Вид

source: Find in Files
uk: Знайти в файлах

# openAnythingHandlerDescription
source: Go to File
uk: Перейти до файлу

# openSymbolDescriptionNormal
source: Go to Symbol in Workspace
uk: Перейти на символ в робочій області

# searchOutputChannelTitle
source: Search
uk: Пошук

# searchConfigurationTitle
source: Search
uk: Пошук

# exclude
source: Configure glob patterns for excluding files and folders in searches. Inherits all glob patterns from the files.exclude setting.
uk: Налаштувати glob шаблони для виключення файлів і папок з пошуку. Успадковує всі glob-шаблони з параметру files.exclude.

# exclude.boolean
source: The glob pattern to match file paths against. Set to true or false to enable or disable the pattern.
uk: Шаблон glob, щоб відповідати шляху до файлу. Встановити як true або false, щоб увімкнути або вимкнути шаблон.

# exclude.when
source: Additional check on the siblings of a matching file. Use $(basename) as variable for the matching file name.
uk: Додаткова перевірка на братів відповідного файлу. Використовувати $(basename) в якості змінної для зіставлення імен файлів.

# useRipgrep
source: Controls whether to use ripgrep in text and file search
uk: Контролює, чи буде використовуватись ripgrep в пошуку по тексті й файлів

# useIgnoreFiles
source: Controls whether to use .gitignore and .ignore files when searching for files.
uk: Контролює, чи використовувати .gitignore і .ignore файлів, при пошуку файлів.

# search.quickOpen.includeSymbols
source: Configure to include results from a global symbol search in the file results for Quick Open.
uk: Налаштуйте, щоб включити результати пошуку глобального символу у результати пошуку файлів для швидкого відкриття.

# search.followSymlinks
source: Controls whether to follow symlinks while searching.
uk: Контролює, чи стежити за посиланнями під час пошуку.

# moreSearch
source: Toggle Search Details
uk: On/off подробиці пошуку

# searchScope.includes
source: files to include
uk: файли для включення

# label.includes
source: Search Include Patterns
uk: Пошук включених шаблонів

# searchScope.excludes
source: files to exclude
uk: файли, що виключені

# label.excludes
source: Search Exclude Patterns
uk: Виключити шаблони пошуку

# replaceAll.confirmation.title
source: Replace All
uk: Замінити всі

# replaceAll.confirm.button
source: &&Replace
uk: &&Замінити

# replaceAll.occurrence.file.message
source: Replaced {0} occurrence across {1} file with '{2}'.
uk: Замінити {0} появи через {1} файл з '{2}'.

# removeAll.occurrence.file.message
source: Replaced {0} occurrence across {1} file'.
uk: Замінено {0} появи через файл {1}'.

# replaceAll.occurrence.files.message
source: Replaced {0} occurrence across {1} files with '{2}'.
uk: Замінено {0} появи через {1} файли з '{2}'.

# removeAll.occurrence.files.message
source: Replaced {0} occurrence across {1} files.
uk: Замінено {0} появи через {1} файли.

# replaceAll.occurrences.file.message
source: Replaced {0} occurrences across {1} file with '{2}'.
uk: Замінено {0} появи через {1} файл з '{2}'.

# removeAll.occurrences.file.message
source: Replaced {0} occurrences across {1} file'.
uk: Замінено {0} появи через файл {1}'.

# replaceAll.occurrences.files.message
source: Replaced {0} occurrences across {1} files with '{2}'.
uk: Замінено {0} появи через {1} файли з '{2}'.

# removeAll.occurrences.files.message
source: Replaced {0} occurrences across {1} files.
uk: Замінено {0} появи через {1} файли.

# removeAll.occurrence.file.confirmation.message
source: Replace {0} occurrence across {1} file with '{2}'?
uk: Замінити {0} появу через {1} файл з '{2}'?

# replaceAll.occurrence.file.confirmation.message
source: Replace {0} occurrence across {1} file'?
uk: Замінити {0} появу через {1} файл?

# removeAll.occurrence.files.confirmation.message
source: Replace {0} occurrence across {1} files with '{2}'?
uk: Замінити {0} появу через {1} файли з '{2}'?

# replaceAll.occurrence.files.confirmation.message
source: Replace {0} occurrence across {1} files?
uk: Замінити {0} появу через {1} файли?

# removeAll.occurrences.file.confirmation.message
source: Replace {0} occurrences across {1} file with '{2}'?
uk: Замінити {0} появи через {1} файл з '{2}'?

# replaceAll.occurrences.file.confirmation.message
source: Replace {0} occurrences across {1} file'?
uk: Замінити {0} появи через {1} файл?

# removeAll.occurrences.files.confirmation.message
source: Replace {0} occurrences across {1} files with '{2}'?
uk: Замінено {0} появи через {1} файли з '{2}'?

# replaceAll.occurrences.files.confirmation.message
source: Replace {0} occurrences across {1} files?
uk: Замінити {0} появи через {1} файли?

# treeAriaLabel
source: Search Results
uk: Результати пошуку

# searchPathNotFoundError
source: Search path not found: {0}
uk: Шлях пошуку не знайдено: {0}

# searchMaxResultsWarning
source: The result set only contains a subset of all matches. Please be more specific in your search to narrow down the results.
uk: Набір результатів містить лише підмножину всіх відповідностей. Будь ласка, будьте більш конкретними в ваших пошуках, щоб звузити результати.

# searchCanceled
source: Search was canceled before any results could be found -
uk: Пошук було скасовано перш ніж знайдено якісь результати -

# noResultsIncludesExcludes
source: No results found in '{0}' excluding '{1}' -
uk: Нічого не знайдено в "{0}" виключення "{1}" -

# noResultsIncludes
source: No results found in '{0}' -
uk: Не знайдено результатів щодо '{0}' -

# noResultsExcludes
source: No results found excluding '{0}' -
uk: Не знайдено результатів, крім '{0}' -

# noResultsFound
source: No results found. Review your settings for configured exclusions and ignore files -
uk: Результатів не знайдено. Перегляньте свої налаштування для налаштованих виключень та ігнорованих файлів -

# rerunSearch.message
source: Search again
uk: Пошук знову

# rerunSearchInAll.message
source: Search again in all files
uk: Повторити пошук в усіх файлах

# openSettings.message
source: Open Settings
uk: Відкрити Налаштування

# openSettings.learnMore
source: Learn More
uk: Дізнатися Більше

# ariaSearchResultsStatus
source: Search returned {0} results in {1} files
uk: Пошук повернуто {0} результатів в {1} файлах

# search.file.result
source: {0} result in {1} file
uk: {0} результат у {1} файлі

# search.files.result
source: {0} result in {1} files
uk: {0} результат у {1} файлах

# search.file.results
source: {0} results in {1} file
uk: {0} результатів в {1} файлі

# search.files.results
source: {0} results in {1} files
uk: {0} результатів в {1} файлах

# searchWithoutFolder
source: You have not yet opened a folder. Only open files are currently searched -
uk: Ви ще не відкрила папку. В даний час пошук здійснюється тільки відкриті файли -

source: Open Folder
uk: Відкрийте Папку

# fileAndTypeResults
source: file and symbol results
uk: файл і символ результати

source: file results
uk: результати файлу

# nextSearchIncludePattern
source: Show Next Search Include Pattern
uk: Показати наступний пошук шаблону включення

# previousSearchIncludePattern
source: Show Previous Search Include Pattern
uk: Показати попередній пошук шаблону включення

# nextSearchExcludePattern
source: Show Next Search Exclude Pattern
uk: Показати наступний пошук шаблону виключення

# previousSearchExcludePattern
source: Show Previous Search Exclude Pattern
uk: Показати попередній пошук шаблону виключення

# nextSearchTerm
source: Show Next Search Term
uk: Показати наступний знайдений фрагмент

# previousSearchTerm
source: Show Previous Search Term
uk: Показати попередній знайдений фрагмент

source: Replace in Files
uk: Заміна у файлах

# RefreshAction.label
source: Refresh
uk: Оновити

# CollapseDeepestExpandedLevelAction.label
source: Collapse All
uk: Згорнути Всі

# ClearSearchResultsAction.label
source: Clear
uk: Очистити

# FocusNextSearchResult.label
source: Focus Next Search Result
uk: Фокус на наступний результат пошуку

# FocusPreviousSearchResult.label
source: Focus Previous Search Result
uk: Фокус на попередній результат пошуку

# RemoveAction.label
source: Dismiss
uk: Відхилити

# file.replaceAll.label
source: Replace All
uk: Замінити всі

# match.replace.label
source: Replace
uk: Замінити

# search.action.replaceAll.disabled.label
source: Replace All (Submit Search to Enable)
uk: Замінити всі (прийняти пошук, щоб включити)

# search.action.replaceAll.enabled.label
source: Replace All
uk: Замінити всі

# search.replace.toggle.button.title
source: Toggle Replace
uk: On/off Заміна

# label.Search
source: Search: Type Search Term and press Enter to search or Escape to cancel
uk: Пошук: введіть пошуковий запит і натисніть Enter для пошуку або Escape, щоб скасувати

# search.placeHolder
source: Search
uk: Пошук

# label.Replace
source: Replace: Type replace term and press Enter to preview or Escape to cancel
uk: Замінити: введіть фрагмент заміни і натисніть клавішу Enter для перегляду або ESC, щоб скасувати

# search.replace.placeHolder
source: Replace
uk: Замінити

# regexp.validationFailure
source: Expression matches everything
uk: Вираз відповідає всім

# regexp.backreferenceValidationFailure
source: Backreferences are not supported
uk: Зворотні посилання не підтримуються

# entryAriaLabel
source: {0}, symbols picker
uk: {0}, палітра символів

# symbols
source: symbol results
uk: результати пошуку символа

source: No symbols matching
uk: Немає відповідних символів

# noSymbolsWithoutInput
source: Type to search for symbols
uk: Введіть текст для пошуку символів

source: Find in Folder...
uk: Знайти в папці...

source: Find in Workspace...
uk: Знайти в робочій області...

# search.noWorkspaceWithName
source: No folder in workspace with name: {0}
uk: Немає у робочій області папки з ім'ям: {0}

# searchFolderMatch.other.label
source: Other files
uk: Інші файли

# searchFileMatches
source: {0} files found
uk: {0} знайдених файлів

# searchFileMatch
source: {0} file found
uk: файл {0} знайдено

# searchMatches
source: {0} matches found
uk: знайдених збігів {0}

# searchMatch
source: {0} match found
uk: збіг {0} знайдено

# folderMatchAriaLabel
source: {0} matches in folder root {1}, Search result
uk: {0} відповідає в кореневій папці {1}, результат пошуку

# fileMatchAriaLabel
source: {0} matches in file {1} of folder {2}, Search result
uk: {0} збіг в файлі {1} папки {2}, результат пошуку

# replacePreviewResultAria
source: Replace term {0} with {1} at column position {2} in line with text {3}
uk: Замінити фрагмент {0} з {1} в стовпці позиції {2} відповідно до тексту {3}

# searchResultAria
source: Found term {0} at column position {1} in line with text {2}
uk: Знайдено термін {0} в колонці позиції {1} відповідно до тексту (2)

# defaultLabel
source: input
uk: введіть

# useExcludesAndIgnoreFilesDescription
source: Use Exclude Settings and Ignore Files
uk: Використовуйте параметри виключення та ігноруйте файли

# entryAriaLabel
source: {0}, file picker
uk: {0}, вибору файла

source: search results
uk: результати пошуку

# fileReplaceChanges
source: {0} ↔ {1} (Replace Preview)
uk: {0} {1} ↔ (замінити попередній перегляд)
