Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_tasks(uk).xlf
Languages: uk

# JsonSchema.tasks.isBuildCommand.deprecated
source: The property isBuildCommand is deprecated. Use the group property instead. See also the 1.14 release notes.
uk: isBuildCommand властивість є застарілою. Замість цього використовуйте властивість групи. См. також у 1.14 версії.

# JsonSchema.tasks.isTestCommand.deprecated
source: The property isTestCommand is deprecated. Use the group property instead. See also the 1.14 release notes.
uk: isTestCommand властивість є застарілою. Замість цього використовуйте властивість групи. См. також у 1.14 версії.

# JsonSchema.tasks.taskSelector.deprecated
source: The property taskSelector is deprecated. Inline the command with its arguments into the task instead. See also the 1.14 release notes.
uk: taskSelector властивість є застарілою. Вбудовані команди з аргументами у завдань. См. також у 1.14 версії.

# JsonSchema.windows
source: Windows specific command configuration
uk: Конкретна командна конфігурація Windows

# JsonSchema.mac
source: Mac specific command configuration
uk: Mac конкретної команди конфігурації

# JsonSchema.linux
source: Linux specific command configuration
uk: Linux конкретної команди конфігурації

# JsonSchema.version
source: The config's version number
uk: Номер версії конфігурації

# JsonSchema._runner
source: The runner has graduated. Use the offical runner property
uk: Запускач закінчив. Використовуйте властивість офісного запускника

# JsonSchema.runner
source: Defines whether the task is executed as a process and the output is shown in the output window or inside the terminal.
uk: Визначає, чи завдання виконується як процес і вивід відображається у вікні виводу або всередині терміналу.

# TaskSystemDetector.noGulpTasks
source: Running gulp --tasks-simple didn't list any tasks. Did you run npm install?
uk: Запуск gulp --tasks-simple не вказувати будь-які завдання. Ви запустити npm установку?

# TaskSystemDetector.noJakeTasks
source: Running jake --tasks didn't list any tasks. Did you run npm install?
uk: Запуск Jake --tasks не вказувати будь-які завдання. Ви запустити npm установку?

# TaskSystemDetector.noGulpProgram
source: Gulp is not installed on your system. Run npm install -g gulp to install it.
uk: Gulp не встановлений у вашій системі. Запустіть npm i -g gulp, щоб встановити його.

# TaskSystemDetector.noJakeProgram
source: Jake is not installed on your system. Run npm install -g jake to install it.
uk: Jake не встановлений у вашій системі. Запустіть npm i -g jake, щоб встановити його.

# TaskSystemDetector.noGruntProgram
source: Grunt is not installed on your system. Run npm install -g grunt to install it.
uk: Grunt не встановлений у вашій системі. Запустіть npm i -g grunt, щоб встановити його.

# TaskSystemDetector.noProgram
source: Program {0} was not found. Message is {1}
uk: Програма {0} не знайдена. Повідомлення {1}

# TaskSystemDetector.buildTaskDetected
source: Build task named '{0}' detected.
uk: Завдання побудови з ім'ям '{0}' виявлене.

# TaskSystemDetector.testTaskDetected
source: Test task named '{0}' detected.
uk: Тестове завдання з ім'ям '{0}' виявлене.

# TaskDefinition.description
source: The actual task type
uk: Фактичний Тип завдання

# TaskDefinition.properties
source: Additional properties of the task type
uk: Додаткові властивості Тип завдання

# TaskTypeConfiguration.noType
source: The task type configuration is missing the required 'taskType' property
uk: У конфігурації типу завдання відсутній необхідний параметр "tasktype"

# TaskDefinitionExtPoint
source: Contributes task kinds
uk: Сприяє видам завдань

# JsonSchema.options
source: Additional command options
uk: Додаткові параметри команди

# JsonSchema.options.cwd
source: The current working directory of the executed program or script. If omitted Code's current workspace root is used.
uk: Поточний робочий каталог виконуваної програми або скрипта. Якщо опущено, використовується корінь поточного робочого середовища коду.

# JsonSchema.options.env
source: The environment of the executed program or shell. If omitted the parent process' environment is used.
uk: Середовище виконуваної програми або оболонки. Якщо опущено, використовується середовище батьківського процесу.

# JsonSchema.shellConfiguration
source: Configures the shell to be used.
uk: Налаштовує оболонку для використання.

# JsonSchema.shell.executable
source: The shell to be used.
uk: Оболонка повинна бути використана.

# JsonSchema.shell.args
source: The shell arguments.
uk: Аргументи оболонки.

# JsonSchema.command
source: The command to be executed. Can be an external program or a shell command.
uk: Команда повинна бути виконана. Може бути зовнішня програма або команда оболонки.

# JsonSchema.tasks.args
source: Arguments passed to the command when this task is invoked.
uk: Аргументи передаються команді, коли це завдання викликається.

# JsonSchema.tasks.windows
source: Windows specific command configuration
uk: Конкретна командна конфігурація Windows

# JsonSchema.tasks.mac
source: Mac specific command configuration
uk: Mac конкретної команди конфігурації

# JsonSchema.tasks.linux
source: Linux specific command configuration
uk: Linux конкретної команди конфігурації

# JsonSchema.tasks.suppressTaskName
source: Controls whether the task name is added as an argument to the command. If omitted the globally defined value is used.
uk: Контролює, чи ім'я завдання буде додано як аргумент до команди. Якщо не вказано значення глобально визначені використовується.

# JsonSchema.tasks.showOutput
source: Controls whether the output of the running task is shown or not. If omitted the globally defined value is used.
uk: Контролює, чи відображати вивід поточного завдання. Якщо опущено, використовується загальноприйняте значення.

# JsonSchema.echoCommand
source: Controls whether the executed command is echoed to the output. Default is false.
uk: Контролює, чи виконана команда відлунюється на виході. За умовчанням це хибно.

# JsonSchema.tasks.watching.deprecation
source: Deprecated. Use isBackground instead.
uk: Застаріло. Слід використовувати isBackground.

# JsonSchema.tasks.watching
source: Whether the executed task is kept alive and is watching the file system.
uk: Незалежно від того, виконуване завдання зберігається живим і спостерігає за файловою системою.

# JsonSchema.tasks.build
source: Maps this task to Code's default build command.
uk: Помітити це завдання до Code's як команду побудови за замовчуванням.

# JsonSchema.tasks.test
source: Maps this task to Code's default test command.
uk: Помітити це завдання до Code's як тестову команду за замовчуванням.

# JsonSchema.args
source: Additional arguments passed to the command.
uk: Додаткові аргументи пройшли до команди.

# JsonSchema.showOutput
source: Controls whether the output of the running task is shown or not. If omitted 'always' is used.
uk: Визначає, чи буде вихід із запущеної завдання відображатися чи ні. Якщо опустити 'завжди' використовується.

# JsonSchema.watching.deprecation
source: Deprecated. Use isBackground instead.
uk: Застаріло. Слід використовувати isBackground.

# JsonSchema.watching
source: Whether the executed task is kept alive and is watching the file system.
uk: Незалежно від того, виконуване завдання зберігається живим і спостерігає за файловою системою.

# JsonSchema.background
source: Whether the executed task is kept alive and is running in the background.
uk: Незалежно від того, виконуване завдання зберігається живим і працює у фоновому режимі.

# JsonSchema.promptOnClose
source: Whether the user is prompted when VS Code closes with a running background task.
uk: Користувачеві буде запропоновано, коли VS Code закривається із запущеною завдання у фоновому режимі.

# JsonSchema.suppressTaskName
source: Controls whether the task name is added as an argument to the command. Default is false.
uk: Визначає ім'я завдання додається в якості аргументів команди. За замовчуванням-false.

# JsonSchema.taskSelector
source: Prefix to indicate that an argument is task.
uk: Префікс, який вказує на те, що аргумент є завданням.

# JsonSchema.matchers
source: The problem matcher(s) to use. Can either be a string or a problem matcher definition or an array of strings and problem matchers.
uk: Аналізатор проблем(и), щоб використовувати. Може бути або рядком, або визначенням сумісності проблем, або масивом рядків та проблемних параметрів.

# JsonSchema.tasks
source: The task configurations. Usually these are enrichments of task already defined in the external task runner.
uk: Завдання конфігурацій. Зазвичай ці максимуми завдань вже визначені у зовнішніх менеджерах задач.
