Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_services_mode(uk).xlf
Languages: uk

# vscode.extension.contributes.languages
source: Contributes language declarations.
uk: Сприяє мовним деклараціям.

# vscode.extension.contributes.languages.id
source: ID of the language.
uk: Ідентифікатор мови.

# vscode.extension.contributes.languages.aliases
source: Name aliases for the language.
uk: Псевдоніми для мови.

# vscode.extension.contributes.languages.extensions
source: File extensions associated to the language.
uk: Розширення імен файлів зв'язані з мовою.

# vscode.extension.contributes.languages.filenames
source: File names associated to the language.
uk: Імена файлів, пов'язаних з мовою.

# vscode.extension.contributes.languages.filenamePatterns
source: File name glob patterns associated to the language.
uk: Ім'я файлу glob шаблонів, пов'язаних з мовою.

# vscode.extension.contributes.languages.mimetypes
source: Mime types associated to the language.
uk: Типи MIME, які пов'язані з мовою.

# vscode.extension.contributes.languages.firstLine
source: A regular expression matching the first line of a file of the language.
uk: Формальний вираз, що відповідає першому рядку файлу мови.

# vscode.extension.contributes.languages.configuration
source: A relative path to a file containing configuration options for the language.
uk: Відносний шлях до файлу, який містить параметри конфігурації для мови.

# invalid
source: Invalid `contributes.{0}`. Expected an array.
uk: Невірний `contributes.{0}`. Очікується масив.

# invalid.empty
source: Empty value for `contributes.{0}`
uk: Порожнє значення для `contributes.{0}`

# require.id
source: property `{0}` is mandatory and must be of type `string`
uk: властивість "{0}" є обов'язковою і має належати до типу "рядок"

# opt.extensions
source: property `{0}` can be omitted and must be of type `string[]`
uk: властивість "{0}" може бути пропущена і має належати до типу 'рядок[]'

# opt.filenames
source: property `{0}` can be omitted and must be of type `string[]`
uk: властивість "{0}" може бути пропущена і має належати до типу 'рядок[]'

# opt.firstLine
source: property `{0}` can be omitted and must be of type `string`
uk: властивість "{0}" може бути пропущена або має належати до типу "рядок"

# opt.configuration
source: property `{0}` can be omitted and must be of type `string`
uk: властивість "{0}" може бути пропущена або має належати до типу "рядок"

# opt.aliases
source: property `{0}` can be omitted and must be of type `string[]`
uk: властивість "{0}" може бути пропущена і має належати до типу 'рядок[]'

# opt.mimetypes
source: property `{0}` can be omitted and must be of type `string[]`
uk: властивість "{0}" може бути пропущена і має належати до типу 'рядок[]'
