Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_files(uk).xlf
Languages: uk

source: Folders
uk: Папки

# filesCategory
source: File
uk: Файл

source: Reveal in Side Bar
uk: Розкрити в бічній панелі

# acceptLocalChanges
source: Use your changes and overwrite disk contents
uk: Використовуйте свої зміни і переписати вміст диска

# revertLocalChanges
source: Discard your changes and revert to content on disk
uk: Скасувати зміни і повернутися до вмісту диску

# showExplorerViewlet
source: Show Explorer
uk: Показати Провідник

# explore
source: Explorer
uk: Провідник

source: View
uk: Вид

source: Text File Editor
uk: Редактор текстових файлів

source: Binary File Editor
uk: Бінарний редактор файлів

# filesConfigurationTitle
source: Files
uk: Файли

# exclude
source: Configure glob patterns for excluding files and folders. For example, the files explorer decides which files and folders to show or hide based on this setting.
uk: Налаштувати glob-шаблони для виключення файлів і папок. Наприклад, Провідник вирішує, які файли і папки показувати або приховувати в залежності від цього параметра.

# files.exclude.boolean
source: The glob pattern to match file paths against. Set to true or false to enable or disable the pattern.
uk: Шаблон glob, щоб відповідати шляху до файлу. Встановити як true або false, щоб увімкнути або вимкнути шаблон.

# files.exclude.when
source: Additional check on the siblings of a matching file. Use $(basename) as variable for the matching file name.
uk: Додаткова перевірка на братів відповідного файлу. Використовувати $(basename) в якості змінної для зіставлення імен файлів.

# associations
source: Configure file associations to languages (e.g. "*.extension": "html"). These have precedence over the default associations of the languages installed.
uk: Налаштувати асоціації файлів в мовах (наприклад "*.extension": "html"). Вони мають пріоритет над асоціаціями за замовчуванням встановлених мов.

# encoding
source: The default character set encoding to use when reading and writing files. This setting can be configured per language too.
uk: Кодування набору символів за замовчуванням для читання та запису файлів. Цей параметр також можна налаштувати на кожну мову.

# autoGuessEncoding
source: When enabled, will attempt to guess the character set encoding when opening files. This setting can be configured per language too.
uk: Коли цей параметр увімкнено, він спробує вгадати кодування набору символів при відкритті файлів. Цей параметр також можна налаштувати на кожну мову.

# eol
source: The default end of line character. Use \n for LF and \r\n for CRLF.
uk: За замовчуванням символ кінця рядка. Використовувати \n для LF і \r\n для CRLF.

# trimTrailingWhitespace
source: When enabled, will trim trailing whitespace when saving a file.
uk: Якщо цей параметр увімкнено, він буде видаляти пробіл після збереження файлу.

# insertFinalNewline
source: When enabled, insert a final new line at the end of the file when saving it.
uk: Коли цей параметр увімкнено, буде додано новий рядок в кінці файлу під час його збереження.

# trimFinalNewlines
source: When enabled, will trim all new lines after the final new line at the end of the file when saving it.
uk: Якщо цей параметр увімкнено, він буде видаляти пусті рядки в кінці файлу при збереженні.

# files.autoSave.off
source: A dirty file is never automatically saved.
uk: Файл із змінами не зберігається автоматично.

# files.autoSave.afterDelay
source: A dirty file is automatically saved after the configured 'files.autoSaveDelay'.
uk: Файл із змінами зберігається автоматично після встановлення 'files.autoSaveDelay'.

# files.autoSave.onFocusChange
source: A dirty file is automatically saved when the editor loses focus.
uk: Файл із змінами автоматично зберігається, коли редактор втрачає фокус.

# files.autoSave.onWindowChange
source: A dirty file is automatically saved when the window loses focus.
uk: Файл із змінами автоматично зберігається, коли вікно втрачає фокус.

# autoSave
source: Controls auto save of dirty files. Accepted values: '{0}', '{1}', '{2}' (editor loses focus), '{3}' (window loses focus). If set to '{4}', you can configure the delay in 'files.autoSaveDelay'.
uk: Контролює автоматичне збереження файлів із змінами. Допустимі значення: '{0}', '{1}', '{2}' (редактор втрачає фокус), '{3}' (вікно втрачає фокус). Якщо встановлено '{4}', ви можете налаштувати затримку в 'files.autoSaveDelay'.

# autoSaveDelay
source: Controls the delay in ms after which a dirty file is saved automatically. Only applies when 'files.autoSave' is set to '{0}'
uk: Контролює затримку в ms, після чого файл із змінами зберігається автоматично. Застосовується тільки тоді, коли для "files.autoSave" встановлено значення "{0}"

# watcherExclude
source: Configure glob patterns of file paths to exclude from file watching. Patterns must match on absolute paths (i.e. prefix with ** or the full path to match properly). Changing this setting requires a restart. When you experience Code consuming lots of cpu time on startup, you can exclude large folders to reduce the initial load.
uk: Налаштувати glob-шаблони шляхів до файлів, щоб виключити з перегляду файл. Шаблони повинні збігатися на абсолютні шляхи (тобто префікс з ** або повний шлях для правильної відповідності). Зміна цього параметра вимагає перезавантаження. Коли ви відчуваєте що Редактор забирає багато процесорного часу при завантаженні, ви можете виключити великі папки, щоб зменшити початкове навантаження.

# hotExit.off
source: Disable hot exit.
uk: Вимкнути гарячий вихід.

# hotExit.onExit
source: Hot exit will be triggered when the application is closed, that is when the last window is closed on Windows/Linux or when the workbench.action.quit command is triggered (command palette, keybinding, menu). All windows with backups will be restored upon next launch.
uk: Гарячий вихід буде спрацьовувати при закритті програми, тобто при закритті останнього вікна в Windows/Linux або коли workbench.action.quit command спрацьовує (в командній панелі, комбінації клавіш, меню). Всі вікна з резервних копії буде відновлено при наступному запуску.

# hotExit.onExitAndWindowClose
source: Hot exit will be triggered when the application is closed, that is when the last window is closed on Windows/Linux or when the workbench.action.quit command is triggered (command palette, keybinding, menu), and also for any window with a folder opened regardless of whether it's the last window. All windows without folders opened will be restored upon next launch. To restore folder windows as they were before shutdown set "window.restoreWindows" to "all".
uk: Гарячий вихід буде спрацьовувати при закритті програми, тобто при закритті останнього вікна в Windows/Linux або коли workbench.action.quit спрацьовує (палітра команд, комбінація клавіш, меню), а також для будь-якого вікна з відкритої папки, незалежно від того, чи є це останнє вікно. Всі вікна без відкриття папки буде відновлено при наступному запуску. Щоб відновити папку в вікні, так як вона була до вимкнення встановіть "window.restoreWindows" на "all".

# hotExit
source: Controls whether unsaved files are remembered between sessions, allowing the save prompt when exiting the editor to be skipped.
uk: Контролює чи збережені файли запам'ятовуються між сесіями, що дозволяє пропустити запит про збереження, коли виходить редактор.

# useExperimentalFileWatcher
source: Use the new experimental file watcher.
uk: Використовувати новий експериментальний переглядач файлів.

# defaultLanguage
source: The default language mode that is assigned to new files.
uk: Режим мови за замовчуванням який призначено для нових файлів.

# editorConfigurationTitle
source: Editor
uk: Редактор

# formatOnSave
source: Format a file on save. A formatter must be available, the file must not be auto-saved, and editor must not be shutting down.
uk: Формат файлу при збереженні. Формат повинен бути доступним, файл не повинен автоматично зберігатися, а редактор не повинен бути закритий.

# explorerConfigurationTitle
source: File Explorer
uk: Провідник

# openEditorsVisible
source: Number of editors shown in the Open Editors pane. Set it to 0 to hide the pane.
uk: Кількість редакторів, показаних на панелі "Відкриті редактори". Установіть його на 0, щоб сховати панель.

# dynamicHeight
source: Controls if the height of the open editors section should adapt dynamically to the number of elements or not.
uk: Контролює, чи повинна висота секції відкритих редакторів динамічно адаптуватися до кількості елементів.

# autoReveal
source: Controls if the explorer should automatically reveal and select files when opening them.
uk: Контролює, чи повинен провідник автоматично виявляти та вибирати файли під час їх відкриття.

# enableDragAndDrop
source: Controls if the explorer should allow to move files and folders via drag and drop.
uk: Контролює, чи повинен провідник переміщати файли та папки за допомогою перетягування.

# confirmDragAndDrop
source: Controls if the explorer should ask for confirmation to move files and folders via drag and drop.
uk: Контролює, чи повинен провідник запитувати підтвердження для переміщення файлів і папок за допомогою перетягування.

# confirmDelete
source: Controls if the explorer should ask for confirmation when deleting a file via the trash.
uk: Контролює, чи слід провіднику запитувати підтвердження при видаленні файлу через кошик.

# sortOrder.default
source: Files and folders are sorted by their names, in alphabetical order. Folders are displayed before files.
uk: Папки та файли сортуються за їх назвами в алфавітному порядку. Показувати папки перед файлами.

# sortOrder.mixed
source: Files and folders are sorted by their names, in alphabetical order. Files are interwoven with folders.
uk: Папки та файли сортуються за їх назвами в алфавітному порядку. Файли переплітаються з папками.

# sortOrder.filesFirst
source: Files and folders are sorted by their names, in alphabetical order. Files are displayed before folders.
uk: Папки та файли сортуються за їх назвами в алфавітному порядку. Файли показати перш ніж папки.

# sortOrder.type
source: Files and folders are sorted by their extensions, in alphabetical order. Folders are displayed before files.
uk: Папки та файли сортуються за розширенням в алфавітному порядку. Показати папки перед файлами.

# sortOrder.modified
source: Files and folders are sorted by last modified date, in descending order. Folders are displayed before files.
uk: Папки та файли сортуються за датою останньої зміни у порядку убування. Показати папки перед файлами.

# sortOrder
source: Controls sorting order of files and folders in the explorer. In addition to the default sorting, you can set the order to 'mixed' (files and folders sorted combined), 'type' (by file type), 'modified' (by last modified date) or 'filesFirst' (sort files before folders).
uk: Контролює порядок сортування файлів і папок в провіднику. Крім сортування за замовчуванням, ви можете встановити для "змішаних" (папки та файли сортуються в поєднанні), "Тип"(Тип файлу), "модифікована" (за датою останньої зміни) або 'filesFirst' (сортування файлів до папок).

# explorer.decorations.colors
source: Controls if file decorations should use colors.
uk: Контролює, чи повинні прикраси файлу використовувати кольори.

# explorer.decorations.badges
source: Controls if file decorations should use badges.
uk: Контролює, чи повинні прикраси файлу використовувати значки(badges).

# noWorkspace
source: No Folder Opened
uk: Немає відкритих папок

# explorerSection
source: Files Explorer Section
uk: Розділ Провідника

# noWorkspaceHelp
source: You have not yet added a folder to the workspace.
uk: Ви ще не додали папки в робочій області.

source: Add Folder
uk: Додати Папку

# noFolderHelp
source: You have not yet opened a folder.
uk: Ви ще не відкрили папку.

source: Open Folder
uk: Відкрийте Папку

# fileInputAriaLabel
source: Type file name. Press Enter to confirm or Escape to cancel.
uk: Введіть ім'я файлу. Натисніть клавішу Enter для підтвердження або ESC, щоб скасувати.

# filesExplorerViewerAriaLabel
source: {0}, Files Explorer
uk: {0}, Файли В Провіднику

# dropFolders
source: Do you want to add the folders to the workspace?
uk: Додати папки до робочої області?

# dropFolder
source: Do you want to add the folder to the workspace?
uk: Додати папку до робочої області?

source: &&Add Folders
uk: &&Додати Папки

source: &&Add Folder
uk: &&Додати Папку

# confirmMove
source: Are you sure you want to move '{0}'?
uk: Ви впевнені, що хочете перемістити '{0}'?

# doNotAskAgain
source: Do not ask me again
uk: Не питай мене знову

# moveButtonLabel
source: &&Move
uk: &&Перемістити

# confirmOverwriteMessage
source: '{0}' already exists in the destination folder. Do you want to replace it?
uk: '{0} вже існує в папці призначення. Ви хочете замінити його?

# irreversible
source: This action is irreversible!
uk: Ця дія є незворотня!

# replaceButtonLabel
source: &&Replace
uk: &&Замінити

# treeAriaLabel
source: Files Explorer
uk: Провідник

source: Open Editors
uk: Відкрити редактори

# openEditosrSection
source: Open Editors Section
uk: Відкриті редактори розділ

# dirtyCounter
source: {0} unsaved
uk: {0} незбережені

source: Save All
uk: Зберегти Всі

# closeAllUnmodified
source: Close Unmodified
uk: Закрити незміненій

source: Close All
uk: Закрити Всі

source: Compare with Saved
uk: Порівнюємо зі збереженим

source: Close
uk: Закрити

source: Close Others
uk: Закрийте інші

# userGuide
source: Use the actions in the editor tool bar to the right to either **undo** your changes or **overwrite** the content on disk with your changes
uk: Використовуйте дії на панелі інструментів редактора праворуч, щоб ** відмінити ** ваші зміни або ** перезаписати ** вміст на диску з вашими змінами

# overwriteElevated
source: Overwrite as Admin...
uk: Перезапис як адмін...

# saveElevated
source: Retry as Admin...
uk: Повторити як Адмін...

source: Overwrite
uk: Перезаписати

source: Retry
uk: Повторити

source: Discard
uk: Відхилити

# readonlySaveErrorAdmin
source: Failed to save '{0}': File is write protected. Select 'Overwrite as Admin' to retry as administrator.
uk: Не вдалося зберегти '{0}': файл захищений від запису. Виберіть Перезаписати в якості адміністратора, щоб повторити від імені адміністратора.

# readonlySaveError
source: Failed to save '{0}': File is write protected. Select 'Overwrite' to attempt to remove protection.
uk: Не вдалося зберегти '{0}': файл захищений від запису. Виберіть 'Замінити', щоб спробувати зняти захист.

# permissionDeniedSaveError
source: Failed to save '{0}': Insufficient permissions. Select 'Retry as Admin' to retry as administrator.
uk: Не вдалося зберегти '{0}': недостатньо прав. Виберіть "повторити" в якості адміністратора, щоб повторити від імені адміністратора.

# genericSaveError
source: Failed to save '{0}': {1}
uk: Не вдалося зберегти '{0}': {1}

# staleSaveError
source: Failed to save '{0}': The content on disk is newer. Click on **Compare** to compare your version with the one on disk.
uk: Не вдалося зберегти '{0}': зміст на диску новіше. Натисніть на **порівнювати** порівняйте вашу версію з іншою на диску.

# compareChanges
source: Compare
uk: Порівняти

# saveConflictDiffLabel
source: {0} (on disk) ↔ {1} (in {2}) - Resolve save conflict
uk: {0} (На диску) ↔ {1} ({2}) - розв'язати конфлікт збереження

# orphanedFile
source: {0} (deleted from disk)
uk: {0} (видалити з диска)

source: Rename
uk: Перейменувати

source: New File
uk: Новий Файл

source: New Folder
uk: Нова Папка

# openFolderFirst
source: Open a folder first to create files or folders within.
uk: Відкрийте папку для створення файлів або папок.

source: New Untitled File
uk: Новий файл без назви

# createNewFile
source: New File
uk: Новий Файл

# createNewFolder
source: New Folder
uk: Нова Папка

# deleteButtonLabelRecycleBin
source: &&Move to Recycle Bin
uk: &&Перемістити в кошик

# deleteButtonLabelTrash
source: &&Move to Trash
uk: && Пересунути до смітника

# deleteButtonLabel
source: &&Delete
uk: &&Видалити

# dirtyMessageFolderOneDelete
source: You are deleting a folder with unsaved changes in 1 file. Do you want to continue?
uk: Ви видаляєте папку з незбереженими змінами в 1-файлі. Ви хочете продовжити?

# dirtyMessageFolderDelete
source: You are deleting a folder with unsaved changes in {0} files. Do you want to continue?
uk: Ви маєте намір видалити папку з незбереженими змінами в файлах {0}. Ви хочете продовжити?

# dirtyMessageFileDelete
source: You are deleting a file with unsaved changes. Do you want to continue?
uk: Видалення файлу з незбереженими змінами. Ви дійсно хочете продовжити?

# dirtyWarning
source: Your changes will be lost if you don't save them.
uk: Ваші зміни будуть втрачені, якщо Ви не збережете їх.

# confirmMoveTrashMessageFolder
source: Are you sure you want to delete '{0}' and its contents?
uk: Ви впевнені, що хочете видалити '{0}' і його зміст?

# confirmMoveTrashMessageFile
source: Are you sure you want to delete '{0}'?
uk: Ви впевнені, що хочете видалити '{0}'?

# undoBin
source: You can restore from the recycle bin.
uk: Можна відновити з кошика.

# undoTrash
source: You can restore from the trash.
uk: Ви можете відновити його з кошика.

# confirmDeleteMessageFolder
source: Are you sure you want to permanently delete '{0}' and its contents?
uk: Ви впевнені, що хочете видалити '{0}' і його вміст?

# confirmDeleteMessageFile
source: Are you sure you want to permanently delete '{0}'?
uk: Ви впевнені, що хочете видалити '{0}'?

# permDelete
source: Delete Permanently
uk: Остаточно вилучити

source: Delete
uk: Видалити

source: Import Files
uk: Імпорт файлів

# confirmOverwrite
source: A file or folder with the same name already exists in the destination folder. Do you want to replace it?
uk: Файл або папка з таким ім'ям вже існує в папці призначення. Ви хочете замінити його?

# copyFile
source: Copy
uk: Скопіювати

# pasteFile
source: Paste
uk: Вставити

# duplicateFile
source: Duplicate
uk: Дублювати

# openToSide
source: Open to the Side
uk: Відкрити збоку

# compareSource
source: Select for Compare
uk: Обрати для порівняння

# globalCompareFile
source: Compare Active File With...
uk: Порівняння активного файлу з...

# openFileToCompare
source: Open a file first to compare it with another file.
uk: Відкрити перший файл, щоб порівняти його з іншим файлом.

# compareWith
source: Compare '{0}' with '{1}'
uk: Порівняти "{0}" з "{1}"

source: Compare Files
uk: Порівняти файли

source: Refresh
uk: Оновити

source: Save
uk: Зберегти

source: Save As...
uk: Зберегти Як...

source: Save All in Group
uk: Зберегти все в групі

# saveFiles
source: Save All Files
uk: Збережіть всі файли

# revert
source: Revert File
uk: Повернути файл

# genericRevertError
source: Failed to revert '{0}': {1}
uk: Не вдалося відновити '{0}': {1}

# focusOpenEditors
source: Focus on Open Editors View
uk: Фокус на відкритих редакторах

# focusFilesExplorer
source: Focus on Files Explorer
uk: Фокус на файли в провіднику

# showInExplorer
source: Reveal Active File in Side Bar
uk: Розкрити активний файл в бічній панелі

# openFileToShow
source: Open a file first to show it in the explorer
uk: Відкрити перший файл, щоб показати його в провіднику

# collapseExplorerFolders
source: Collapse Folders in Explorer
uk: Згорнути папки в провіднику

source: Refresh Explorer
uk: Оновити Провідник

# openFileInNewWindow
source: Open Active File in New Window
uk: Відкриті поточного файлу в новому вікні

# openFileToShowInNewWindow
source: Open a file first to open in new window
uk: Відкрийте файл спочатку, щоб відкрити в новому вікні

# revealInWindows
source: Reveal in Explorer
uk: Розкрити в провіднику

# revealInMac
source: Reveal in Finder
uk: Показати в Пошуку

# openContainer
source: Open Containing Folder
uk: Відкрити відповідну теку

# revealActiveFileInWindows
source: Reveal Active File in Windows Explorer
uk: Розкрити активний файл у провіднику Windows

# revealActiveFileInMac
source: Reveal Active File in Finder
uk: Розкрити активний файл у Finder

# openActiveFileContainer
source: Open Containing Folder of Active File
uk: Відкрити папку з активним файлом

source: Copy Path
uk: Копіювати шлях

# copyPathOfActive
source: Copy Path of Active File
uk: Копіювати шлях поточного файлу

# emptyFileNameError
source: A file or folder name must be provided.
uk: Ім'я файлу або папки повинні бути забезпечені.

# fileNameExistsError
source: A file or folder **{0}** already exists at this location. Please choose a different name.
uk: Файлу або папки **{0}** вже існує в даному місці. Будь ласка виберіть інше ім'я.

# invalidFileNameError
source: The name **{0}** is not valid as a file or folder name. Please choose a different name.
uk: Ім'я **{0}** не є допустимим як Ім'я файлу або папки. Будь ласка виберіть інше ім'я.

# filePathTooLongError
source: The name **{0}** results in a path that is too long. Please choose a shorter name.
uk: Ім'я **{0}** призводить до занадто довгого шляху. Будь ласка, вибирайте ім'я коротше.

# compareWithSaved
source: Compare Active File with Saved
uk: Порівняйте активний файл зі збереженим

# modifiedLabel
source: {0} (on disk) ↔ {1}
uk: {0} (На диску) ↔ {1}

# compareWithClipboard
source: Compare Active File with Clipboard
uk: Порівняйте Активні файлу з буфером обміну

# clipboardComparisonLabel
source: Clipboard ↔ {0}
uk: Буфер обміну ↔ {0}

source: Create File
uk: Створити Файл

# fileEditorWithInputAriaLabel
source: {0}. Text file editor.
uk: {0}. Редактор текстових файлів.

# fileEditorAriaLabel
source: Text file editor.
uk: Редактор текстових файлів.

# openFileToCopy
source: Open a file first to copy its path
uk: Відкрийте файл спочатку, щоб скопіювати його шлях

# openFileToReveal
source: Open a file first to reveal
uk: Відкрийте файл спочатку, щоб виявити

# binaryFileEditor
source: Binary File Viewer
uk: Двійковий Переглядач Файлів

# dirtyFile
source: 1 unsaved file
uk: 1 незбережений файл

# dirtyFiles
source: {0} unsaved files
uk: {0} незбережені файли

# label
source: Explorer
uk: Провідник

# canNotResolve
source: Can not resolve workspace folder
uk: Не можете вирішити папку робочої області
