Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_git(uk).xlf
Languages: uk

# toggleSCMViewlet
source: Show SCM
uk: Показати SCM

# checkoutBranch
source: Branch at {0}
uk: Гілка в {0}

# checkoutRemoteBranch
source: Remote branch at {0}
uk: Віддалена гілка в {0}

# checkoutTag
source: Tag at {0}
uk: Тег в {0}

# alreadyCheckedOut
source: Branch {0} is already the current branch
uk: Гілка {0} вже є поточною гілкою

# branchAriaLabel
source: {0}, git branch
uk: {0}, git гілка

# createBranch
source: Create branch {0}
uk: Створити гілку {0}

# noBranches
source: No other branches
uk: Ніяких інших гілок

# notValidBranchName
source: Please provide a valid branch name
uk: Будь ласка, введіть дійсне ім'я гілки

source: Switch to Changes View
uk: Перемикач для зміни виду

# openInEditor
source: Switch to Editor View
uk: Перейдіть в режим редактора

# workbenchStage
source: Stage
uk: Етап

# workbenchUnstage
source: Unstage
uk: Скасувати додавання

source: Stage Selected Lines
uk: Етап виділені лінії

source: Unstage Selected Lines
uk: Вибрані Рядки Прибрати З Буфера

source: Revert Selected Lines
uk: Відновити виділені лінії

# confirmRevertMessage
source: Are you sure you want to revert the selected changes?
uk: Ви впевнені, що хочете скасувати вибрані зміни?

# irreversible
source: This action is irreversible!
uk: Ця дія є незворотня!

# revertChangesLabel
source: &&Revert Changes
uk: &&Відкотити Зміни

source: Open Change
uk: Відкриття Зміни

source: Open File
uk: Відкрити Файл

# gitProgressBadge
source: Running git status
uk: Статус запуску git

# gitPendingChangesBadge
source: {0} pending changes
uk: {0} очікують зміни

# toggleGitViewlet
source: Show Git
uk: Показати Git

source: View
uk: Вид

source: Git Commands
uk: Команди Git

# gitEnabled
source: Is git enabled
uk: Git включений

# gitPath
source: Path to the git executable
uk: Шлях до виконуваного git

# gitAutoRefresh
source: Whether auto refreshing is enabled
uk: Чи ввімкнуто автоматичне оновлення

# gitAutoFetch
source: Whether auto fetching is enabled.
uk: Чи автоматична вибірка включена.

# gitLongCommit
source: Whether long commit messages should be warned about.
uk: Чи довго commit повідомлень повинні бути попереджені про.

# gitLargeRepos
source: Always allow large repositories to be managed by Code.
uk: Завжди дозволяти великі репозиторії, щоб бути керованим Code.

# confirmSync
source: Confirm before synchronizing git repositories.
uk: Підтвердження перед синхронізацією сховищ git.

# countBadge
source: Controls the git badge counter.
uk: Контролює бейдж гіт лічильника.

# checkoutType
source: Controls what type of branches are listed.
uk: Контролює, які види гілок перераховані.

# valid
source: Provide a valid git repository URL
uk: Надати дійсну URL-адресу репозиторію git

# url
source: Repository URL
uk: URL-адреса репозиторію

# directory
source: Destination clone directory
uk: Каталог призначення

# cloning
source: Cloning repository '{0}'...
uk: Клонування репозиторію '{0}'...

# already exists
source: Destination repository already exists, please pick another directory to clone to.
uk: Репозиторій вже існує, будь ласка виберіть інший каталог для клонування.

source: Init
uk: Ініціалізація

source: Refresh
uk: Оновити

# stageChanges
source: Stage
uk: Етап

# stageAllChanges
source: Stage All
uk: Офомити все

# confirmUndoMessage
source: Are you sure you want to clean all changes?
uk: Ви впевнені, що хочете очистити всі зміни?

# confirmUndoAllOne
source: There are unstaged changes in {0} file. This action is irreversible!
uk: Є неоформлені зміни в {0} файлі. Ця дія незворотня!

# confirmUndoAllMultiple
source: There are unstaged changes in {0} files. This action is irreversible!
uk: Є неоформлені зміни в {0} файлах. Ця дія незворотня!

# cleanChangesLabel
source: &&Clean Changes
uk: &&очистити Зміни

# confirmUndo
source: Are you sure you want to clean changes in '{0}'?
uk: Ви дійсно бажаєте очистити зміни в "{0}"?

# undoChanges
source: Clean
uk: Очищення

# undoAllChanges
source: Clean All
uk: Очистити Всі

source: Unstage
uk: Скасувати додавання

# unstageAllChanges
source: Unstage All
uk: Скасувати додавання всьго

# dirtyTreeCheckout
source: Can't checkout. Please commit or stash your work first.
uk: Неможливо перевірити. Будь-ласка, перш за все виконайте коміт або призупиніть вашу роботу.

source: Commit Staged
uk: Зробити коміт зафіксованого

source: Commit Staged (Amend)
uk: Зробити коміт зафіксованого (змінити останню фіксацію)

source: Commit Staged (Signed Off)
uk: Зробити коміт зафіксованого (Signed Off)

source: Commit
uk: Коміт

source: Commit Message
uk: Повідомлення коміту

source: Commit All
uk: Комітити Всі

source: Commit All (Signed Off)
uk: Комітити Всі (Signed Off)

# commitAll2
source: Commit All
uk: Комітити Всі

# commitStaged2
source: Commit Staged
uk: Зробити коміт зафіксованого

# dirtyTreePull
source: Can't pull. Please commit or stash your work first.
uk: Не можу зтягнути. Будь ласка, перш за все виконайте коміт або призупиніть вашу роботу.

# authFailed
source: Authentication failed on the git remote.
uk: Не вдалося виконати автентифікацію на віддаленому git.

# pushToRemote
source: Push to...
uk: Відправити до...

# pushToRemotePickMessage
source: Pick a remote to push the branch '{0}' to:
uk: Підібрати віддалений, щоб відправити гілку '{0}' до:

source: Publish
uk: Опублікувати

# confirmPublishMessage
source: Are you sure you want to publish '{0}' to '{1}'?
uk: Ви дійсно бажаєте опублікувати "{0}" до "{1}"?

# confirmPublishMessageButton
source: &&Publish
uk: &&Публікувати

# publishPickMessage
source: Pick a remote to publish the branch '{0}' to:
uk: Підібрати віддалений, щоб опублікувати гілку '{0}' до:

# sync is unpredictable
source: This action will push and pull commits to and from '{0}'.
uk: Ця дія буде відправляти і зтягувати фіксації з '{0}'.

source: OK
uk: Гаразд

source: Cancel
uk: Скасувати

# never again
source: OK, Never Show Again
uk: ОК, ніколи не показувати знову

source: Undo Last Commit
uk: Відмінити останній Комміт

# needMessage
source: Please provide a commit message. You can always press **{0}** to commit changes. If there are any staged changes, only those will be committed; otherwise, all changes will.
uk: Прохання повідомлення про фіксацію. Ви завжди можете натиснути **{0}** для фіксації змін. Якщо є якісь внесені зміни, тільки тих, хто буде зафіксований; в іншому випадку, всі зміни будуть.

# nothingToCommit
source: Once there are some changes to commit, type in the commit message and either press **{0}** to commit changes. If there are any staged changes, only those will be committed; otherwise, all changes will.
uk: Як тільки є деякі зміни, щоб зробити, введіть повідомлення та натисніть клавішу **{0}** для фіксації змін. Якщо є якісь внесені зміни, тільки тих, хто буде зафіксований; в іншому випадку, всі зміни будуть.

# longCommit
source: It is recommended to keep the commit's first line under 50 characters. Feel free to use more lines for extra information.
uk: Рекомендується тримати першу лінію фіксації по 50 символів. Не соромтеся використовувати кілька рядків додаткової інформації.

# commitMessage
source: Message (press {0} to commit)
uk: Повідомлення (натисніть {0} для фіксації)

# commitMessageAriaLabel
source: Git: Type commit message and press {0} to commit
uk: Git: введіть повідомлення та натисніть {0} для коміту

# treeAriaLabel
source: Git Changes View
uk: Перегляд змін Git

# showOutput
source: Show Git Output
uk: Показати вивід роботи Git

# noGit
source: This workspace isn't yet under git source control.
uk: Це робочий простір ще не під git для керування версіями.

# gitinit
source: Initialize Git Repository
uk: Ініціалізувати Git-Репозиторій

# macInstallWith
source: You can either install it with {0}, download it from {1} or install the {2} command line developer tools, by simply typing {3} on a Terminal prompt.
uk: Ви можете встановити його з {0}, завантажити його з {1} або встановіть Інструменти розробника командного рядка (2), просто, набравши {3} на терміналі.

# winInstallWith
source: You can either install it with {0} or download it from {1}.
uk: Ви можете або встановити його з {0} або завантажити його з {1}.

# linuxDownloadFrom
source: You can download it from {0}.
uk: Ви можете завантажити його з {0}.

# downloadFrom
source: You can download it from {0}.
uk: Ви можете завантажити його з {0}.

# looksLike
source: It looks like git is not installed on your system.
uk: Схоже, що git не встановлений на вашій системі.

# pleaseRestart
source: Once git is installed, please restart VSCode.
uk: Після установки git, будь ласка, перезавантажте VSCode.

# wrongRoot
source: This directory seems to be contained in a git repository.
uk: Цей каталог здається, що міститься в репозиторії git.

# pleaseRestart
source: Open the repository's root directory in order to access Git features.
uk: Відкрийте кореневий каталог репозиторію, щоб отримати доступ до функцій Git.

# noWorkspaceHelp
source: You have not yet opened a folder.
uk: Ви ще не відкрили папку.

# pleaseRestart
source: Open a folder with a Git repository in order to access Git features.
uk: Відкрити папку з Git репозиторію для того, щоб отримати доступ до функцій Git.

source: Open Folder
uk: Відкрийте Папку

# disabled
source: Git is disabled in the settings.
uk: Git вимкнуто в настройках.

# huge
source: Your repository appears to have many active changes. This can cause Code to become very slow.
uk: Здається, у вашому сховищі багато активних змін. Це може сповільнити Code.

# setting
source: You can permanently disable this warning with the following setting:
uk: Ви можете відключити це попередження з наступними параметрами:

# allo
source: Allow large repositories
uk: Дозволити великі сховища

# errorBuffer
source: Can't open file from git
uk: Не вдалося відкрити файл з git

# fileBinaryError
source: File seems to be binary and cannot be opened as text
uk: Файл, здається, бінарний і не може бути відкритий як текстовий

source: Publish Branch
uk: Опублікувати гілку

# syncBranch
source: Synchronize Changes
uk: Синхронізувати Зміни

# gitNotEnabled
source: Git is not enabled in this workspace.
uk: Git не ввімкнуто в цій робочій області.

# cantOpen
source: Can't open this git resource.
uk: Не вдалося відкрити цей ресурс git.

# gitIndexChanges
source: {0} (index) ↔ {1}
uk: {0} (індекс) ↔ {1}

# gitIndexChangesDesc
source: {0} - Changes on index
uk: {0} - зміни в індексі

# gitIndexChangesRenamedDesc
source: {0} - Renamed - Changes on index
uk: {0}, перейменований - зміни в індексі

# workingTreeChanges
source: {0} (HEAD) ↔ {1}
uk: {0} (голова) ↔ {1}

# workingTreeChangesDesc
source: {0} - Changes on working tree
uk: {0} - зміни в робочому дереві

# gitMergeChanges
source: {0} (merge) ↔ {1}
uk: {0} (злиття) ↔ {1}

# gitMergeChangesDesc
source: {0} - Merge changes
uk: {0} - злиття змін

# updateGit
source: You seem to have git {0} installed. Code works best with git >=2.0.0.
uk: Ви, здається, маєте встановлений git {0}. Code найкраще працює з git > = 2.0.0.

source: Download
uk: Завантажити

# neverShowAgain
source: Don't show again
uk: Більше не показувати

# configureUsernameEmail
source: Please configure your git user name and e-mail.
uk: Будь ласка, налаштуйте ваш git ім'я користувача та адресу електронної пошти.

# unmergedChanges
source: You should first resolve the unmerged changes before committing your changes.
uk: Перш ніж вносити ваші зміни, спочатку потрібно вирішити незлиті зміни.

source: Show Output
uk: Показати вивід

# checkNativeConsole
source: There was an issue running a git operation. Please review the output or use a console to check the state of your repository.
uk: Виникла проблема під час операції git. Будь ласка, перегляньте випуск або скористайтеся консоллю, щоб перевірити стан свого сховища.

# changesFromIndex
source: {0} (index)
uk: {0} (індекс)

# changesFromIndexDesc
source: {0} - Changes on index
uk: {0} - зміни в індексі

# changesFromTreeDesc
source: {0} - Changes on {1}
uk: {0} - зміни на {1}

# cantOpenResource
source: Can't open this git resource.
uk: Не вдалося відкрити цей ресурс git.

source: Staged Changes
uk: Зафіксувати зміни

# allChanges
source: Changes
uk: Зміни

source: Merge Changes
uk: Злиття Змін

# outsideOfWorkspace
source: This file is located outside the current workspace.
uk: Цей файл розміщено за межами поточного робочого простору.

# modified-char
source: M
uk: М

# added-char
source: A
uk: Д

# deleted-char
source: D
uk: З

# renamed-char
source: R
uk: П

# copied-char
source: C
uk: К

# untracked-char
source: U
uk: У

# title-index-modified
source: Modified in index
uk: Змінено індекс

# title-modified
source: Modified
uk: Змінений

# title-index-added
source: Added to index
uk: Додано в індекс

# title-index-deleted
source: Deleted in index
uk: Видалено з індексу

# title-deleted
source: Deleted
uk: Вилучений

# title-index-renamed
source: Renamed in index
uk: Перейменовано в індексі

# title-index-copied
source: Copied in index
uk: Скопіював в індекс

# title-untracked
source: Untracked
uk: Невідстежувані

# title-ignored
source: Ignored
uk: Ігноруються

# title-conflict-both-deleted
source: Conflict: both deleted
uk: Конфлікт: обидва видалені

# title-conflict-added-by-us
source: Conflict: added by us
uk: Конфлікт: Додано нами

# title-conflict-deleted-by-them
source: Conflict: deleted by them
uk: Конфлікт: видалений ними

# title-conflict-added-by-them
source: Conflict: added by them
uk: Конфлікт: додано ними

# title-conflict-deleted-by-us
source: Conflict: deleted by us
uk: Конфлікт: видалений нами

# title-conflict-both-added
source: Conflict: both added
uk: Конфлікт: обидва додали

# title-conflict-both-modified
source: Conflict: both modified
uk: Конфлікту: обидва змінили

# fileStatusAriaLabel
source: File {0} in folder {1} has status: {2}, Git
uk: Файл {0} у {1} папка має статус: {2}, Git

# ariaLabelStagedChanges
source: Staged Changes, Git
uk: Зафіксувати зміни, Git

# ariaLabelChanges
source: Changes, Git
uk: Зміни, Git

# ariaLabelMerge
source: Merge, Git
uk: Злиття, Git
