Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vs_workbench_parts_snippets(uk).xlf
Languages: uk

# openSnippet.pickLanguage
source: Select Language for Snippet
uk: Виберіть мову для Фрагменту

# openSnippet.errorOnCreate
source: Unable to create {0}
uk: Не вдається створити {0}

# openSnippet.label
source: Open User Snippets
uk: Відкриті Фрагменти Користувача

source: Preferences
uk: Налаштування

# snippetSchema.json.default
source: Empty snippet
uk: Порожній фрагмент

# snippetSchema.json
source: User snippet configuration
uk: Фрагмент Конфігурація користувача

# snippetSchema.json.prefix
source: The prefix to used when selecting the snippet in intellisense
uk: Префікс, що використовується при виборі фрагмента в автопропозиціях(intellisense)

# snippetSchema.json.body
source: The snippet content. Use '$1', '${1:defaultText}' to define cursor positions, use '$0' for the final cursor position. Insert variable values with '${varName}' and '${varName:defaultText}', e.g 'This is file: $TM_FILENAME'.
uk: Зміст фрагменту. Використовувати '$1', '${1:defaultText}' для визначення позиції курсору, використовуйте '$0' для остаточної позиції курсору. Вставити значення змінних з '${varName} " і " ${varName:defaultText}', yfghbrkfl 'Це файл: $TM_FILENAME'.

# snippetSchema.json.description
source: The snippet description.
uk: Опис фрагменту.

# snippet.suggestions.label
source: Insert Snippet
uk: Вставити фрагмент

# sep.userSnippet
source: User Snippets
uk: Користувацькі фрагменти

# sep.extSnippet
source: Extension Snippets
uk: Фрагменти додатку

# tabCompletion
source: Insert snippets when their prefix matches. Works best when 'quickSuggestions' aren't enabled.
uk: Вставити фрагменти, коли є збіг їх префікса. Найкраще працює, коли 'quickSuggestions' не включений.

# invalid.language
source: Unknown language in `contributes.{0}.language`. Provided value: {1}
uk: Невідома мова в `contributes.{0}.language`. Пропоновані значення: {1}

# invalid.path.0
source: Expected string in `contributes.{0}.path`. Provided value: {1}
uk: Очікуються рядки в `contributes.{0}.path`. Пропоновані значення: {1}

# invalid.path.1
source: Expected `contributes.{0}.path` ({1}) to be included inside extension's folder ({2}). This might make the extension non-portable.
uk: Очікуваний `contributes.{0}.path` ({1}), щоб бути включеними в папці модуля ({2}). Це може усунути портативність додатку.

# vscode.extension.contributes.snippets
source: Contributes snippets.
uk: Внесені фрагменти.

# vscode.extension.contributes.snippets-language
source: Language identifier for which this snippet is contributed to.
uk: Ідентифікатор мови, для якого цей фрагмент внесли.

# vscode.extension.contributes.snippets-path
source: Path of the snippets file. The path is relative to the extension folder and typically starts with './snippets/'.
uk: Шлях фрагментів файлу. Шлях є відносним до папки розширень і, як правило, починається з './snippets/'.

# badVariableUse
source: One or more snippets from the extension '{0}' very likely confuse snippet-variables and snippet-placeholders (see https://code.visualstudio.com/docs/editor/userdefinedsnippets#_snippet-syntax for more details)
uk: Один або більше фрагментів з розширенням '{0}' цілком ймовірно, заплутають змінні-фрагменти та заповнювачі фрагментів (див. https://code.visualstudio.com/docs/editor/userdefinedsnippets#_snippet-syntax для більш докладної інформації)

# badFile
source: The snippet file "{0}" could not be read.
uk: Не вдалося прочитати файл фрагмента "{0}".

# source.snippet
source: User Snippet
uk: Користувацький фрагмент
