Repository: Bhaskers-Blu-Org2/Localization
Catalog: Locale/Ukrainian/*/vscode-node-debug(uk).xlf
Languages: uk

# extension.description
source: Visual Studio Code debugger extension for Node.js
uk: Розширення Visual Studio відладчик коду Node.js

source: Open Loaded Script
uk: Відкрийте Завантажений Скрипт

source: Toggle Skipping this File
uk: Переключити пропускання цього файлу

# loaded.scripts.view.name
source: Loaded Scripts
uk: Завантажені Скрипти

# smartStep.description
source: Automatically step through generated code that cannot be mapped back to the original source.
uk: Автоматично крок через код, який не може бути зіставлений назад до першоджерела.

# skipFiles.description
source: An array of glob patterns for files to skip when debugging.
uk: Масив glob-шаблони для файлів, щоб пропустити при налагодженні.

# outFiles.description
source: If source maps are enabled, these glob patterns specify the generated JavaScript files. If a pattern starts with '!' the files are excluded. If not specified, the generated code is expected in the same directory as its source.
uk: Якщо включені джерельні карти, ці глобальні шаблони вказують сгенеровані файли JavaScript. Якщо шаблон починається з '!' файли виключаються. Якщо не вказано, згенерований код очікується в тому ж каталозі, що і його джерело.

# outDir.deprecationMessage
source: Attribute 'outDir' is deprecated, use 'outFiles' instead.
uk: "OutDir" атрибут є застарілим, використовуйте "outFiles" натомість.

# trace.description
source: Produce diagnostic output. Instead of setting this to true you can list one or more selectors separated with commas. The 'verbose' selector enables very detailled output.
uk: Провести діагностичний висновок. Замість установки цього параметра в True ви можете вказати один або кілька селекторів через кому. В 'verbose' селектор дозволяє дуже детальні вихід.

# launch.args.description
source: Command line arguments passed to the program.
uk: Аргументи командного рядка передаються в програму.

# node.protocol.description
source: Node.js debug protocol to use.
uk: Node.js налагодження протокол.

# node.protocol.auto.description
source: try to detect the best protocol automatically, selecting 'inspector' for launching Node 8.0+
uk: намагається автоматично визначити оптимальний протокол, виберіть "інспектор" для запуску Node 8.0+

# node.protocol.inspector.description
source: new protocol supported by Node.js versions >= 6.3
uk: новий протокол підтримується Node.js версіями > = 6.3

# node.protocol.legacy.description
source: old protocol supported by Node.js versions < 8.0
uk: старий протокол підтримується в Node.js версії < 8.0

# node.sourceMaps.description
source: Use JavaScript source maps (if they exist).
uk: Використання JavaScript джерело мапи (якщо вони існують).

# node.stopOnEntry.description
source: Automatically stop program after launch.
uk: Автоматично зупинити програму після запуску.

# node.port.description
source: Debug port to attach to. Default is 5858.
uk: Порт для приєднання до налагодження. За замовчуванням-5858.

# node.address.description
source: TCP/IP address of process to be debugged (for Node.js >= 5.0 only). Default is 'localhost'.
uk: Протокол TCP/IP-адресу процес повинен бути налагоджений (для Node.js >= 5.0 тільки). За замовчуванням - 'localhost'.

# node.timeout.description
source: Retry for this number of milliseconds to connect to Node.js. Default is 10000 ms.
uk: Повторити цю кількість мілісекунд, щоб підключитися до Node.js. Значенням за замовчанням є 10000 ms.

# node.restart.description
source: Restart session after Node.js has terminated.
uk: Перезапуск після сесії Node.js був завершений.

# node.localRoot.description
source: Path to the local directory containing the program.
uk: Шлях до локального каталогу, який містить програму.

# node.remoteRoot.description
source: Absolute path to the remote directory containing the program.
uk: Абсолютний шлях до віддаленого каталогу, який містить програму.

# node.showAsyncStacks.description
source: Show the async calls that led to the current call stack. 'inspector' protocol only.
uk: Показати на асинхронні виклики, які призвели до поточного стеку викликів. "Інспектор" лише для протоколу.

# node.sourceMapPathOverrides.description
source: A set of mappings for rewriting the locations of source files from what the sourcemap says, to their locations on disk.
uk: Набір відображень для переписування розташувань вихідних файлів з того, що називається sourcemap, до їх розташування на диску.

# node.launch.program.description
source: Absolute path to the program. Generated value is guessed by looking at package.json and opened files. Edit this attribute.
uk: Абсолютний шлях до програми. Згенероване значення догадалося, дивлячись на package.json та відкриті файли. Редагувати цей атрибут.

# node.launch.externalConsole.deprecationMessage
source: Attribute 'externalConsole' is deprecated, use 'console' instead.
uk: ExternalConsole атрибут є застарілим, використовуйте замість цього 'console'.

# node.launch.console.description
source: Where to launch the debug target.
uk: Де можна запустити налагодження цілі.

# node.launch.console.internalConsole.description
source: VS Code Debug Console (which doesn't support to read input from a program)
uk: VS Code консоль налагодження (який не підтримує читання вхідних даних з програми)

# node.launch.console.integratedTerminal.description
source: VS Code's integrated terminal
uk: Інтегрований термінал VS Code's

# node.launch.console.externalTerminal.description
source: external terminal that can be configured via user settings
uk: зовнішній термінал, який можна налаштувати за допомогою налаштувань користувача

# node.launch.cwd.description
source: Absolute path to the working directory of the program being debugged.
uk: Абсолютний шлях до робочої директорії налагоджують програми.

# node.launch.runtimeExecutable.description
source: Runtime to use. Either an absolute path or the name of a runtime available on the PATH. If omitted 'node' is assumed.
uk: Під час виконання, щоб використовувати. Абсолютний шлях або ім'я виконання в PATH. Якщо передбачається пропущенння 'node'.

# node.launch.runtimeArgs.description
source: Optional arguments passed to the runtime executable.
uk: Додаткові аргументи, передані в виконуваний файл.

# node.launch.runtimeVersion.description
source: Version of 'node' runtime to use. Requires 'nvm'.
uk: Версія 'node' під час виконання, щоб використовувати. Вимагає 'nvm'.

# node.launch.env.description
source: Environment variables passed to the program. The value 'null' removes the variable from the environment.
uk: Змінні оточення, передані програмі. Значення 'NULL' видаляє змінну з оточення.

# node.launch.envFile.description
source: Absolute path to a file containing environment variable definitions.
uk: Абсолютний шлях до файлу, який містить змінну середовища визначення.

# node.launch.useWSL.description
source: Use Windows Subsystem Linux.
uk: Використовувати Windows Підсистему Linux.

# node.launch.outputCapture.description
source: From where to capture output messages: The debug API, or stdout/stderr streams.
uk: Звідки взяти вихідні повідомлення: протоколи налагодження або потоки stdout / stderr.

# node.launch.autoAttachChildProcesses.description
source: Attach debugger to new child processes automatically.
uk: Приєднати налагоджувач до нових дочірніх процесів автоматично.

# node.launch.config.name
source: Launch
uk: Запуск

# node.attach.processId.description
source: Id of process to attach to.
uk: Ідентифікатор процесу для приєднання до.

# node.attach.config.name
source: Attach
uk: Прикріпити

# node.processattach.config.name
source: Attach to Process
uk: Прикріпити до процесу

# node.snippet.launch.label
source: Node.js: Launch Program
uk: Node.js: Запуск Програми

# node.snippet.launch.description
source: Launch a node program in debug mode
uk: Запустити програму node в режимі налагодження

# node.snippet.npm.label
source: Node.js: Launch via NPM
uk: Node.js: Запуск через NPM

# node.snippet.npm.description
source: Launch a node program through an npm 'debug' script
uk: Запускати програму node через на npm 'debug' сценарій

# node.snippet.attach.label
source: Node.js: Attach
uk: Node.js Приєднання

# node.snippet.attach.description
source: Attach to a running node program
uk: Додати до працюючої програми node

# node.snippet.remoteattach.label
source: Node.js: Attach to Remote Program
uk: Node.js приєднання до віддаленої програми

# node.snippet.remoteattach.description
source: Attach to the debug port of a remote node program
uk: Прикріпити до віддаленого node програми, Порт налагодження

# node.snippet.attachProcess.label
source: Node.js: Attach to Process
uk: Node.js: приєднання до процесу

# node.snippet.attachProcess.description
source: Open process picker to select node or gulp process to attach to
uk: Відкрийте процес вибору, щоб вибрати node або процес gulp для приєднання до

# node.snippet.nodemon.label
source: Node.js: Nodemon Setup
uk: Node.js: Налаштування Nodemon

# node.snippet.nodemon.description
source: Use nodemon to relaunch a debug session on source changes
uk: Відновити сеанс налагодження зі змінами джерела за допомогою nodemon

# node.snippet.mocha.label
source: Node.js: Mocha Tests
uk: Node.js: Тести Mocha

# node.snippet.mocha.description
source: Debug mocha tests
uk: Налагодження Mocha тести

# node.snippet.yo.label
source: Node.js: Yeoman generator
uk: Node.js: генератор yeoman

# node.snippet.yo.description
source: Debug yeoman generator (install by running 'npm link' in project folder)
uk: Налагодження yeoman генератор (встановити, запустивши 'npm link' в папці проекту)

# node.snippet.gulp.label
source: Node.js: Gulp task
uk: Node.js: Gulp завдання

# node.snippet.gulp.description
source: Debug gulp task (make sure to have a local gulp installed in your project)
uk: Налагодження Gulp завдання (переконайтеся, що Gulp, встановлений локально в проекті)

# node.snippet.electron.label
source: Node.js: Electron Main
uk: Node.js: Головний Електрон

# node.snippet.electron.description
source: Debug the Electron main process
uk: Налагодження основного процесу Електрон

# setVariable.error
source: Setting value not supported
uk: Значення параметра не підтримується

# exception.paused.promise.rejection
source: Paused on Promise Rejection
uk: Призупинено на викид проміса

# exception.promise.rejection.text
source: Promise Rejection ({0})
uk: Викид проміса ({0})

# exception.promise.rejection
source: Promise Rejection
uk: Викид проміса

# reason.description.step
source: Paused on step
uk: Призупинено на крок

# reason.description.breakpoint
source: Paused on breakpoint
uk: Призупинено на точка зупинки

# reason.description.exception
source: Paused on exception
uk: Призупинено на виняток

# reason.description.user_request
source: Paused on user request
uk: Призупинено за запитом користувача

# reason.description.entry
source: Paused on entry
uk: Призупинено на в'їзді

# reason.description.debugger_statement
source: Paused on debugger statement
uk: Призупинено на заяву налагоджувача

# reason.description.restart
source: Paused on frame entry
uk: Призупинено запис на кадрі

# exceptions.all
source: All Exceptions
uk: Усі винятки

# exceptions.uncaught
source: Uncaught Exceptions
uk: Невичерпні винятки

# exceptions.rejects
source: Promise Rejects
uk: Викид проміса

# VSND2028
source: Unknown console type '{0}'.
uk: Невідомий Тип консолі '{0}'.

# attribute.wls.not.exist
source: Cannot find Windows Subsystem Linux installation
uk: Не вдалося знайти установку Windows підсистеми Linux

# VSND2001
source: Cannot find runtime '{0}' on PATH. Make sure to have '{0}' installed.
uk: Не вдалося знайти runtime "{0}" у PATH. Переконайтеся, що "{0}", встановлені.

# program.path.case.mismatch.warning
source: Program path uses differently cased character as file on disk; this might result in breakpoints not being hit.
uk: Шлях програми використовує по-різному покритий символ як файл на диску; це може призвести до того, що точки зупинки не потраплять.

# VSND2002
source: Cannot launch program '{0}'; configuring source maps might help.
uk: Не вдається запустити програму '{0}'; налаштування джер. карт може допомогти.

# VSND2009
source: Cannot launch program '{0}' because corresponding JavaScript cannot be found.
uk: Не вдалося запустити програму "{0}", тому що відповідного JavaScript не знайдено.

# VSND2003
source: Cannot launch program '{0}'; setting the '{1}' attribute might help.
uk: Не вдалося запустити програму "{0}"; налаштування "{1}" атрибуту може допомогти.

# VSND2029
source: Can't load environment variables from file ({0}).
uk: Не вдалося завантажити змінні оточення з файлу ({0}).

# node.console.title
source: Node Debug Console
uk: Node консоль налагодження

# VSND2011
source: Cannot launch debug target in terminal ({0}).
uk: Не вдається запустити налагодження цілі в терміналі ({0}).

# VSND2017
source: Cannot launch debug target ({0}).
uk: Не вдається запустити налагодження цілі ({0}).

# VSND2010
source: Cannot connect to runtime process (reason: {0}).
uk: Не вдається підключитися до процесу виконання (причина: {0}).

# VSND2033
source: Cannot connect to runtime; make sure that runtime is in 'legacy' debug mode.
uk: Неможливо підключитися до runtime; переконайтеся, що runtime знаходиться в режимі налагодження 'legacy'.

# VSND2034
source: Cannot connect to runtime via 'legacy' protocol; try to use 'inspector' protocol.
uk: Не вдається підключитися до виконання через 'legacy' протокол; спробуйте 'inspector' протокол.

# file.on.disk.changed
source: Unverified because file on disk has changed. Please restart debug session.
uk: Непідтверджено, оскільки файл на диску змінився. Будь ласка, перезапустіть сеанс налагодження.

# VSND2019
source: Internal module {0} not found.
uk: Внутрішній модуль {0} не знайдено.

# sourcemapping.fail.message
source: Breakpoint ignored because generated code not found (source map problem?).
uk: Точки зупинки ігноруються, оскільки згенерований код не знайдено (проблема вихідної карти?).

# VSND2022
source: No call stack because program paused outside of JavaScript.
uk: Немає стека викликів, тому що програму призупинено за межами JavaScript.

# VSND2023
source: No call stack available.
uk: Жодний стек викликів не доступний.

# VSND2018
source: No call stack available ({_command}: {_error}).
uk: Немає виклику стека ({_command}: {_error}).

# origin.from.node
source: read-only content from Node.js
uk: тільки для читання вмісту з Node.js

# origin.from.remote.node
source: read-only content from remote Node.js
uk: тільки для читання даних з віддаленим Node.js

# origin.core.module
source: read-only core module
uk: читати-тільки основний модуль

# source.skipFiles
source: skipped due to 'skipFiles'
uk: пропущено через 'skipFiles'

# source.smartstep
source: skipped due to 'smartStep'
uk: пропущено через 'smartStep'

# origin.inlined.source.map
source: read-only inlined content from source map
uk: тільки для читання вмісту з джерел. карт

source: (anonymous function)
uk: (анонімна функція)

# scope.local.with.count
source: Local ({0} of {1})
uk: Місцеві ({0} з {1})

# scope.unknown
source: Unknown Scope Type: {0}
uk: Невідомий Тип Рамки: {0}

# scope.exception
source: Exception
uk: Виняток

# eval.not.available
source: not available
uk: не доступний

# eval.invalid.expression
source: invalid expression: {0}
uk: некоректний вираз: {0}

# source.not.found
source: Could not retrieve content.
uk: Не вдалося витягти вміст.

# attribute.path.not.exist
source: Attribute '{0}' does not exist ('{1}').
uk: Атрибут '{0}' не існує ('{1}').

# attribute.path.not.absolute
source: Attribute '{0}' is not absolute ('{1}'); consider adding '{2}' as a prefix to make it absolute.
uk: Атрибут '{0}' не є абсолютним ('{1}'); спробуйте додати '{2}' префікс, щоб зробити його абсолютним.

source: More Information
uk: Додаткові відомості

# VSND2015
source: Request '{_request}' was cancelled because Node.js is unresponsive.
uk: Запит {_request} скасовано, оскільки Node.js не працює.

# VSND2016
source: Node.js did not respond to request '{_request}' in a reasonable amount of time.
uk: Node.js не відреагував на запит {_request} в розумні терміни.

# scope.global
source: Global
uk: Глобальної

# scope.local
source: Local
uk: Місцевий

# scope.with
source: With
uk: З

# scope.closure
source: Closure
uk: Закриття

# scope.catch
source: Catch
uk: Зловити

# scope.block
source: Block
uk: Блок

# scope.script
source: Script
uk: Сценарій

# not.connected
source: not connected to runtime
uk: не підключений до виконання

# runtime.unresponsive
source: cancelled because Node.js is unresponsive
uk: скасували, тому що Node.js не відповідає

# runtime.timeout
source: timeout after {0} ms
uk: тайм-аут після {0} мс
